#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PCTools_Wakemaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_PCTools_Wakemaker_structs.hpp"
#include "F_AnimSequencePlayerData_structs.hpp"
#include "Subnautica2_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_PCTools_Wakemaker.ABP_PCTools_Wakemaker_C
// 0x16D0 (0x1AD0 - 0x0400)
class UABP_PCTools_Wakemaker_C final : public USN2PlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_PCTools_Wakemaker::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x0408(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x0420(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0428(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0430(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0438(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0458(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0510(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x0590(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0678(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x06A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x06C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x06F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0718(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x0760(0x00E8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0848(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0970(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0990(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0AB8(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0AD8(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0BC0(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0C30(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0CA0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0CC0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0D08(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0D28(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0DF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0E18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0E40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0E68(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0E90(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0ED8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0EF8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0F40(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0F60(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0FA8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x0FC8(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0FD8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0FF8(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x10C0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1188(0x0080)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1208(0x00B8)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x12C0(0x0120)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x13E0(0x0550)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1930(0x0020)()
	bool                                          K2Node_PropertyAccess_6;                           // 0x1950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_5;                           // 0x1951(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_3;                           // 0x1952(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_1;                           // 0x1953(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1954[0x4];                                     // 0x1954(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __CustomProperty_BodyAngleAimOffset_3C6F4312416D69459F76DD8A07D33B0A; // 0x1958(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_ThrowToolAnim_3C6F4312416D69459F76DD8A07D33B0A; // 0x1960(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_UnEquipToolAnim_3C6F4312416D69459F76DD8A07D33B0A; // 0x1980(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_BreakNodeToolAnim_3C6F4312416D69459F76DD8A07D33B0A; // 0x19A0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_FirstEquipToolAnim_3C6F4312416D69459F76DD8A07D33B0A; // 0x19C0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_EquipToolAnim_3C6F4312416D69459F76DD8A07D33B0A; // 0x19E0(0x0020)(NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterAnimationComponent_C*     __CustomProperty_AnimationComponent_3C6F4312416D69459F76DD8A07D33B0A; // 0x1A00(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterAnimationComponent_C*     AnimationComponent;                                // 0x1A08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsToolUnequipped;                                 // 0x1A10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A11[0x7];                                     // 0x1A11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PropellerRotation;                                 // 0x1A18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Time_X;                                      // 0x1A20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A24[0x4];                                     // 0x1A24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PropellerRotationDamp;                             // 0x1A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            Body_Angle_Aim_Offset;                             // 0x1A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              Equip_Tool_Anim;                                   // 0x1A38(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              First_Equip_Tool_Anim;                             // 0x1A58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              Break_Node_Tool_Anim;                              // 0x1A78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              Un_Equip_Tool_Anim;                                // 0x1A98(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  OwnerPawn;                                         // 0x1AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Energy_Level;                                      // 0x1AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EndAbility();
	void EndAnimation(class UAnimSequenceBase* Animation);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PCTools_Wakemaker_AnimGraphNode_BlendSpacePlayer_2ABC5C4049F5478E8ADABFBA44724CD1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PCTools_Wakemaker_AnimGraphNode_BlendSpacePlayer_2F58CE0440F716C048BD72BF612F5952();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PCTools_Wakemaker_AnimGraphNode_ModifyBone_47086E594963E5D6659A7DAD01FE53E0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PCTools_Wakemaker_AnimGraphNode_TransitionResult_257912FB4F0EDD5473A228837C41005F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PCTools_Wakemaker_AnimGraphNode_TransitionResult_8526BA1B474EC10E201EF5BC1FA28BA4();
	void ExecuteUbergraph_ABP_PCTools_Wakemaker(int32 EntryPoint);
	void OnAnimStateReturn();
	void OnAttachPlayerDriver(class AActor* PlayerDriver, bool AttachPlayer);
	void OnSyncedAnimationBegin(bool bUseAITarget, bool bDrivePlayer, const struct FAnimNotifyEventReference& EventReference, const struct FF_AnimSyncSettings& AnimSyncSettings);
	void OnSyncedAnimationEnd();
	void OnToolIsUnequipped();
	void OnUnequipToolFinished(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& node);
	void OnUnequipToolStarted(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& node);
	void PlayMontageOnEquipped(class UAnimMontage* Montage, double PlayRate, bool StopAllMontages);
	void SendPoseSnapshot(const struct FPoseSnapshot& PoseSnapshot);
	void SetCurrentToolEnergy(double Energy);
	void SetupAndBeginSyncedAnimation(class AActor* DrivenActor, bool AttachDriven);
	void StopMontageOnEquipped(class UAnimMontage* Montage, double BlendOutTime);
	void Tools_Logic(const struct FPoseLink& InPose, struct FPoseLink* Tools_Logic_0);
	void UpdateAnimationEventTags(const struct FGameplayTag& Gameplay_Tag);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_PCTools_Wakemaker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_PCTools_Wakemaker_C")
	}
	static class UABP_PCTools_Wakemaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PCTools_Wakemaker_C>();
	}
};
DUMPER7_ASSERTS_UABP_PCTools_Wakemaker_C;

SDK_NAMESPACE_END
