#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ABP_Scanner

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Subnautica2_classes.hpp"
#include "ABP_Scanner_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Scanner.ABP_Scanner_C
// 0x2F5C4C00 (0x2F5C5000 - 0x0400)
class alignas(0x2F5C5000) UABP_Scanner_C final : public USN2BaseAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Scanner::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                  // 0x0408(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40A[0x6];                                      // 0x040A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0410(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0418(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0420(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0440(0x0158)(ContainsInstancedReference)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0598(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05E8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0630(0x0048)()
	bool                                          Equipped;                                          // 0x0678(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Primary_State;                                     // 0x0679(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ValidSourceMesh;                                   // 0x067A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67B[0x5];                                      // 0x067B(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	class USkeletalMeshComponent*                 Source_Mesh_Component;                             // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_Primary_Off();
	void AnimNotify_Primary_On();
	void ExecuteUbergraph_ABP_Scanner(int32 EntryPoint);
	bool Is_First_Use();
	void SetCarryActor(class AActor* Actor);
	void SetMeshDriver(class USkeletalMeshComponent* SourceMeshComponent);
	void SetToolEnergy(double EnergyLevel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Scanner_C">();
	}
	static class UABP_Scanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Scanner_C>();
	}
};

}

