#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ABP_PCLayer_Vehicle_HAUL

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_VehiclePlayerAttachments_structs.hpp"


namespace SDK::Params
{

// Function ABP_PCLayer_Vehicle_HAUL.ABP_PCLayer_Vehicle_HAUL_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PCLayer_Vehicle_HAUL_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_PCLayer_Vehicle_HAUL.ABP_PCLayer_Vehicle_HAUL_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_PCLayer_Vehicle_HAUL_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ABP_PCLayer_Vehicle_HAUL.ABP_PCLayer_Vehicle_HAUL_C.ExecuteUbergraph_ABP_PCLayer_Vehicle_HAUL
// 0x0030 (0x0030 - 0x0000)
struct ABP_PCLayer_Vehicle_HAUL_C_ExecuteUbergraph_ABP_PCLayer_Vehicle_HAUL final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_VehiclePlayerAttachments                    CallFunc_Map_Find_Value;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_VehiclePlayerAttachments                    CallFunc_Map_Find_Value_1;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterAnimationComponent_C*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function ABP_PCLayer_Vehicle_HAUL.ABP_PCLayer_Vehicle_HAUL_C.OnStateEntry
// 0x0020 (0x0020 - 0x0000)
struct ABP_PCLayer_Vehicle_HAUL_C_OnStateEntry final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};

// Function ABP_PCLayer_Vehicle_HAUL.ABP_PCLayer_Vehicle_HAUL_C.OnStateFullyBlendedIn
// 0x0020 (0x0020 - 0x0000)
struct ABP_PCLayer_Vehicle_HAUL_C_OnStateFullyBlendedIn final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};

// Function ABP_PCLayer_Vehicle_HAUL.ABP_PCLayer_Vehicle_HAUL_C.Vehicle Attach
// 0x0020 (0x0020 - 0x0000)
struct ABP_PCLayer_Vehicle_HAUL_C_Vehicle_Attach final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Vehicle_Attach_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

}

