#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AngelComb_Adult_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_AngelComb_Adult_01_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Subnautica2_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AngelComb_Adult_01.ABP_AngelComb_Adult_01_C
// 0x02A0 (0x06A0 - 0x0400)
class UABP_AngelComb_Adult_01_C final : public USN2BaseAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_AngelComb_Adult_01::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;       // 0x0408(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40A[0x6];                                      // 0x040A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0410(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0418(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0420(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0440(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0488(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x04D8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0500(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0548(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0568(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x05B0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x05D0(0x00C8)()
	bool                                          IsOpen;                                            // 0x0698(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnOpenedStateChanged(bool Open);
	void ExecuteUbergraph_ABP_AngelComb_Adult_01(int32 EntryPoint);
	void BlueprintBeginPlay();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AngelComb_Adult_01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AngelComb_Adult_01_C")
	}
	static class UABP_AngelComb_Adult_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AngelComb_Adult_01_C>();
	}
};
DUMPER7_ASSERTS_UABP_AngelComb_Adult_01_C;

SDK_NAMESPACE_END
