#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ABP_PCLayer_Vehicle_DiveElevator

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_PCLayer_Vehicle_DiveElevator.ABP_PCLayer_Vehicle_DiveElevator_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PCLayer_Vehicle_DiveElevator_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_PCLayer_Vehicle_DiveElevator.ABP_PCLayer_Vehicle_DiveElevator_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_PCLayer_Vehicle_DiveElevator_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ABP_PCLayer_Vehicle_DiveElevator.ABP_PCLayer_Vehicle_DiveElevator_C.Carryable Locker
// 0x0020 (0x0020 - 0x0000)
struct ABP_PCLayer_Vehicle_DiveElevator_C_Carryable_Locker final
{
public:
	struct FPoseLink                              Input_Pose;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Carryable_Locker_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_PCLayer_Vehicle_DiveElevator.ABP_PCLayer_Vehicle_DiveElevator_C.Carryable None
// 0x0010 (0x0010 - 0x0000)
struct ABP_PCLayer_Vehicle_DiveElevator_C_Carryable_None final
{
public:
	struct FPoseLink                              Carryable_None_0;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_PCLayer_Vehicle_DiveElevator.ABP_PCLayer_Vehicle_DiveElevator_C.ExecuteUbergraph_ABP_PCLayer_Vehicle_DiveElevator
// 0x0028 (0x0028 - 0x0000)
struct ABP_PCLayer_Vehicle_DiveElevator_C_ExecuteUbergraph_ABP_PCLayer_Vehicle_DiveElevator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterAnimationComponent_C*     CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function ABP_PCLayer_Vehicle_DiveElevator.ABP_PCLayer_Vehicle_DiveElevator_C.OnStateEntry
// 0x0020 (0x0020 - 0x0000)
struct ABP_PCLayer_Vehicle_DiveElevator_C_OnStateEntry final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};

// Function ABP_PCLayer_Vehicle_DiveElevator.ABP_PCLayer_Vehicle_DiveElevator_C.OnStateFullyBlendedIn
// 0x0020 (0x0020 - 0x0000)
struct ABP_PCLayer_Vehicle_DiveElevator_C_OnStateFullyBlendedIn final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};

// Function ABP_PCLayer_Vehicle_DiveElevator.ABP_PCLayer_Vehicle_DiveElevator_C.Vehicle Attach
// 0x0020 (0x0020 - 0x0000)
struct ABP_PCLayer_Vehicle_DiveElevator_C_Vehicle_Attach final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Vehicle_Attach_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

}

