#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ABP_Manny_PostProcess

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Manny_PostProcess.ABP_Manny_PostProcess_C
// 0x1CD8 (0x20B0 - 0x03D8)
class UABP_Manny_PostProcess_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03E0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03E8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03F0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0410(0x00B8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x04C8(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_13;                       // 0x0980(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_12;                       // 0x0B28(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_11;                       // 0x0CD0(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_10;                       // 0x0E78(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_9;                        // 0x1020(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_8;                        // 0x11C8(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_7;                        // 0x1370(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_6;                        // 0x1518(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_5;                        // 0x16C0(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_4;                        // 0x1868(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_3;                        // 0x1A10(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_2;                        // 0x1BB8(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0x1D60(0x01A8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0x1F08(0x01A8)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Manny_PostProcess_C">();
	}
	static class UABP_Manny_PostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Manny_PostProcess_C>();
	}
};

}

