#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PCTools_SonicResonator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "F_AnimSequencePlayerData_structs.hpp"
#include "Subnautica2_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_PCTools_SonicResonator.ABP_PCTools_SonicResonator_C
// 0x0A90 (0x0E90 - 0x0400)
class UABP_PCTools_SonicResonator_C final : public USN2PlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0408(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0410(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0418(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0438(0x00B8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x04F0(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x05D8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0658(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x0680(0x0120)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x07A0(0x00B8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x08A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x08D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x08F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0920(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0948(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0990(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x09B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x09F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0A18(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0A60(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0A80(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0AC8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0AE8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0B30(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0B50(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0C18(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0C98(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0CC0(0x0020)()
	bool                                          K2Node_PropertyAccess_3;                           // 0x0CE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_2;                           // 0x0CE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_1;                           // 0x0CE2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess;                             // 0x0CE3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE4[0x4];                                      // 0x0CE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __CustomProperty_BodyAngleAimOffset_C12CEBE143CD7DB5D2343EBDD7390083; // 0x0CE8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_ThrowToolAnim_C12CEBE143CD7DB5D2343EBDD7390083; // 0x0CF0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_UnEquipToolAnim_C12CEBE143CD7DB5D2343EBDD7390083; // 0x0D10(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_BreakNodeToolAnim_C12CEBE143CD7DB5D2343EBDD7390083; // 0x0D30(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_FirstEquipToolAnim_C12CEBE143CD7DB5D2343EBDD7390083; // 0x0D50(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_EquipToolAnim_C12CEBE143CD7DB5D2343EBDD7390083; // 0x0D70(0x0020)(NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterAnimationComponent_C*     __CustomProperty_AnimationComponent_C12CEBE143CD7DB5D2343EBDD7390083; // 0x0D90(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterAnimationComponent_C*     AnimationComponent;                                // 0x0D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsToolUnequipped;                                 // 0x0DA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA1[0x7];                                      // 0x0DA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      Curve_Map;                                         // 0x0DA8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FF_AnimSequencePlayerData              Equip_Tool_Anim;                                   // 0x0DF8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              First_Equip_Tool_Anim;                             // 0x0E18(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              Break_Node_Tool_Anim;                              // 0x0E38(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              Un_Equip_Tool_Anim;                                // 0x0E58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            Body_Angle_Aim_Offset;                             // 0x0E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bDoVentHeat;                                       // 0x0E80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EndAbility();
	void EndAnimation(class UAnimSequenceBase* Animation);
	void ExecuteUbergraph_ABP_PCTools_SonicResonator(int32 EntryPoint);
	void OnAnimStateReturn();
	void OnAttachPlayerDriver(class AActor* PlayerDriver, bool AttachPlayer);
	void OnSyncedAnimationBegin(bool bUseAITarget, bool bDrivePlayer, const struct FAnimNotifyEventReference& EventReference, const struct FF_AnimSyncSettings& AnimSyncSettings);
	void OnSyncedAnimationEnd();
	void OnToolIsUnequipped();
	void OnUnequipToolFinished(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& node);
	void OnUnequipToolStarted(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& node);
	void OnVentHeat(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& node);
	void PlayMontageOnEquipped(class UAnimMontage* Montage, double PlayRate, bool StopAllMontages);
	void SendPoseSnapshot(const struct FPoseSnapshot& PoseSnapshot);
	void SetCurrentToolEnergy(double Energy);
	void SetupAndBeginSyncedAnimation(class AActor* DrivenActor, bool AttachDriven);
	void StopCurrentMontage(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& node);
	void StopMontageOnEquipped(class UAnimMontage* Montage, double BlendOutTime);
	void Tools_Logic(const struct FPoseLink& InPose, struct FPoseLink* Tools_Logic_0);
	void UpdateAnimationEventTags(const struct FGameplayTag& Gameplay_Tag);
	void VentHeatEvent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_PCTools_SonicResonator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_PCTools_SonicResonator_C")
	}
	static class UABP_PCTools_SonicResonator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PCTools_SonicResonator_C>();
	}
};
DUMPER7_ASSERTS_UABP_PCTools_SonicResonator_C;

SDK_NAMESPACE_END
