#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PCTools_Builder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "F_AnimSequencePlayerData_structs.hpp"
#include "Subnautica2_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_PCTools_Builder.ABP_PCTools_Builder_C
// 0x07D0 (0x0BD0 - 0x0400)
class UABP_PCTools_Builder_C final : public USN2PlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x0408(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0410(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0418(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0420(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0440(0x00B8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x04F8(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x05E0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0660(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0688(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0708(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0730(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x0758(0x00B8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0810(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0838(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0860(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x08A8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x08C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0910(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0930(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0978(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0998(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0A60(0x0020)()
	bool                                          K2Node_PropertyAccess_1;                           // 0x0A80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess;                             // 0x0A81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A82[0x6];                                      // 0x0A82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __CustomProperty_BodyAngleAimOffset_8853589C47C5A04740527EB42D75BDA8; // 0x0A88(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_ThrowToolAnim_8853589C47C5A04740527EB42D75BDA8; // 0x0A90(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_UnEquipToolAnim_8853589C47C5A04740527EB42D75BDA8; // 0x0AB0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_BreakNodeToolAnim_8853589C47C5A04740527EB42D75BDA8; // 0x0AD0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_FirstEquipToolAnim_8853589C47C5A04740527EB42D75BDA8; // 0x0AF0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_EquipToolAnim_8853589C47C5A04740527EB42D75BDA8; // 0x0B10(0x0020)(NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterAnimationComponent_C*     __CustomProperty_AnimationComponent_8853589C47C5A04740527EB42D75BDA8; // 0x0B30(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterAnimationComponent_C*     AnimationComponent;                                // 0x0B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsToolUnequipped;                                 // 0x0B40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B41[0x7];                                      // 0x0B41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_AnimSequencePlayerData              Equip_Tool_Anim;                                   // 0x0B48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              First_Equip_Tool_Anim;                             // 0x0B68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              Break_Node_Tool_Anim;                              // 0x0B88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              Un_Equip_Tool_Anim;                                // 0x0BA8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            Body_Angle_Aim_Offset;                             // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EndAbility();
	void EndAnimation(class UAnimSequenceBase* Animation);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PCTools_Builder_AnimGraphNode_LayeredBoneBlend_1FFFE7314A59D0B78715C497BD0CC1D6();
	void ExecuteUbergraph_ABP_PCTools_Builder(int32 EntryPoint);
	void OnAnimStateReturn();
	void OnAttachPlayerDriver(class AActor* PlayerDriver, bool AttachPlayer);
	void OnSyncedAnimationBegin(bool bUseAITarget, bool bDrivePlayer, const struct FAnimNotifyEventReference& EventReference, const struct FF_AnimSyncSettings& AnimSyncSettings);
	void OnSyncedAnimationEnd();
	void OnToolIsUnequipped();
	void OnUnequipToolFinished(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& node);
	void OnUnequipToolStarted(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& node);
	void PlayMontageOnEquipped(class UAnimMontage* Montage, double PlayRate, bool StopAllMontages);
	void SendPoseSnapshot(const struct FPoseSnapshot& PoseSnapshot);
	void SetCurrentToolEnergy(double Energy);
	void SetupAndBeginSyncedAnimation(class AActor* DrivenActor, bool AttachDriven);
	void StopMontageOnEquipped(class UAnimMontage* Montage, double BlendOutTime);
	void Tools_Logic(const struct FPoseLink& InPose, struct FPoseLink* Tools_Logic_0);
	void UpdateAnimationEventTags(const struct FGameplayTag& Gameplay_Tag);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_PCTools_Builder_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_PCTools_Builder_C")
	}
	static class UABP_PCTools_Builder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PCTools_Builder_C>();
	}
};
DUMPER7_ASSERTS_UABP_PCTools_Builder_C;

SDK_NAMESPACE_END
