#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PCTools_Scanner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "F_AnimSyncSettings_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PCTools_Scanner_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_AnimGraph;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_PCTools_Scanner_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_BlueprintUpdateAnimation;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.ClearStateTime1
// 0x0020 (0x0020 - 0x0000)
struct ABP_PCTools_Scanner_C_ClearStateTime1 final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_ClearStateTime1;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.EndAnimation
// 0x0008 (0x0008 - 0x0000)
struct ABP_PCTools_Scanner_C_EndAnimation final
{
public:
	class UAnimSequenceBase*                      Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_EndAnimation;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.ExecuteUbergraph_ABP_PCTools_Scanner
// 0x0158 (0x0158 - 0x0000)
struct ABP_PCTools_Scanner_C_ExecuteUbergraph_ABP_PCTools_Scanner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage_1;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_BlendOutTime;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Energy;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseSnapshot                          K2Node_Event_PoseSnapshot;                         // 0x0028(0x0038)()
	class AActor*                                 K2Node_Event_DrivenActor;                          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_AttachDriven;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUseAITarget;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDrivePlayer;                         // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEventReference              K2Node_Event_EventReference;                       // 0x0070(0x0030)()
	struct FF_AnimSyncSettings                    K2Node_Event_AnimSyncSettings;                     // 0x00A0(0x0058)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_PlayerDriver;                         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_AttachPlayer;                         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_Gameplay_Tag;                         // 0x0104(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Playrate;                             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_StopAllMontages;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Event_Animation;                            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterAnimationComponent_C*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_ExecuteUbergraph_ABP_PCTools_Scanner;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.OnAttachPlayerDriver
// 0x0010 (0x0010 - 0x0000)
struct ABP_PCTools_Scanner_C_OnAttachPlayerDriver final
{
public:
	class AActor*                                 PlayerDriver;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          AttachPlayer;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_OnAttachPlayerDriver;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.OnSyncedAnimationBegin
// 0x0090 (0x0090 - 0x0000)
struct ABP_PCTools_Scanner_C_OnSyncedAnimationBegin final
{
public:
	bool                                          bUseAITarget;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDrivePlayer;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FF_AnimSyncSettings                    AnimSyncSettings;                                  // 0x0038(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_OnSyncedAnimationBegin;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.OnUnequipToolFinished
// 0x0020 (0x0020 - 0x0000)
struct ABP_PCTools_Scanner_C_OnUnequipToolFinished final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_OnUnequipToolFinished;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.OnUnequipToolStarted
// 0x0020 (0x0020 - 0x0000)
struct ABP_PCTools_Scanner_C_OnUnequipToolStarted final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_OnUnequipToolStarted;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.PlayMontageOnEquipped
// 0x0018 (0x0018 - 0x0000)
struct ABP_PCTools_Scanner_C_PlayMontageOnEquipped final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        PlayRate;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StopAllMontages;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_PlayMontageOnEquipped;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.SendPoseSnapshot
// 0x0038 (0x0038 - 0x0000)
struct ABP_PCTools_Scanner_C_SendPoseSnapshot final
{
public:
	struct FPoseSnapshot                          PoseSnapshot;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_SendPoseSnapshot;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.SetCurrentToolEnergy
// 0x0008 (0x0008 - 0x0000)
struct ABP_PCTools_Scanner_C_SetCurrentToolEnergy final
{
public:
	double                                        Energy;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_SetCurrentToolEnergy;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.SetupAndBeginSyncedAnimation
// 0x0010 (0x0010 - 0x0000)
struct ABP_PCTools_Scanner_C_SetupAndBeginSyncedAnimation final
{
public:
	class AActor*                                 DrivenActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          AttachDriven;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_SetupAndBeginSyncedAnimation;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.StopMontageOnEquipped
// 0x0010 (0x0010 - 0x0000)
struct ABP_PCTools_Scanner_C_StopMontageOnEquipped final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        BlendOutTime;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_StopMontageOnEquipped;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.Tools Logic
// 0x0020 (0x0020 - 0x0000)
struct ABP_PCTools_Scanner_C_Tools_Logic final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Tools_Logic_0;                                     // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_Tools_Logic;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.UpdateAnimationEventTags
// 0x0008 (0x0008 - 0x0000)
struct ABP_PCTools_Scanner_C_UpdateAnimationEventTags final
{
public:
	struct FGameplayTag                           Gameplay_Tag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_UpdateAnimationEventTags;

// Function ABP_PCTools_Scanner.ABP_PCTools_Scanner_C.UpdateStateTime1
// 0x0038 (0x0038 - 0x0000)
struct ABP_PCTools_Scanner_C_UpdateStateTime1 final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	float                                         CallFunc_GetDeltaTime_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PCTools_Scanner_C_UpdateStateTime1;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
