#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ABP_SurvivalTool

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_SurvivalTool.ABP_SurvivalTool_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_SurvivalTool_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_SurvivalTool.ABP_SurvivalTool_C.ExecuteUbergraph_ABP_SurvivalTool
// 0x0028 (0x0028 - 0x0000)
struct ABP_SurvivalTool_C_ExecuteUbergraph_ABP_SurvivalTool final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        K2Node_Event_EnergyLevel;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_Event_SourceMeshComponent;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function ABP_SurvivalTool.ABP_SurvivalTool_C.OnBecomeRelevant
// 0x0020 (0x0020 - 0x0000)
struct ABP_SurvivalTool_C_OnBecomeRelevant final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};

// Function ABP_SurvivalTool.ABP_SurvivalTool_C.SetCarryActor
// 0x0008 (0x0008 - 0x0000)
struct ABP_SurvivalTool_C_SetCarryActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function ABP_SurvivalTool.ABP_SurvivalTool_C.SetMeshDriver
// 0x0008 (0x0008 - 0x0000)
struct ABP_SurvivalTool_C_SetMeshDriver final
{
public:
	class USkeletalMeshComponent*                 SourceMeshComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function ABP_SurvivalTool.ABP_SurvivalTool_C.SetToolEnergy
// 0x0008 (0x0008 - 0x0000)
struct ABP_SurvivalTool_C_SetToolEnergy final
{
public:
	double                                        EnergyLevel;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

