#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PCTools_Scanner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "F_AnimSequencePlayerData_structs.hpp"
#include "Subnautica2_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_PCTools_Scanner.ABP_PCTools_Scanner_C
// 0x0910 (0x0D10 - 0x0400)
class UABP_PCTools_Scanner_C final : public USN2PlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x0408(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0410(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0418(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0420(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0440(0x00B8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x04F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0520(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0548(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0570(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0598(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x05C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0608(0x0020)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x0628(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x06A0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x06C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0708(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0728(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0770(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0790(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0858(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x08D8(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x09C0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x09E8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0A68(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0A90(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x0AB8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0B70(0x0020)()
	bool                                          K2Node_PropertyAccess_3;                           // 0x0B90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_2;                           // 0x0B91(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_1;                           // 0x0B92(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess;                             // 0x0B93(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B94[0x4];                                      // 0x0B94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __CustomProperty_BodyAngleAimOffset_698B64FE45E5E2E438AB23A09BEB5943; // 0x0B98(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_ThrowToolAnim_698B64FE45E5E2E438AB23A09BEB5943; // 0x0BA0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_UnEquipToolAnim_698B64FE45E5E2E438AB23A09BEB5943; // 0x0BC0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_BreakNodeToolAnim_698B64FE45E5E2E438AB23A09BEB5943; // 0x0BE0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_FirstEquipToolAnim_698B64FE45E5E2E438AB23A09BEB5943; // 0x0C00(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              __CustomProperty_EquipToolAnim_698B64FE45E5E2E438AB23A09BEB5943; // 0x0C20(0x0020)(NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterAnimationComponent_C*     __CustomProperty_AnimationComponent_698B64FE45E5E2E438AB23A09BEB5943; // 0x0C40(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterAnimationComponent_C*     AnimationComponent;                                // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsToolUnequipped;                                 // 0x0C50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C51[0x7];                                      // 0x0C51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilitySystemGameplayTags;                         // 0x0C58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StateTime1;                                        // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              Equip_Tool_Anim;                                   // 0x0C80(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              First_Equip_Tool_Anim;                             // 0x0CA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              Break_Node_Tool_Anim;                              // 0x0CC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimSequencePlayerData              Un_Equip_Tool_Anim;                                // 0x0CE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            Body_Angle_Aim_Offset;                             // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ClearStateTime1(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& node);
	void EndAbility();
	void EndAnimation(class UAnimSequenceBase* Animation);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PCTools_Scanner_AnimGraphNode_LayeredBoneBlend_7249FC4B4D28838429D67482947F9444();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PCTools_Scanner_AnimGraphNode_TransitionResult_0F3BD6ED4DB0DF9435046E8A6A44DE61();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PCTools_Scanner_AnimGraphNode_TransitionResult_2B263C96497803278AEA24ADACEBB85C();
	void ExecuteUbergraph_ABP_PCTools_Scanner(int32 EntryPoint);
	void OnAnimStateReturn();
	void OnAttachPlayerDriver(class AActor* PlayerDriver, bool AttachPlayer);
	void OnSyncedAnimationBegin(bool bUseAITarget, bool bDrivePlayer, const struct FAnimNotifyEventReference& EventReference, const struct FF_AnimSyncSettings& AnimSyncSettings);
	void OnSyncedAnimationEnd();
	void OnToolIsUnequipped();
	void OnUnequipToolFinished(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& node);
	void OnUnequipToolStarted(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& node);
	void PlayMontageOnEquipped(class UAnimMontage* Montage, double PlayRate, bool StopAllMontages);
	void SendPoseSnapshot(const struct FPoseSnapshot& PoseSnapshot);
	void SetCurrentToolEnergy(double Energy);
	void SetupAndBeginSyncedAnimation(class AActor* DrivenActor, bool AttachDriven);
	void StopMontageOnEquipped(class UAnimMontage* Montage, double BlendOutTime);
	void Tools_Logic(const struct FPoseLink& InPose, struct FPoseLink* Tools_Logic_0);
	void UpdateAnimationEventTags(const struct FGameplayTag& Gameplay_Tag);
	void UpdateStateTime1(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& node);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_PCTools_Scanner_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_PCTools_Scanner_C")
	}
	static class UABP_PCTools_Scanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PCTools_Scanner_C>();
	}
};
DUMPER7_ASSERTS_UABP_PCTools_Scanner_C;

SDK_NAMESPACE_END
