#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ABP_SonicResonator

#include "Basic.hpp"

#include "ABP_SonicResonator_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_SonicResonator.ABP_SonicResonator_C
// 0x2F5C4C28 (0x2F5C5000 - 0x03D8)
class alignas(0x2F5C5000) UABP_SonicResonator_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_SonicResonator::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x03E8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03F8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0400(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0420(0x0158)(ContainsInstancedReference)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0578(0x0050)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x05C8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0610(0x0010)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0620(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0708(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0788(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x07B0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x07D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0820(0x0048)()
	class USkeletalMeshComponent*                 Source_Mesh_Component;                             // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ValidSourceMesh;                                   // 0x0870(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_SonicResonator(int32 EntryPoint);
	void SetCarryActor(class AActor* Actor);
	void SetMeshDriver(class USkeletalMeshComponent* SourceMeshComponent);
	void SetToolEnergy(double EnergyLevel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_SonicResonator_C">();
	}
	static class UABP_SonicResonator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_SonicResonator_C>();
	}
};

}

