#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AngelCombCore

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AngelCombCore.BP_AngelCombCore_C
// 0x0050 (0x0300 - 0x02B0)
class ABP_AngelCombCore_C final : public AActor
{
public:
	class UUWEAbilitySystemComponent*             UWEAbilitySystem;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionStimuliSourceComponent*    AIPerceptionStimuliSource;                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPawnAttachmentOwner*                UWEPawnAttachmentOwner;                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_BlightCoreRewardButton_C*          BPC_BlightCoreRewardButton;                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Adaptation;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            AngelCombStimulus;                                 // 0x02E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         ExtraGameplayEffectsOnAdapt;                       // 0x02F0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AngelCombCore_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AngelCombCore_C")
	}
	static class ABP_AngelCombCore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AngelCombCore_C>();
	}
};
DUMPER7_ASSERTS_ABP_AngelCombCore_C;

SDK_NAMESPACE_END
