#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_AxumStandingButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SimpleButton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AxumStandingButton.BP_AxumStandingButton_C
// 0x0000 (0x344A3000 - 0x344A3000)
#pragma pack(push, 0x1)
class alignas(0x344A3000) ABP_AxumStandingButton_C : public ABP_SimpleButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AxumStandingButton_C;            // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Stand;                                             // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          HasButtonCover;                                    // 0x0540(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEStoryGoal*                          StoryGoalToReleaseCover;                           // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          StoryGoalToInteract;                               // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         NotifierMaterialIndex;                             // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     InteractableMaterial;                              // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     NoninteractiveMaterial;                            // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnHandlePressed;                                   // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUpdateUsabilityAnimation;                        // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        MaxInRangeDistance;                                // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayerInRange;                                   // 0x0598(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CanActivateButton(class APawn* TargetPawn, bool* NewParam);
	void ExecuteUbergraph_BP_AxumStandingButton(int32 EntryPoint);
	void InRangeCallback_DBA790E3419134F240692A87B7EAF51D();
	void InteractServer(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	void IsButtonCoverOff(bool& Return);
	void IsHandleLockedIn(bool* LockedIn);
	void OnButtonPressed();
	void OnInteractabilityToggled_Event_0(bool NewState);
	void OnRep_HasButtonCover();
	void OnUnlocked_0643AB14450EAE4DD1892099D7E7B91E();
	void OnUnlocked_3809E90D4E7ED12A1FB6F6BF01E54B98();
	void OutOfRangeCallback_DBA790E3419134F240692A87B7EAF51D();
	void ReceiveBeginPlay();
	void TryRemoveButtonCover(class APlayerState* ForPlayerState);
	void UpdateStandMaterials(class APlayerState* ForPlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AxumStandingButton_C">();
	}
	static class ABP_AxumStandingButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AxumStandingButton_C>();
	}
};
#pragma pack(pop)

}

