#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_AxumCrypterTerminal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_BasicInteractable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AxumCrypterTerminal.BP_AxumCrypterTerminal_C
// 0x344A2D30 (0x344A3000 - 0x02D0)
class alignas(0x344A3000) ABP_AxumCrypterTerminal_C final : public ABP_BasicInteractable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AxumCrypterTerminal_C;           // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEFMODAudioComponent*                 FMODAudio;                                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEInventoryComponent*                 Axum;                                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEInventoryInteractionComponent*      UWEInventoryInteraction;                           // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   Text;                                              // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   Thank_You_Text;                                    // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Reset;                                             // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   RejectionText;                                     // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGuid                                  Item_Id;                                           // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AxumCrypterTerminal(int32 EntryPoint);
	void OnInventoryChanged_Event();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AxumCrypterTerminal_C">();
	}
	static class ABP_AxumCrypterTerminal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AxumCrypterTerminal_C>();
	}
};

}

