#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_AnemoneCrabDark

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SN2AISmallFish_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnemoneCrabDark.BP_AnemoneCrabDark_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_AnemoneCrabDark_C final : public ABP_SN2AISmallFish_C
{
public:
	uint8                                         Pad_4EA[0x6];                                      // 0x04EA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AnemoneCrabDark_C;               // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEStimulusSystemComponent*            UWEStimulusSystem;                                 // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AnemoneCrabDark(int32 EntryPoint);
	void HideSkeletalMesh();
	bool IsPickupDisabled(class AActor* FromActor, const struct FHitResult& HitResult);
	void ShowSkeletalMesh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AnemoneCrabDark_C">();
	}
	static class ABP_AnemoneCrabDark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AnemoneCrabDark_C>();
	}
};

}

