#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_AxumCrypterTerminal

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AxumCrypterTerminal.BP_AxumCrypterTerminal_C.ExecuteUbergraph_BP_AxumCrypterTerminal
// 0x001C (0x001C - 0x0000)
struct BP_AxumCrypterTerminal_C_ExecuteUbergraph_BP_AxumCrypterTerminal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyOfItemType_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_AxumCrypterTerminal.BP_AxumCrypterTerminal_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AxumCrypterTerminal_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

