#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_AirhoseLever

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SimpleButton_classes.hpp"
#include "UWEUtilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AirhoseLever.BP_AirhoseLever_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_AirhoseLever_C final : public ABP_SimpleButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AirhoseLever_C;                  // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_AirhoseFeed_01_Decals;                          // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AirhoseFeed_01;                                 // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AirhoseFeed_01_Adapter;                         // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AirhoseFeed_01_Lever;                           // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_LightPowered_E7C69AC94CC8BEB0B64AF788E9DFF777; // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Rotation_Lever_E7C69AC94CC8BEB0B64AF788E9DFF777; // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_E7C69AC94CC8BEB0B64AF788E9DFF777; // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_AirhoseFeedLight;                              // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     AirHose_Material_Override;                         // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimatePowerOn();
	void ExecuteUbergraph_BP_AirhoseLever(int32 EntryPoint);
	void OnButtonPressed();
	void OnTimeLastTriggeredChanged_Event();
	void ReceiveBeginPlay();
	void SetPoweredOn();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AirhoseLever_C">();
	}
	static class ABP_AirhoseLever_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AirhoseLever_C>();
	}
};

}

