#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_AxumObservatory_EntranceDoor_01a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEDoor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AxumObservatory_EntranceDoor_01a.BP_AxumObservatory_EntranceDoor_01a_C
// 0x344A2C48 (0x344A3000 - 0x03B8)
class alignas(0x344A3000) ABP_AxumObservatory_EntranceDoor_01a_C final : public AUWEDoorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionBox;                                      // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TriggerBox;                                        // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AxumObservatory_EntranceDoorInnerLattice_01a2;  // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AxumObservatory_EntranceDoorInnerLattice_01a1;  // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AxumObservatory_EntranceDoorLock_01a2;          // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AxumObservatory_EntranceDoorOuterCap_01a2;      // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AxumObservatory_EntranceDoorLock_01a1;          // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AxumObservatory_EntranceDoorOuterCap_01a1;      // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AxumObservatory_EntranceDoorLock_01a;           // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AxumObservatory_EntranceDoorOuterCap_01a;       // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AxumObservatory_EntranceDoorInnerLattice_01a;   // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AxumObservatory_EntranceDoorFrame_01a;          // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         PlayerToIgnore;                                    // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UUWEStoryGoal*                          StoryGoalToInteract;                               // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     NoninteractiveMaterial;                            // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     InteractableMaterial;                              // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         NotifierMaterialIndex;                             // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UStaticMeshComponent*>           MaterialsToSwitch;                                 // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class AActor*>                         ExternalMaterialsToSwitch;                         // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AUWESerializedLevelSequenceActor*       LevelSequence;                                     // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_SlidingDoor_Box_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_SlidingDoor_Box_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void CheckForActors();
	void ExecuteUbergraph_BP_AxumObservatory_EntranceDoor_01a(int32 EntryPoint);
	void InitializeMaterials();
	void OnLockChanged_Event(bool IsLocked);
	void OnOpenedChanged(bool IsOpen);
	void OnOpenedFractionChanged(float Fraction);
	void OnUnlocked_F6717EB5462ECC7918C1DDAD8BB7CDAB();
	void ReceiveBeginPlay();
	void RecoverDoorState();
	void UpdateBlockingCollision();
	void UpdateMaterials(class APlayerState* ForPlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AxumObservatory_EntranceDoor_01a_C">();
	}
	static class ABP_AxumObservatory_EntranceDoor_01a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AxumObservatory_EntranceDoor_01a_C>();
	}
};

}

