#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AbandonedBaseSign

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AbandonedBaseSign.BP_AbandonedBaseSign_C
// 0x0040 (0x02F0 - 0x02B0)
class ABP_AbandonedBaseSign_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_Text_WidgetComponent_C*            BPC_Text_WidgetComponent;                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_BaseNamePlate_Freestanding_A;                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x02D0(0x0010)(Edit, BlueprintVisible)
	class UClass*                                 TextStyle;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          TransformPolicy;                                   // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_AbandonedBaseSign(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AbandonedBaseSign_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AbandonedBaseSign_C")
	}
	static class ABP_AbandonedBaseSign_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AbandonedBaseSign_C>();
	}
};
DUMPER7_ASSERTS_ABP_AbandonedBaseSign_C;

SDK_NAMESPACE_END
