#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_AcidAnemone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AcidAnemone.BP_AcidAnemone_C
// 0x344A2D38 (0x344A3000 - 0x02C8)
class alignas(0x344A3000) ABP_AcidAnemone_C final : public AUWEGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Poison;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESeedGrowerReplicatorComponent*      UWESeedGrowerReplicator;                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESeedGrowerComponent*                UWESeedGrower_Side1;                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESeedGrowerComponent*                UWESeedGrower_Side3;                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESeedGrowerComponent*                UWESeedGrower_Side2;                               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESeedGrowerComponent*                UWESeedGrower_Stem;                                // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEHealthSetComponent*                 UWEHealthSet;                                      // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESaveComponent*                      UWESave;                                           // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_AcidAnemone_UWESeedGrower_Stem_K2Node_ComponentBoundEvent_0_SeedPickedUpDelegate__DelegateSignature(class UUWESeedGrowerComponent* SeedGrower, class AActor* Seed);
	void ExecuteUbergraph_BP_AcidAnemone(int32 EntryPoint);
	void GetRipenedSeedCount(int32* Count);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AcidAnemone_C">();
	}
	static class ABP_AcidAnemone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AcidAnemone_C>();
	}
};

}

