#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AirVolume

#include "Basic.hpp"

#include "BP_UWEWaterBiomeRegionActor_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AirVolume.BP_AirVolume_C
// 0x0020 (0x0498 - 0x0478)
class ABP_AirVolume_C final : public ABP_UWEWaterBiomeRegionActor_C
{
public:
	class UDecalComponent*                        Caustics_Decal;                                    // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Priority;                                          // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Caustics_Max_Height;                               // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AirVolume_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AirVolume_C")
	}
	static class ABP_AirVolume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AirVolume_C>();
	}
};
DUMPER7_ASSERTS_ABP_AirVolume_C;

SDK_NAMESPACE_END
