#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_AirVolume

#include "Basic.hpp"

#include "BP_UWEWaterBiomeRegionActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AirVolume.BP_AirVolume_C
// 0x00B4 (0x344A30B4 - 0x344A3000)
#pragma pack(push, 0x1)
class alignas(0x344A30B4) ABP_AirVolume_C : public ABP_UWEWaterBiomeRegionActor_C
{
public:
	class UDecalComponent*                        Caustics_Decal;                                    // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Priority;                                          // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        Caustics_Max_Height;                               // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AirVolume_C">();
	}
	static class ABP_AirVolume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AirVolume_C>();
	}
};
#pragma pack(pop)

}

