#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_AxumCentralSubmitButton_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SimpleButton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AxumCentralSubmitButton_Base.BP_AxumCentralSubmitButton_Base_C
// 0x0000 (0x344A3000 - 0x344A3000)
#pragma pack(push, 0x1)
class alignas(0x344A3000) ABP_AxumCentralSubmitButton_Base_C : public ABP_SimpleButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AxumCentralSubmitButton_Base_C;  // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_AxumVisibilityComponent_C*         BPC_AxumVisibilityComponent;                       // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ActualButton;                                      // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Stand;                                             // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ValidCodeFlip_Z_Offset_D88A4B3640B168991CF3E1BDF333FCD4; // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ValidCodeFlip_Rotation_D88A4B3640B168991CF3E1BDF333FCD4; // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ValidCodeFlip__Direction_D88A4B3640B168991CF3E1BDF333FCD4; // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     ValidCodeFlip;                                     // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         InvalidCodeShake_Rotation_4D2FC2C046864E8A4820C5A3A74181B7; // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            InvalidCodeShake__Direction_4D2FC2C046864E8A4820C5A3A74181B7; // 0x056C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D[0x3];                                      // 0x056D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     InvalidCodeShake;                                  // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          WorldStoryGoalToEnableButton;                      // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUWEStoryGoal*                          WorldStoryGoalToDisableButton;                     // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         AxumScreenMaterialSlot;                            // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     OffMaterial;                                       // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DefaultMaterial;                                   // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SuccessMaterial;                                   // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_ScreenBackground;                              // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool CanActivate();
	void DeactivateButtonMaterials();
	void ExecuteUbergraph_BP_AxumCentralSubmitButton_Base(int32 EntryPoint);
	void InteractServer(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	void InvalidCodeShake__FinishedFunc();
	void InvalidCodeShake__UpdateFunc();
	void Multicast_Activation(bool Success, class APawn* Pawn);
	void OnActivationSuccess(class AActor* TriggeringActor);
	void OnLayerToggled_Event(bool NewLayerVisibility);
	void OnUnlocked_1A5B67A144CBE3E2C7B422B89FEFD192();
	void OnUnlocked_5B07F3E54A31A6E5B391BAB4F1679285();
	void ReceiveBeginPlay();
	void RestoreButtonMaterials();
	void SetComplete();
	void SetOnButIncomplete();
	void UpdateTerminalState();
	void ValidCodeFlip__FinishedFunc();
	void ValidCodeFlip__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AxumCentralSubmitButton_Base_C">();
	}
	static class ABP_AxumCentralSubmitButton_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AxumCentralSubmitButton_Base_C>();
	}
};
#pragma pack(pop)

}

