#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Beacon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWECarryable_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Beacon.BP_Beacon_C
// 0x0030 (0x03D0 - 0x03A0)
class ABP_Beacon_C final : public AUWECarryableActorPowered
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USN2DeconstructableComponent*           SN2Deconstructable;                                // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SKM_Beacon_01;                                     // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPingMarkerComponent*                UWEPingMarker;                                     // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RotationAdjustmentTimer;                           // 0x03C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateActiveCue();
	bool ShouldDeconstructInstantly();
	void ReceiveBeginPlay();
	void PreDeconstruct(class ASN2BuilderTool* BuilderTool);
	bool GetDeconstructCostOverride(TArray<struct FUWESculpturalBaseCellCost>* Costs);
	void ExecuteUbergraph_BP_Beacon(int32 EntryPoint);
	bool CanBeDeconstructed(struct FGameplayTag* CantDeconstructReason);
	void BndEvt__BP_Beacon_CarryableRootComponent_K2Node_ComponentBoundEvent_0_OnAttachmentChanged__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Beacon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Beacon_C")
	}
	static class ABP_Beacon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Beacon_C>();
	}
};
DUMPER7_ASSERTS_ABP_Beacon_C;

SDK_NAMESPACE_END
