#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_BlightZone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "F_ISMCData_structs.hpp"
#include "Subnautica2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BlightZone.BP_BlightZone_C
// 0x344A2D40 (0x344A3000 - 0x02C0)
class alignas(0x344A3000) ABP_BlightZone_C final : public ASN2BlightVisualsManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWESaveComponent*                      UWESave;                                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule1;                                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule4;                                          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule3;                                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule2;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         BlightID;                                          // 0x0300(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        BlightFalloff;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterial*>                      SupportedMaterials;                                // 0x0310(0x0010)(Edit, BlueprintVisible)
	TMap<TSoftObjectPtr<class UInstancedStaticMeshComponent>, struct FF_ISMCData> BlightedISMC;      // 0x0320(0x0050)(Edit, BlueprintVisible)
	TMap<TSoftObjectPtr<class UStaticMeshComponent>, double> BlightedSMC;                            // 0x0370(0x0050)(Edit, BlueprintVisible)
	TMap<TSoftObjectPtr<class USkeletalMeshComponent>, double> BlightedSKMC;                         // 0x03C0(0x0050)(Edit, BlueprintVisible)
	int32                                         Num_Custom_Data_Floats;                            // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        RemediationPulseSpeed;                             // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultRemediationDuration;                        // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UStaticMesh*, double>              CustomRemediationDuration;                         // 0x0428(0x0050)(Edit, BlueprintVisible)
	struct FFloatRange                            RemediationPulseRandomOffset;                      // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UStaticMesh>>     BlightAssetsToHideAfterRemediation;                // 0x0488(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class USkeletalMesh>>   BlightSKMAssetsToHideAfterRemediation;             // 0x0498(0x0010)(Edit, BlueprintVisible)
	int32                                         Index_CPD_Blight_Amount;                           // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_CPD_Blight_StartRemediationTime;             // 0x04AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_CPD_Blight_ID;                               // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           BlightRemediationTimer;                            // 0x04B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASN2BlightNode*                         BlightOwner;                                       // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_BlightZoneBox_C*>            BoxShapes;                                         // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<TSoftClassPtr<class UClass>>           ActorClassesToIgnore;                              // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        MinimumBlightValue;                                // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LoadedLevelCutoffDistance;                         // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCurrentlyRemediating;                            // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        PixelProgrammableDistance;                         // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UStaticMesh>>     PixelProgrammableDistanceExclusionList;            // 0x0508(0x0010)(Edit, BlueprintVisible)
	bool                                          Remediated;                                        // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSet<class UInstancedStaticMeshComponent*>    RemediatingISMCs;                                  // 0x0520(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	TSet<class UStaticMeshComponent*>             RemediatingSMCs;                                   // 0x0570(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	TSet<class USkeletalMeshComponent*>           RemediatingSKMs;                                   // 0x05C0(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	class USN2BlightNodeDataAsset*                Blight_Data_Asset;                                 // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ComponentHasSupportedMaterial(class UPrimitiveComponent* PrimitiveComponent, bool* Supported);
	void ConvertCapsuletoSDFInput(class UCapsuleComponent* InCapsule, struct FVector* CapA, struct FVector* CapB, float* Radius);
	void DoesBoxOverlapBlightZone(const struct FBox& InBox, bool* Result);
	void Editor___Initial_Gather_Components();
	void Editor___Reset_Blight();
	void Editor___Reset_Scale();
	void Editor___Unhide_Remediated_Blight();
	void Editor___Update_Blight_Settings();
	void ExecuteUbergraph_BP_BlightZone(int32 EntryPoint);
	void FitCapsuleInBox(class ABP_BlightZoneBox_C* Box, class UCapsuleComponent* Capsule);
	void GetBlightAmountValue(class UPrimitiveComponent* Component, double* Value, bool* Visualize);
	void GetBlightAmountValueForInstance(class UInstancedStaticMeshComponent* Component, int32 Index_0, double* Value, bool* Visualize);
	void GetCapsules(TArray<class UCapsuleComponent*>* Capsules);
	void GetFadeTimeOffsetByDistance(double Distance, double* StartTimeOffset);
	void GetRelevantFoliageActorsInBox(class ABP_BlightZoneBox_C* ZoneBox, TArray<class AActor*>* OutActors);
	void GetRelevantFoliageActorsInSphere(const struct FVector& SpherePos, float SphereRadius, TArray<class AActor*>* OutActors);
	void GetRemediationDurationByMesh(class UStaticMeshComponent* Mesh, double* duration);
	bool HasBlightNodeBeenRemediated();
	void InitializeSDFMask();
	void IsAddedLevelRelevant(const class ULevel* InLevel, bool* Relevant);
	bool IsInEditor();
	bool IsInstanceInsideSphere(class UInstancedStaticMeshComponent* Component, int32 Index_0);
	void IsOwningActorIgnored(class UActorComponent* Component, bool* Ignored);
	void OnLevelAddedBlueprint_Event(class ULevel* InLevel, class UWorld* World);
	void Preview_Blight();
	void Preview_Remediate();
	void PreviewRemediateMask(double RemedStartTime);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void Remove_Blight();
	void Runtime___Finished_Remediation();
	void Runtime___Hide_Remediated_Blight(bool HideRemediatingBlight);
	void Runtime___Initialize_Blight_Settings();
	void Runtime___Remediate_Blight();
	void Runtime___Track_Remediating_Components();
	void SetCustomDataOnInstance(class UInstancedStaticMeshComponent* Component, int32 Instance, int32 Index_0, double Value);
	void SetCustomPrimitiveData(class UPrimitiveComponent* Component, int32 Index_0, double Value, bool MarkDirty, bool ForceDefault);
	void SetPixelProgrammable(class UStaticMeshComponent* StaticMeshComponent, const float Distance);
	void Setup___Add_Overlap_Box();
	void Setup___Register_with_manager();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BlightZone_C">();
	}
	static class ABP_BlightZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BlightZone_C>();
	}
};

}

