#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Beacon

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UWESculpturalBase_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_Beacon.BP_Beacon_C.CanBeDeconstructed
// 0x0028 (0x0028 - 0x0000)
struct BP_Beacon_C_CanBeDeconstructed final
{
public:
	struct FGameplayTag                           CantDeconstructReason;                             // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASN2PlayerCharacter*                    K2Node_DynamicCast_AsSN2Player_Character;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Beacon.BP_Beacon_C.ExecuteUbergraph_BP_Beacon
// 0x01D0 (0x01D0 - 0x0000)
struct BP_Beacon_C_ExecuteUbergraph_BP_Beacon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class ASN2BuilderTool*                        K2Node_Event_BuilderTool;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0010(0x00D8)(ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x00E8(0x00D8)(ContainsInstancedReference)
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Beacon.BP_Beacon_C.GetDeconstructCostOverride
// 0x0018 (0x0018 - 0x0000)
struct BP_Beacon_C_GetDeconstructCostOverride final
{
public:
	TArray<struct FUWESculpturalBaseCellCost>     Costs;                                             // 0x0000(0x0010)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Beacon.BP_Beacon_C.PreDeconstruct
// 0x0008 (0x0008 - 0x0000)
struct BP_Beacon_C_PreDeconstruct final
{
public:
	class ASN2BuilderTool*                        BuilderTool;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Beacon.BP_Beacon_C.ShouldDeconstructInstantly
// 0x0001 (0x0001 - 0x0000)
struct BP_Beacon_C_ShouldDeconstructInstantly final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

