#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_BioLab_WelcomeCenter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BioLab_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BioLab_WelcomeCenter.BP_BioLab_WelcomeCenter_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_BioLab_WelcomeCenter_C final : public ABP_BioLab_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BioLab_WelcomeCenter_C;          // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_Glintable_C*                       BPC_Glintable;                                     // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget1;                                           // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_HologramProjector;                              // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESaveComponent*                      UWESave;                                           // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 AttachPowerActor;                                  // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CheckPowerActorTimer;                              // 0x0430(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Emissive;                                      // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_ComputerTextInterface_Terminal_UWEPoweredAppliance_K2Node_ComponentBoundEvent_0_OnPoweredStateChanged__DelegateSignature(bool NewIsPowered);
	void CheckAttachPowerActor();
	void ExecuteUbergraph_BP_BioLab_WelcomeCenter(int32 EntryPoint);
	void GiveSuffocationImmunity(class AActor* OtherActor);
	void InteractEndServer(class AController* Controller, class APawn* Pawn);
	void InteractServer(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	void ReceiveBeginPlay();
	void RemoveSuffocationImmunity(class AActor* OtherActor);
	void UpdatePoweredStateVisuals();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BioLab_WelcomeCenter_C">();
	}
	static class ABP_BioLab_WelcomeCenter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BioLab_WelcomeCenter_C>();
	}
};

}

