#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Builder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Subnautica2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Builder.BP_Builder_C
// 0x344A2920 (0x344A3000 - 0x06E0)
class alignas(0x344A3000) ABP_Builder_C final : public ASN2BuilderTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_ToolBatteryMesh_C*                 BPC_ToolBatteryMesh;                               // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_8556F8AD4BDA7D6199725D8C5769671F; // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              SnappingInfoTexture;                               // 0x0708(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CommuncalInvInfoTexture;                           // 0x0730(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              ConstructModeTexture;                              // 0x0758(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              DeconstructModeTexture;                            // 0x0780(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              MoveModeTexture;                                   // 0x07A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              ShrinkModeTexture;                                 // 0x07D0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              GrowModeTexture;                                   // 0x07F8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_EmissiveStrip;                                 // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnEquipVisibilityChanged(bool bNewVisible);
	void BPOnUnequipped(const class AActor* OldEquippedByActor);
	void CalculateRollFromQuaternion(const struct FQuat& Quaternion, double* Roll);
	void EnergyChanged(float PercentEnergy);
	void EnergyEmpty();
	void EnergyRefilled();
	void Equipped();
	void ExecuteUbergraph_BP_Builder(int32 EntryPoint);
	void OnCraftingSourcesChanged();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Set_HUDMode_Texture(TSoftObjectPtr<class UTexture2D> ModeTexture);
	void SetBuilderHudParams(TSoftObjectPtr<class UTexture2D> ModeTexture, bool ShowSnapping);
	void SetHUDRightInfoTexture(TSoftObjectPtr<class UTexture2D> InfoRightTexture);
	void SetSnappingTexture(bool ShowSnapping);
	void Unequipped();
	void UpdateBuilderOnlineCue();
	void UpdateCommunalLockerTexture();
	void UpdateSnappingInfoTextureFromSnappingState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Builder_C">();
	}
	static class ABP_Builder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Builder_C>();
	}
};

}

