#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseSupport_Foundation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWESculpturalBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_BaseSupport_Foundation.BP_BaseSupport_Foundation_C
// 0x0040 (0x0378 - 0x0338)
class ABP_BaseSupport_Foundation_C final : public AUWEBaseSupportActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Round_Base_A_StaticMeshComponent0; // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Round_Top_A_StaticMeshComponent0; // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Round_Piston_A_StaticMeshComponent0; // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void DoUpdatePosition();
	void ExecuteUbergraph_BP_BaseSupport_Foundation(int32 EntryPoint);
	void OnPositionsUpdated();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BaseSupport_Foundation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BaseSupport_Foundation_C")
	}
	static class ABP_BaseSupport_Foundation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseSupport_Foundation_C>();
	}
};
DUMPER7_ASSERTS_ABP_BaseSupport_Foundation_C;

SDK_NAMESPACE_END
