#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_BaseModule_RoomWall_Window_RightEnd_02a_0

#include "Basic.hpp"

#include "BP_Bases_KitPieces_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseModule_RoomWall_Window_RightEnd_02a.BP_BaseModule_RoomWall_Window_RightEnd_02a_C
// 0x0000 (0x344A3000 - 0x344A3000)
class BP_BaseModule_RoomWall_Window_RightEnd_02a_0::ABP_BaseModule_RoomWall_Window_RightEnd_02a_C final : public ABP_Bases_KitPieces_Parent_C
{
public:
	class UStaticMeshComponent*                   SM_Room_Exterior_FlatWall_A24_StaticMeshComponent7; // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_FlatWall_Top_A10_StaticMeshComponent5; // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_FlatWall_Top_A9_StaticMeshComponent2; // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_OutsideCorner_Bottom_A54_StaticMeshComponent2; // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_FlatWall_A9_StaticMeshComponent6; // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_FlatWall_Bottom_A9_StaticMeshComponent2; // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_FlatWall_A9_StaticMeshComponent11; // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_FlatWall_A9_StaticMeshComponent1; // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Exterior_OutsideCorner_Top_A36_StaticMeshComponent0; // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Exterior_FlatWall_A24_StaticMeshComponent1; // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Exterior_FlatWall_A26_StaticMeshComponent1; // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass BP_BaseModule_RoomWall_Window_RightEnd_02a.BP_BaseModule_RoomWall_Window_RightEnd_02a_C", true, "BP_BaseModule_RoomWall_Window_RightEnd_02a_C">();
	}
	static class BP_BaseModule_RoomWall_Window_RightEnd_02a_0::ABP_BaseModule_RoomWall_Window_RightEnd_02a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<BP_BaseModule_RoomWall_Window_RightEnd_02a_0::ABP_BaseModule_RoomWall_Window_RightEnd_02a_C>();
	}
};

}

