#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseSupportVertical

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_BaseSupportVertical.BP_BaseSupportVertical_C.CanBeMoved
// 0x0001 (0x0001 - 0x0000)
struct BP_BaseSupportVertical_C_CanBeMoved final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BaseSupportVertical_C_CanBeMoved;

// Function BP_BaseSupportVertical.BP_BaseSupportVertical_C.ExecuteUbergraph_BP_BaseSupportVertical
// 0x0270 (0x0270 - 0x0000)
struct BP_BaseSupportVertical_C_ExecuteUbergraph_BP_BaseSupportVertical final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult; // 0x0020(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bShowAsGhost;                         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindAttachAndEndPosition_AttachPosition;  // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindAttachAndEndPosition_EndPosition;     // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FindAttachAndEndPosition_SupportAmount;   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindAttachAndEndPosition_FoundAttachPoint; // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_FindAttachAndEndPosition_OutHit;          // 0x0168(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_FindAttachAndEndPosition_SupportLength_ImplicitCast; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BaseSupportVertical_C_ExecuteUbergraph_BP_BaseSupportVertical;

// Function BP_BaseSupportVertical.BP_BaseSupportVertical_C.OnShowAsGhostChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_BaseSupportVertical_C_OnShowAsGhostChanged final
{
public:
	bool                                          bShowAsGhost;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BaseSupportVertical_C_OnShowAsGhostChanged;

// Function BP_BaseSupportVertical.BP_BaseSupportVertical_C.SetUnsupportedFeedbackVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_BaseSupportVertical_C_SetUnsupportedFeedbackVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BaseSupportVertical_C_SetUnsupportedFeedbackVisibility;

// Function BP_BaseSupportVertical.BP_BaseSupportVertical_C.SetUnsupportedFeedbackVisible
// 0x0010 (0x0010 - 0x0000)
struct BP_BaseSupportVertical_C_SetUnsupportedFeedbackVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BaseSupportVertical_C_SetUnsupportedFeedbackVisible;

// Function BP_BaseSupportVertical.BP_BaseSupportVertical_C.SetUnsupportedIndicatorVisibility
// 0x0002 (0x0002 - 0x0000)
struct BP_BaseSupportVertical_C_SetUnsupportedIndicatorVisibility final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BaseSupportVertical_C_SetUnsupportedIndicatorVisibility;

// Function BP_BaseSupportVertical.BP_BaseSupportVertical_C.SetUnsupportedOverlayMateral
// 0x0010 (0x0010 - 0x0000)
struct BP_BaseSupportVertical_C_SetUnsupportedOverlayMateral final
{
public:
	class UMaterialInstanceDynamic*               Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BaseSupportVertical_C_SetUnsupportedOverlayMateral;

// Function BP_BaseSupportVertical.BP_BaseSupportVertical_C.GetTraceCheckData
// 0x0068 (0x0068 - 0x0000)
struct BP_BaseSupportVertical_C_GetTraceCheckData final
{
public:
	struct FVector                                LocalStart;                                        // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalEnd;                                          // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BaseSupportVertical_C_GetTraceCheckData;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
