#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_BaseModule_Corridor_Straight_01d

#include "Basic.hpp"

#include "BP_Bases_KitPieces_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseModule_Corridor_Straight_01d.BP_BaseModule_Corridor_Straight_01d_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_BaseModule_Corridor_Straight_01d_C final : public ABP_Bases_KitPieces_Parent_C
{
public:
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_Mid_Exterior_A6_StaticMeshComponent1; // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Exterior_A4_StaticMeshComponent3; // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Exterior_A_StaticMeshComponent3; // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Exterior_A_StaticMeshComponent2; // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Exterior_A_StaticMeshComponent1; // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_Mid_Interior_A6_StaticMeshComponent0; // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_Mid_Interior_A_StaticMeshComponent0; // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_Mid_Exterior_A6_StaticMeshComponent0; // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_Mid_Exterior_A_StaticMeshComponent0; // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Interior_Flipped_A2_StaticMeshComponent0; // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Interior_Flipped_A_StaticMeshComponent0; // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Interior_A4_StaticMeshComponent0; // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Interior_A2_StaticMeshComponent0; // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Exterior_A4_StaticMeshComponent0; // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Exterior_A3_StaticMeshComponent0; // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Exterior_A2_StaticMeshComponent0; // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Exterior_A_StaticMeshComponent0; // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Top_Mid_Interior_A_StaticMeshComponent0; // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Top_Mid_Exterior_A_StaticMeshComponent0; // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Top_End_Interior_A2_StaticMeshComponent0; // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Top_End_Interior_A_StaticMeshComponent0; // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Top_End_Exterior_A2_StaticMeshComponent0; // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Top_End_Exterior_A_StaticMeshComponent0; // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Bottom_Mid_Interior_A_StaticMeshComponent0; // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Bottom_Mid_Exterior_A_StaticMeshComponent0; // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Bottom_End_Interior_A2_StaticMeshComponent0; // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Bottom_End_Interior_A_StaticMeshComponent0; // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Bottom_End_Exterior_A2_StaticMeshComponent0; // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Bottom_End_Exterior_A_StaticMeshComponent0; // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BaseModule_Corridor_Straight_01d_C">();
	}
	static class ABP_BaseModule_Corridor_Straight_01d_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseModule_Corridor_Straight_01d_C>();
	}
};

}

