#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_BlightNodeDamagePoint_Hardened

#include "Basic.hpp"

#include "UWERangeTracker_structs.hpp"


namespace SDK::Params
{

// Function BP_BlightNodeDamagePoint_Hardened.BP_BlightNodeDamagePoint_Hardened_C.CankerOpenClosed
// 0x0001 (0x0001 - 0x0000)
struct BP_BlightNodeDamagePoint_Hardened_C_CankerOpenClosed final
{
public:
	bool                                          Closed_;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_BlightNodeDamagePoint_Hardened.BP_BlightNodeDamagePoint_Hardened_C.ExecuteUbergraph_BP_BlightNodeDamagePoint_Hardened
// 0x0090 (0x0090 - 0x0000)
struct BP_BlightNodeDamagePoint_Hardened_C_ExecuteUbergraph_BP_BlightNodeDamagePoint_Hardened final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInvincible_ReturnValue;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInvincible_ReturnValue_1;               // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWERangeTrackerRange                  K2Node_MakeStruct_UWERangeTrackerRange;            // 0x0028(0x0020)(NoDestructor)
	struct FUWERangeTrackerPeerRangeConfig        K2Node_MakeStruct_UWERangeTrackerPeerRangeConfig;  // 0x0048(0x0030)(NoDestructor)
	class UUWEListenPlayerInRange*                CallFunc_ListenPlayerInRange_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Closed_;                              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        K2Node_MakeStruct_Upper_ImplicitCast;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_BlightNodeDamagePoint_Hardened.BP_BlightNodeDamagePoint_Hardened_C.OnRep_PlayerInRange
// 0x0001 (0x0001 - 0x0000)
struct BP_BlightNodeDamagePoint_Hardened_C_OnRep_PlayerInRange final
{
public:
	bool                                          CallFunc_IsInvincible_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

