#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseModule_Corridor_Junction_01e

#include "Basic.hpp"

#include "BP_Bases_KitPieces_Parent_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_BaseModule_Corridor_Junction_01e.BP_BaseModule_Corridor_Junction_01e_C
// 0x0138 (0x0408 - 0x02D0)
class ABP_BaseModule_Corridor_Junction_01e_C final : public ABP_Bases_KitPieces_Parent_C
{
public:
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Top_Interior_SingleStraight_A6_StaticMeshComponent0; // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Top_Interior_SingleStraight_A5_StaticMeshComponent0; // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Top_Interior_EndCap_A6_StaticMeshComponent0; // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Top_Interior_EndCap_A5_StaticMeshComponent0; // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Top_Interior_Double_A10_StaticMeshComponent0; // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Top_Interior_Double_A7_StaticMeshComponent0; // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Top_Exterior_EndCap_A7_StaticMeshComponent0; // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Top_Exterior_EndCap_A6_StaticMeshComponent0; // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Top_Exterior_EndCap_A5_StaticMeshComponent0; // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Top_Exterior_DoubleExtended_A6_StaticMeshComponent0; // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Top_Exterior_DoubleExtended_A5_StaticMeshComponent0; // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Top_Exterior_DoubleExtended_A3_StaticMeshComponent0; // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Corner_Interior_A19_StaticMeshComponent0; // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Corner_Interior_A18_StaticMeshComponent0; // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Corner_Interior_A17_StaticMeshComponent0; // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Corner_Interior_A16_StaticMeshComponent0; // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Corner_Exterior_A19_StaticMeshComponent0; // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Corner_Exterior_A18_StaticMeshComponent0; // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Corner_Exterior_A17_StaticMeshComponent0; // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Corner_Exterior_A16_StaticMeshComponent0; // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Bottom_Interior_SingleStraight_A6_StaticMeshComponent0; // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Bottom_Interior_SingleStraight_A5_StaticMeshComponent0; // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Bottom_Interior_EndCap_A4_StaticMeshComponent0; // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Bottom_Interior_EndCap_A3_StaticMeshComponent0; // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Bottom_Interior_Double_A6_StaticMeshComponent0; // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Bottom_Interior_Double_A5_StaticMeshComponent0; // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Bottom_Exterior_EndCap_A7_StaticMeshComponent0; // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Bottom_Exterior_EndCap_A6_StaticMeshComponent0; // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Bottom_Exterior_EndCap_A5_StaticMeshComponent0; // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Bottom_Exterior_EndCap_A4_StaticMeshComponent0; // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Bottom_Exterior_Double_A6_StaticMeshComponent0; // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_TJunction_Bottom_Exterior_Double_A5_StaticMeshComponent0; // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_Junction_Interior_Flipped_A_StaticMeshComponent0; // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_Junction_Exterior_EndCap_A_StaticMeshComponent0; // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_Junction_End_Interior_Flipped_A8_StaticMeshComponent0; // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_Junction_End_Interior_Flipped_A6_StaticMeshComponent0; // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_Junction_End_Interior_Flipped_A5_StaticMeshComponent0; // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Corridor_Straight_Wall_End_Exterior_A31_StaticMeshComponent0; // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BaseModule_Corridor_Junction_01e_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BaseModule_Corridor_Junction_01e_C")
	}
	static class ABP_BaseModule_Corridor_Junction_01e_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseModule_Corridor_Junction_01e_C>();
	}
};
DUMPER7_ASSERTS_ABP_BaseModule_Corridor_Junction_01e_C;

SDK_NAMESPACE_END
