#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseModule_PlatformSupport_01b

#include "Basic.hpp"

#include "BP_Bases_KitPieces_Parent_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_BaseModule_PlatformSupport_01b.BP_BaseModule_PlatformSupport_01b_C
// 0x0028 (0x02F8 - 0x02D0)
class ABP_BaseModule_PlatformSupport_01b_C final : public ABP_Bases_KitPieces_Parent_C
{
public:
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Square_Base_A2_StaticMeshComponent0; // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Square_TopConnection_A2_StaticMeshComponent0; // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Square_BaseConnection_A2_StaticMeshComponent0; // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Square_Piston_A2_StaticMeshComponent0; // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Square_Top_A2_StaticMeshComponent0; // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BaseModule_PlatformSupport_01b_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BaseModule_PlatformSupport_01b_C")
	}
	static class ABP_BaseModule_PlatformSupport_01b_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseModule_PlatformSupport_01b_C>();
	}
};
DUMPER7_ASSERTS_ABP_BaseModule_PlatformSupport_01b_C;

SDK_NAMESPACE_END
