#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseRoom_Ceiling_3x3

#include "Basic.hpp"

#include "BP_Bases_KitPieces_Parent_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_BaseRoom_Ceiling_3x3.BP_BaseRoom_Ceiling_3x3_C
// 0x0098 (0x0368 - 0x02D0)
class ABP_BaseRoom_Ceiling_3x3_C final : public ABP_Bases_KitPieces_Parent_C
{
public:
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall5_StaticMeshComponent1;    // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall3_StaticMeshComponent1;    // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall2_StaticMeshComponent1;    // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall4_StaticMeshComponent1;    // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall7_StaticMeshComponent1;    // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall8_StaticMeshComponent1;    // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall9_StaticMeshComponent1;    // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall10_StaticMeshComponent1;   // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall6_StaticMeshComponent1;    // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall4_StaticMeshComponent0;    // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall2_StaticMeshComponent0;    // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall3_StaticMeshComponent0;    // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall5_StaticMeshComponent0;    // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall6_StaticMeshComponent0;    // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall7_StaticMeshComponent0;    // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall10_StaticMeshComponent0;   // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall9_StaticMeshComponent0;    // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Room_Interior_TopWall8_StaticMeshComponent0;    // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BaseRoom_Ceiling_3x3_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BaseRoom_Ceiling_3x3_C")
	}
	static class ABP_BaseRoom_Ceiling_3x3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseRoom_Ceiling_3x3_C>();
	}
};
DUMPER7_ASSERTS_ABP_BaseRoom_Ceiling_3x3_C;

SDK_NAMESPACE_END
