#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_BlightNode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Subnautica2_structs.hpp"
#include "Subnautica2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BlightNode.BP_BlightNode_C
// 0x344A2B40 (0x344A3000 - 0x04C0)
class alignas(0x344A3000) ABP_BlightNode_C final : public ASN2BlightNode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEFMODAudioComponent*                 SFX_Call_of_The_Sea_Whispers;                      // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_BlightCall_C*                      BPC_BlightCall;                                    // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_BlightedAreaParticulates;                       // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   frondTop;                                          // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   frondBottom;                                       // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   frondBase;                                         // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bulbBase;                                          // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SketalMesh;                                        // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AngelCombJuvenileTentacles_01a;                 // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxVolumeComponent*                    BlightRegionVolume;                                // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxVolumeComponent*                    FirstEncounterVolume;                              // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          EnterVolume_Infected_StoryGoal;                    // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWEScanData*                           NormalScanData;                                    // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWEScanData*                           RemediatedScanData;                                // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUWEWaterBiomeRegionActor*              Water_Biome_Region_Actor;                          // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool Open)>     OnOpenedStateChanged;                              // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        DelayToReEnableCreatureSpawnOnRemediate;           // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnterVolumeDialogCooldown;                         // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEStoryGoal*                          Remediated_Moment_StoryGoal;                       // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUWEDialogueNode*>               EnterVolume_Return_InfectedDialogOptions;          // 0x0570(0x0010)(Edit, BlueprintVisible)
	TArray<class UUWEDialogueNode*>               Remediated_Moment_DialogOptions;                   // 0x0580(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class APawn*, double>                    PlayerNextTimeDialog;                              // 0x0590(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UUWEStoryGoal*                          EnterVolume_Infected_NoResonator_StoryGoal;        // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUWEDialogueNode*>               EnterVolume_Return_Infected_NoResonator_DialogOptions; // 0x05E8(0x0010)(Edit, BlueprintVisible)
	class ABP_BlightZone_C*                       BlightZone;                                        // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void BndEvt__BP_BlightNode_FirstEncounterVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Editor___Add_BlightZone();
	void ExecuteUbergraph_BP_BlightNode(int32 EntryPoint);
	void OnLevelSequenceFinished();
	void OnStateChanged_Event(EBlightNodeState NewState);
	void ReceiveBeginPlay();
	void SwapScanData(const class UUWEActorDataAsset*& ScanDataToRemove, class UUWEActorDataAsset* ScanDataToAdd);
	void SwapToRemediatedMesh();
	void TriggerEnterRegionDialog(class APawn* Pawn);
	void UpdateState(EBlightNodeState State, bool Immediate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BlightNode_C">();
	}
	static class ABP_BlightNode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BlightNode_C>();
	}
};

}

