#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_BlightSap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BlightSap.BP_BlightSap_C
// 0x344A2D38 (0x344A3000 - 0x02C8)
class alignas(0x344A3000) ABP_BlightSap_C final : public AUWEGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEHealthSetComponent*                 UWEHealthSet;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void EventReceived_408A2D764383210F005378A91B94DFE5(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_BP_BlightSap(int32 EntryPoint);
	void OnBlightSapDied(class AActor* SourceActor, class AActor* TargetActor);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BlightSap_C">();
	}
	static class ABP_BlightSap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BlightSap_C>();
	}
};

}

