#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_BaseSupport_Foundation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWESculpturalBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseSupport_Foundation.BP_BaseSupport_Foundation_C
// 0x344A2CC8 (0x344A3000 - 0x0338)
class alignas(0x344A3000) ABP_BaseSupport_Foundation_C final : public AUWEBaseSupportActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Round_Base_A_StaticMeshComponent0; // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Round_Top_A_StaticMeshComponent0; // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Round_Piston_A_StaticMeshComponent0; // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void DoUpdatePosition();
	void ExecuteUbergraph_BP_BaseSupport_Foundation(int32 EntryPoint);
	void OnPositionsUpdated();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BaseSupport_Foundation_C">();
	}
	static class ABP_BaseSupport_Foundation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseSupport_Foundation_C>();
	}
};

}

