#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_BlightParasite

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BlightParasite.BP_BlightParasite_C.BndEvt__BP_BlightParasite_HealthComponent_K2Node_ComponentBoundEvent_0_DiedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_BlightParasite_C_BndEvt__BP_BlightParasite_HealthComponent_K2Node_ComponentBoundEvent_0_DiedDelegate__DelegateSignature final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_BlightParasite.BP_BlightParasite_C.ExecuteUbergraph_BP_BlightParasite
// 0x0018 (0x0018 - 0x0000)
struct BP_BlightParasite_C_ExecuteUbergraph_BP_BlightParasite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 K2Node_ComponentBoundEvent_SourceActor;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_TargetActor;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

