#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseSupportVertical

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWESculpturalBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_BaseSupportVertical.BP_BaseSupportVertical_C
// 0x0058 (0x0390 - 0x0338)
class ABP_BaseSupportVertical_C final : public AUWEBaseSupportActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_BaseSupportMeshHelper_C*           BaseSupportMeshHelper;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   UnsupportedIndicatorCube;                          // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementAnchor*                    UWEPlacementAnchor;                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Round_Base_A_StaticMeshComponent0; // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Round_Top_A_StaticMeshComponent0; // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Round_Piston_A_StaticMeshComponent0; // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicOverlayMaterial;                            // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool CanBeMoved();
	void ExecuteUbergraph_BP_BaseSupportVertical(int32 EntryPoint);
	void OnCancelMove();
	void OnMove();
	void OnPlacementChanged();
	void OnPositionsUpdated();
	void OnShowAsGhostChanged(bool bShowAsGhost);
	void OnStartMove();
	void ReceiveBeginPlay();
	void SetUnsupportedFeedbackVisibility(bool bVisible);
	void SetUnsupportedFeedbackVisible(bool Visible);
	void SetUnsupportedIndicatorVisibility(bool Show);
	void SetUnsupportedOverlayMateral(class UMaterialInstanceDynamic* Material);
	void UpdatePositions();

	void GetTraceCheckData(struct FVector* LocalStart, struct FVector* LocalEnd) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BaseSupportVertical_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BaseSupportVertical_C")
	}
	static class ABP_BaseSupportVertical_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseSupportVertical_C>();
	}
};
DUMPER7_ASSERTS_ABP_BaseSupportVertical_C;

SDK_NAMESPACE_END
