#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Beacon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWECarryable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Beacon.BP_Beacon_C
// 0x344A2C60 (0x344A3000 - 0x03A0)
class alignas(0x344A3000) ABP_Beacon_C final : public AUWECarryableActorPowered
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USN2DeconstructableComponent*           SN2Deconstructable;                                // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SKM_Beacon_01;                                     // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPingMarkerComponent*                UWEPingMarker;                                     // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RotationAdjustmentTimer;                           // 0x03C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Beacon_CarryableRootComponent_K2Node_ComponentBoundEvent_0_OnAttachmentChanged__DelegateSignature();
	bool CanBeDeconstructed(struct FGameplayTag* CantDeconstructReason);
	void ExecuteUbergraph_BP_Beacon(int32 EntryPoint);
	bool GetDeconstructCostOverride(TArray<struct FUWESculpturalBaseCellCost>* Costs);
	void PreDeconstruct(class ASN2BuilderTool* BuilderTool);
	void ReceiveBeginPlay();
	bool ShouldDeconstructInstantly();
	void UpdateActiveCue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Beacon_C">();
	}
	static class ABP_Beacon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Beacon_C>();
	}
};

}

