#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BioLab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEBiomods_classes.hpp"
#include "UWECommonUI_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_BioLab.BP_BioLab_C
// 0x0070 (0x03F8 - 0x0388)
class ABP_BioLab_C : public AUWEBioLab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USN2ActiveBaseModuleSound*              SN2ActiveBaseModuleSound;                          // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAttachableComponent*                UWEAttachable;                                     // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPoweredApplianceComponent*          UWEPoweredAppliance;                               // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementAnchor*                    UWEPlacementAnchor;                                // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          InterfaceActiveClient;                             // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  InteractingPawnClient;                             // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             powered_on_sfx;                                    // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void TryTriggerActivateBiomodTutorial(const class AActor* Player);
	void OnWidgetPopped_Event(EUWEWindowManagerLayer LayerId, bool IsLast, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	bool IsInteractDisabled(class AActor* HoverActor, class AActor* ForActor, float Distance, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);
	void InteractServer(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	void InteractEndServer(class AController* Controller, class APawn* Pawn);
	void InteractClient(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	struct FInteractionInfo GetInteractionInfo(class AActor* HoverActor, class AActor* ForActor, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);
	void ExecuteUbergraph_BP_BioLab(int32 EntryPoint);
	void BndEvt__BP_BioLab_UWEAttachable_K2Node_ComponentBoundEvent_0_OnAttached__DelegateSignature(class AActor* AttachedTo);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BioLab_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BioLab_C")
	}
	static class ABP_BioLab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BioLab_C>();
	}
};
DUMPER7_ASSERTS_ABP_BioLab_C;

SDK_NAMESPACE_END
