#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BlightSap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEGameplay_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_BlightSap.BP_BlightSap_C
// 0x0038 (0x0300 - 0x02C8)
class ABP_BlightSap_C final : public AUWEGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEHealthSetComponent*                 UWEHealthSet;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OnBlightSapDied(class AActor* SourceActor, class AActor* TargetActor);
	void ExecuteUbergraph_BP_BlightSap(int32 EntryPoint);
	void EventReceived_408A2D764383210F005378A91B94DFE5(const struct FGameplayEventData& Payload);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BlightSap_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BlightSap_C")
	}
	static class ABP_BlightSap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BlightSap_C>();
	}
};
DUMPER7_ASSERTS_ABP_BlightSap_C;

SDK_NAMESPACE_END
