#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_BlightZoneManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BlightZoneManager.BP_BlightZoneManager_C
// 0x344A2D50 (0x344A3000 - 0x02B0)
class alignas(0x344A3000) ABP_BlightZoneManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWESaveComponent*                      UWESave;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class ABP_BlightZone_C>> BlightZonesArray;                                 // 0x02C8(0x0010)(Edit, BlueprintVisible, Net, SaveGame)
	TArray<bool>                                  RemediateState;                                    // 0x02D8(0x0010)(Edit, BlueprintVisible, Net, SaveGame)
	bool                                          NewVar;                                            // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ConvertCapsuletoSDFInput(class UCapsuleComponent* InCapsule, struct FVector* CapA, struct FVector* CapB, float* Radius);
	void DrawPixel(class UCanvas* Canvas, int32 ID, int32 Column, const struct FLinearColor& Data);
	void Editor_InitializeZones();
	void Editor_Refresh_Preview();
	void ExecuteUbergraph_BP_BlightZoneManager(int32 EntryPoint);
	void InitZone(const int32& ZoneID);
	void PreviewRemediateZone(const int32& ZoneID);
	void QueryID(class ABP_BlightZone_C* Zone, bool* Success, int32* ID);
	void QueryState(int32 ZoneID, bool* Success, bool* Remediated);
	void ReceiveBeginPlay();
	void RegisterBlightZone(class ABP_BlightZone_C* BlightZone, bool Manager);
	void RemediateZone(const int32& ZoneID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BlightZoneManager_C">();
	}
	static class ABP_BlightZoneManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BlightZoneManager_C>();
	}
};

}

