#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BatterySlot_Generic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UWEGameConfiguration_structs.hpp"
#include "UWEInventory_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_BatterySlot_Generic.BP_BatterySlot_Generic_C.UpdatePoweredState
// 0x0088 (0x0088 - 0x0000)
struct BP_BatterySlot_Generic_C_UpdatePoweredState final
{
public:
	bool                                          Powered;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CableTool_C*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUWEGameConfigComponent*                CallFunc_GetGameConfig_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUWEGameConfigSettings                 CallFunc_GetGameSettings_ReturnValue;              // 0x0044(0x002C)(NoDestructor)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetPowerGeneration_PowerGeneration_ImplicitCast; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BatterySlot_Generic_C_UpdatePoweredState;

// Function BP_BatterySlot_Generic.BP_BatterySlot_Generic_C.OnSettingsChanged_Event
// 0x002C (0x002C - 0x0000)
struct BP_BatterySlot_Generic_C_OnSettingsChanged_Event final
{
public:
	struct FUWEGameConfigSettings                 ChangedSettings;                                   // 0x0000(0x002C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_BP_BatterySlot_Generic_C_OnSettingsChanged_Event;

// Function BP_BatterySlot_Generic.BP_BatterySlot_Generic_C.ExecuteUbergraph_BP_BatterySlot_Generic
// 0x00A8 (0x00A8 - 0x0000)
struct BP_BatterySlot_Generic_C_ExecuteUbergraph_BP_BatterySlot_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUWEGameConfigSettings& ChangedSettings)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUWEInventoryItem                      K2Node_ComponentBoundEvent_InventoryItem;          // 0x0018(0x0040)(ConstParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUWEGameConfigComponent*                CallFunc_GetGameConfig_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayDialogueWithinProximity_ReturnValue;  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUWEGameConfigSettings                 K2Node_CustomEvent_ChangedSettings;                // 0x007C(0x002C)(ConstParm, NoDestructor)
};
DUMPER7_ASSERTS_BP_BatterySlot_Generic_C_ExecuteUbergraph_BP_BatterySlot_Generic;

// Function BP_BatterySlot_Generic.BP_BatterySlot_Generic_C.BndEvt__BP_BatterySlot_Generic_UWEInventory_K2Node_ComponentBoundEvent_1_OnItemAdded__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct BP_BatterySlot_Generic_C_BndEvt__BP_BatterySlot_Generic_UWEInventory_K2Node_ComponentBoundEvent_1_OnItemAdded__DelegateSignature final
{
public:
	struct FUWEInventoryItem                      InventoryItem;                                     // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_BatterySlot_Generic_C_BndEvt__BP_BatterySlot_Generic_UWEInventory_K2Node_ComponentBoundEvent_1_OnItemAdded__DelegateSignature;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
