#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_BaseRuntimeManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseRuntimeManager.BP_BaseRuntimeManager_C
// 0x344A2D50 (0x344A3000 - 0x02B0)
class alignas(0x344A3000) ABP_BaseRuntimeManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEPoweredApplianceComponent*          UWEPoweredAppliance;                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CheckPowerActorTimer;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 AttachPowerActor;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class AActor*>                         EmissiveActors;                                    // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FVector                                BoxExtents;                                        // 0x02E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ALight*>                         LightActors;                                       // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	double                                        LIghtDistance;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor_NoPower;                                // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor_Power;                                  // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UMaterialInterface*, class UMaterialInterface*> MaterialMap_Powered;                  // 0x0338(0x0050)(Edit, BlueprintVisible)
	TMap<class UMaterialInterface*, class UMaterialInterface*> MateiralMap_Unpowered;                // 0x0388(0x0050)(Edit, BlueprintVisible)

public:
	void ActivateEmissives();
	void ActivateLights();
	void BndEvt__BP_BaseManager_UWEPoweredAppliance_K2Node_ComponentBoundEvent_0_OnPoweredStateChanged__DelegateSignature(bool NewIsPowered);
	void CheckAttachPowerActor();
	void DeactivateEmissives();
	void DeactivateLights();
	void ExecuteUbergraph_BP_BaseRuntimeManager(int32 EntryPoint);
	void FindEmissiveActorsInRange();
	void FindLightActorsInRange();
	void IsEligibleActor(class AActor* TargetActor, bool* IsEligible);
	void ReceiveBeginPlay();
	void UpdatePoweredStateVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BaseRuntimeManager_C">();
	}
	static class ABP_BaseRuntimeManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseRuntimeManager_C>();
	}
};

}

