#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_BaseAngledSupportCorridor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWESculpturalBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseAngledSupportCorridor.BP_BaseAngledSupportCorridor_C
// 0x344A2CC8 (0x344A3000 - 0x0338)
class alignas(0x344A3000) ABP_BaseAngledSupportCorridor_C final : public AUWEBaseSupportActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_BaseSupportMeshHelper_C*           BaseSupportMeshHelper;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Round_Piston_A_StaticMeshComponent0; // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Round_Base_A_StaticMeshComponent0; // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Foundations_Pillar_Round_Top_A_StaticMeshComponent0; // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LeftBase;                                          // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LeftPiston;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_AngledRoomSupportHelper_C*         BPC_AngledRoomSupportHelper;                       // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Start;                                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementAnchor*                    UWEPlacementAnchor;                                // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RightBase;                                         // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoubleTop;                                         // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RightPiston;                                       // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicOverlayMaterial;                            // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSingle;                                         // 0x03C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	bool CanBeMoved();
	void ExecuteUbergraph_BP_BaseAngledSupportCorridor(int32 EntryPoint);
	void GetAngleTraceCheckDataLeft(struct FVector* LocalStart, struct FVector* LocalEnd);
	void GetAngleTraceCheckDataRight(struct FVector* LocalStart, struct FVector* LocalEnd);
	void OnCancelMove();
	void OnMove();
	void OnPlacementChanged();
	void OnPositionsUpdated();
	void OnRep_UseSingle();
	void OnShowAsGhostChanged(bool bShowAsGhost);
	void OnStartMove();
	void ReceiveBeginPlay();
	void UpdatePositions();

	void GetTraceCheckData(struct FVector* LocalStart, struct FVector* LocalEnd) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BaseAngledSupportCorridor_C">();
	}
	static class ABP_BaseAngledSupportCorridor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseAngledSupportCorridor_C>();
	}
};

}

