#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BO_CG_PlateauCave_1b

#include "Basic.hpp"

#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_BO_CG_PlateauCave_1b.BP_BO_CG_PlateauCave_1b_C
// 0x0068 (0x0318 - 0x02B0)
class ABP_BO_CG_PlateauCave_1b_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_CG_RockCliffOverhang_01a138_StaticMeshComponent0; // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_RockCliffOverhang_01a129_StaticMeshComponent0; // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_RockCliffOverhang_01a139_StaticMeshComponent0; // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_RockCliffOverhang_01a136_StaticMeshComponent0; // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_RockCliffOverhang_01a137_StaticMeshComponent0; // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Disc_StaticMeshComponent0;                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_RockRoundLarge_01a135_StaticMeshComponent0;  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_RockCliffOverhang_01a141_StaticMeshComponent0; // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_RockCliffOverhang_01a142_StaticMeshComponent0; // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_RockCliffOverhang_01a143_StaticMeshComponent0; // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_RockCliffOverhang_01a140_StaticMeshComponent0; // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_RockCliffOverhang_01a144_StaticMeshComponent0; // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BO_CG_PlateauCave_1b_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BO_CG_PlateauCave_1b_C")
	}
	static class ABP_BO_CG_PlateauCave_1b_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BO_CG_PlateauCave_1b_C>();
	}
};
DUMPER7_ASSERTS_ABP_BO_CG_PlateauCave_1b_C;

SDK_NAMESPACE_END
