#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CoralCabbage_03c

#include "Basic.hpp"

#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_CoralCabbage_03c.BP_CoralCabbage_03c_C
// 0x0028 (0x02D8 - 0x02B0)
class ABP_CoralCabbage_03c_C final : public AActor
{
public:
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoralCabbage_03a5_StaticMeshComponent0;         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoralCabbage_03a4_StaticMeshComponent0;         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoralCabbage_03a3_StaticMeshComponent0;         // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CoralCabbage_03c_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CoralCabbage_03c_C")
	}
	static class ABP_CoralCabbage_03c_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CoralCabbage_03c_C>();
	}
};
DUMPER7_ASSERTS_ABP_CoralCabbage_03c_C;

SDK_NAMESPACE_END
