#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_CoralPad_01c

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CoralPad_01c.BP_CoralPad_01c_C
// 0x344A2DA2 (0x344A3052 - 0x02B0)
class alignas(0x344A3052) ABP_CoralPad_01c_C final : public AActor
{
public:
	class UUWESaveComponent*                      UWESave;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESeedGrowerReplicatorComponent*      UWESeedGrowerReplicator;                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESeedGrowerComponent*                UWESeedGrower;                                     // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CoralPad_01c_C">();
	}
	static class ABP_CoralPad_01c_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CoralPad_01c_C>();
	}
};

}

