#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_CeilingLight_Rect_A

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CeilingLight_Rect_A.BP_CeilingLight_Rect_A_C.BndEvt__BP_CeilingLight_Rect_A_UWEPoweredAppliance_K2Node_ComponentBoundEvent_1_OnPoweredStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_CeilingLight_Rect_A_C_BndEvt__BP_CeilingLight_Rect_A_UWEPoweredAppliance_K2Node_ComponentBoundEvent_1_OnPoweredStateChanged__DelegateSignature final
{
public:
	bool                                          NewIsPowered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CeilingLight_Rect_A.BP_CeilingLight_Rect_A_C.ExecuteUbergraph_BP_CeilingLight_Rect_A
// 0x0008 (0x0008 - 0x0000)
struct BP_CeilingLight_Rect_A_C_ExecuteUbergraph_BP_CeilingLight_Rect_A final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_NewIsPowered;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPowered_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CeilingLight_Rect_A.BP_CeilingLight_Rect_A_C.UpdatePowerState
// 0x000C (0x000C - 0x0000)
struct BP_CeilingLight_Rect_A_C_UpdatePowerState final
{
public:
	bool                                          IsPowered;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CeilingLight_Rect_A.BP_CeilingLight_Rect_A_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_CeilingLight_Rect_A_C_UserConstructionScript final
{
public:
	double                                        K2Node_VariableSet_LightIntensity_Powered_ImplicitCast; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

