#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_CG_CoralDomeMedium_02

#include "Basic.hpp"

#include "BP_CoralDome_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CG_CoralDomeMedium_02.BP_CG_CoralDomeMedium_02_C
// 0x344A2D38 (0x344A3000 - 0x02C8)
class alignas(0x344A3000) ABP_CG_CoralDomeMedium_02_C final : public ABP_CoralDome_C
{
public:
	class USphereComponent*                       LargeCreatureBlocker;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPawnAttachmentOwner*                UWEPawnAttachmentOwner;                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionStimuliSourceComponent*    AIPerceptionStimuliSource;                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CG_CoralDomeMedium_02_C">();
	}
	static class ABP_CG_CoralDomeMedium_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CG_CoralDomeMedium_02_C>();
	}
};

}

