#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CeilingLight_Rect_A

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_LampBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_CeilingLight_Rect_A.BP_CeilingLight_Rect_A_C
// 0x0040 (0x0320 - 0x02E0)
class ABP_CeilingLight_Rect_A_C final : public ABP_LampBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CeilingLight_Rect_A_C;           // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementAnchor*                    UWEPlacementAnchor;                                // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        LightIntensity_Unpowered;                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightIntensity_Powered;                            // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_CeilingLight_Rect_A_UWEPoweredAppliance_K2Node_ComponentBoundEvent_1_OnPoweredStateChanged__DelegateSignature(bool NewIsPowered);
	void ExecuteUbergraph_BP_CeilingLight_Rect_A(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UpdatePowerState(bool IsPowered);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CeilingLight_Rect_A_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CeilingLight_Rect_A_C")
	}
	static class ABP_CeilingLight_Rect_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CeilingLight_Rect_A_C>();
	}
};
DUMPER7_ASSERTS_ABP_CeilingLight_Rect_A_C;

SDK_NAMESPACE_END
