#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CG_HangingVine04b

#include "Basic.hpp"

#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_CG_HangingVine04b.BP_CG_HangingVine04b_C
// 0x0028 (0x02D8 - 0x02B0)
class ABP_CG_HangingVine04b_C final : public AActor
{
public:
	class UPointLightComponent*                   PointLight;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_HangingVine_04c;                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_HangingVine_04a;                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CG_HangingVine04b_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CG_HangingVine04b_C")
	}
	static class ABP_CG_HangingVine04b_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CG_HangingVine04b_C>();
	}
};
DUMPER7_ASSERTS_ABP_CG_HangingVine04b_C;

SDK_NAMESPACE_END
