#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_CeilingLight_Rect_A

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_LampBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CeilingLight_Rect_A.BP_CeilingLight_Rect_A_C
// 0x00E3 (0x344A30E9 - 0x344A3006)
class alignas(0x344A30E9) ABP_CeilingLight_Rect_A_C final : public ABP_LampBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CeilingLight_Rect_A_C;           // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementAnchor*                    UWEPlacementAnchor;                                // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        LightIntensity_Unpowered;                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightIntensity_Powered;                            // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_CeilingLight_Rect_A_UWEPoweredAppliance_K2Node_ComponentBoundEvent_1_OnPoweredStateChanged__DelegateSignature(bool NewIsPowered);
	void ExecuteUbergraph_BP_CeilingLight_Rect_A(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UpdatePowerState(bool IsPowered);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CeilingLight_Rect_A_C">();
	}
	static class ABP_CeilingLight_Rect_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CeilingLight_Rect_A_C>();
	}
};

}

