#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Carryable_WallRack

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UWESculpturalBase_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_Carryable_WallRack.BP_Carryable_WallRack_C.CanBeDeconstructed
// 0x000C (0x000C - 0x0000)
struct BP_Carryable_WallRack_C_CanBeDeconstructed final
{
public:
	struct FGameplayTag                           CantDeconstructReason;                             // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOccupied_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Carryable_WallRack_C_CanBeDeconstructed;

// Function BP_Carryable_WallRack.BP_Carryable_WallRack_C.ExecuteUbergraph_BP_Carryable_WallRack
// 0x0028 (0x0028 - 0x0000)
struct BP_Carryable_WallRack_C_ExecuteUbergraph_BP_Carryable_WallRack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UUWEBaseCellLockComponent*        K2Node_Event_LockComponent;                        // 0x0008(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetCenterCellBrushType_ReturnValue;       // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASN2BuilderTool*                        K2Node_Event_BuilderTool;                          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Carryable_WallRack_C_ExecuteUbergraph_BP_Carryable_WallRack;

// Function BP_Carryable_WallRack.BP_Carryable_WallRack_C.GetDeconstructCostOverride
// 0x0018 (0x0018 - 0x0000)
struct BP_Carryable_WallRack_C_GetDeconstructCostOverride final
{
public:
	TArray<struct FUWESculpturalBaseCellCost>     Costs;                                             // 0x0000(0x0010)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Carryable_WallRack_C_GetDeconstructCostOverride;

// Function BP_Carryable_WallRack.BP_Carryable_WallRack_C.OnLockAdded
// 0x0008 (0x0008 - 0x0000)
struct BP_Carryable_WallRack_C_OnLockAdded final
{
public:
	const class UUWEBaseCellLockComponent*        LockComponent;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Carryable_WallRack_C_OnLockAdded;

// Function BP_Carryable_WallRack.BP_Carryable_WallRack_C.OnRep_ShowDetail
// 0x0001 (0x0001 - 0x0000)
struct BP_Carryable_WallRack_C_OnRep_ShowDetail final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Carryable_WallRack_C_OnRep_ShowDetail;

// Function BP_Carryable_WallRack.BP_Carryable_WallRack_C.PreDeconstruct
// 0x0008 (0x0008 - 0x0000)
struct BP_Carryable_WallRack_C_PreDeconstruct final
{
public:
	class ASN2BuilderTool*                        BuilderTool;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Carryable_WallRack_C_PreDeconstruct;

// Function BP_Carryable_WallRack.BP_Carryable_WallRack_C.ShouldDeconstructInstantly
// 0x0001 (0x0001 - 0x0000)
struct BP_Carryable_WallRack_C_ShouldDeconstructInstantly final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Carryable_WallRack_C_ShouldDeconstructInstantly;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
