#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_CameraTractorBeam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CameraTractorBeam.BP_CameraTractorBeam_C.ExecuteUbergraph_BP_CameraTractorBeam
// 0x02A0 (0x02A0 - 0x0000)
struct BP_CameraTractorBeam_C_ExecuteUbergraph_BP_CameraTractorBeam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSplinePoint                           CallFunc_GetSplinePointAt_ReturnValue;             // 0x0070(0x0088)(NoDestructor)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0100(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FSplinePoint                           CallFunc_GetSplinePointAt_ReturnValue_1;           // 0x0200(0x0088)(NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CameraTractorBeam.BP_CameraTractorBeam_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CameraTractorBeam_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CameraTractorBeam.BP_CameraTractorBeam_C.SetInventoryTarget
// 0x0018 (0x0018 - 0x0000)
struct BP_CameraTractorBeam_C_SetInventoryTarget final
{
public:
	class UUWEInventoryComponent*                 Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_LoadIntoInventoryTrigger_C*         K2Node_DynamicCast_AsBP_Load_Into_Inventory_Trigger; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

