#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_CG_CoralDomeSmall_02b

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CoralDome_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CG_CoralDomeSmall_02b.BP_CG_CoralDomeSmall_02b_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_CG_CoralDomeSmall_02b_C final : public ABP_CoralDome_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CG_CoralDomeSmall_02b_C;         // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstancedStaticMeshComponent*          SM_CoralLobe_03a;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_CG_CoralWafer_01d;                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_CG_CoralWafer_01c;                              // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_CG_CoralWafer_01b;                              // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPawnAttachmentOwner*                UWEPawnAttachmentOwner;                            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_CoralWafer_01a14_StaticMeshComponent0;       // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_CoralDome_02a_StaticMeshComponent0;          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralDome_Spawn_NiagaraComponent0;              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CG_CoralDomeSmall_02b(int32 EntryPoint);
	void OnRamHit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CG_CoralDomeSmall_02b_C">();
	}
	static class ABP_CG_CoralDomeSmall_02b_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CG_CoralDomeSmall_02b_C>();
	}
};

}

