#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_CherimoyaRotsac_Fruit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_BasePickupItem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CherimoyaRotsac_Fruit.BP_CherimoyaRotsac_Fruit_C
// 0x344A2C40 (0x344A3000 - 0x03C0)
class alignas(0x344A3000) ABP_CherimoyaRotsac_Fruit_C final : public ABP_BasePickupItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CherimoyaRotsac_Fruit_C;         // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEAbilitySystemComponent*             UWEAbilitySystem;                                  // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEHealthSetComponent*                 UWEHealthSet;                                      // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionStimuliSourceComponent*    AIPerceptionStimuliSource;                         // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OriginalLocation;                                  // 0x03E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CherimoyaRotsac_Fruit(int32 EntryPoint);
	struct FVector GetNormalisedNoiseVector(const struct FVector& A);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CherimoyaRotsac_Fruit_C">();
	}
	static class ABP_CherimoyaRotsac_Fruit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CherimoyaRotsac_Fruit_C>();
	}
};

}

