#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Clamthulu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AIAnimationSequenceActor_classes.hpp"
#include "F_BooleanPair_S_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Clamthulu.BP_Clamthulu_C
// 0x007D (0x344A307D - 0x344A3000)
class alignas(0x344A307D) ABP_Clamthulu_C final : public ABP_AIAnimationSequenceActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Collision_Right;                   // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Collision_Left;                    // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshVolumeComponent*             DamageMesh;                                        // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          UWEMovingWaterCurrent_Box_R;                       // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          UWEMovingWaterCurrent_Box_L;                       // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEMovingWaterCurrentComponent*        UWEMovingWaterCurrent;                             // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Shell_Hinge;                       // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR38;                   // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR36;                   // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR32;                   // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR29;                   // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR28;                   // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR27;                   // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR26;                   // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR25;                   // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR24;                   // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Interior_Center1;                  // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Roots_low;                         // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR23;                   // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR22;                   // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR21;                   // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR20;                   // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR19;                   // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR18;                   // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR17;                   // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR16;                   // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR15;                   // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR14;                   // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR13;                   // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR12;                   // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR11;                   // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR10;                   // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR9;                    // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR8;                    // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR7;                    // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR5;                    // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR4;                    // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMeshR3;                    // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh43;                    // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh35;                    // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh34;                    // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh33;                    // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh32;                    // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh31;                    // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh30;                    // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh29;                    // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh25;                    // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh24;                    // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh23;                    // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh22;                    // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh21;                    // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh20;                    // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh17;                    // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh16;                    // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh15;                    // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh14;                    // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh13;                    // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh12;                    // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh11;                    // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh10;                    // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh9;                     // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh;                      // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh8;                     // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh7;                     // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh6;                     // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh3;                     // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh4;                     // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh1;                     // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh2;                     // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ClamthuluEyeSkeletalMesh_C*        BPC_ClamthuluEyeSkeletalMesh5;                     // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ClamthuluShellOpen;                             // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ClamthuluShell_Open;                            // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ClamthuluShellClose_WaterRush1;                 // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ClamthuluShellClose_WaterRush;                  // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Interior_R;                        // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Shell_Sides_R;                     // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Shell_Crest_R;                     // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Shell_Base_R;                      // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ClamthuluShellOpen1;                            // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ClamthuluShellOpen2;                            // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ClamthuluShellClose_WaterRush3;                 // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ClamthuluShellClose_WaterRush2;                 // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Interior_L;                        // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Shell_Sides_L;                     // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Shell_Crest_L;                     // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Clamthulu_01_Shell_Base_L;                      // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SKM_Clamthulu;                                     // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ClamthuluShellClose_Boof;                       // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ClamthuluAcidCloud;                             // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAbilitySystemComponent*             UWEAbilitySystem;                                  // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEStimulusSystemComponent*            UWEStimulusSystem;                                 // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         In_Sequence;                                       // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CooldownTimer;                                     // 0x0680(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, struct FF_BooleanPair_S>  CrushHitActors;                                    // 0x0688(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        CrushDetectionDelay;                               // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CrushTimer;                                        // 0x06E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        AgitationMaxValue;                                 // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, double>             AgitationPerStimulusType;                          // 0x06F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        AgitationCurrentValue;                             // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBPC_ClamthuluEyeSkeletalMesh_C*> Eyes;                                             // 0x0748(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Added_6661D09E46DB97A28EEE30AFEE036234();
	void Added_A43F8FF447F68DE8AACE61882E319313();
	void ApplyDamage(double Damage);
	void BndEvt__BP_Clamthulu_SM_Clamthulu_01_Collision_Left_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__BP_Clamthulu_SM_Clamthulu_01_Collision_Right_K2Node_ComponentBoundEvent_6_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__BP_Clamthulu_SM_Clamthulu_01_Shell_Crest_L_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__BP_Clamthulu_SM_Clamthulu_01_Shell_Crest_R_K2Node_ComponentBoundEvent_3_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__BP_Clamthulu_SM_Clamthulu_01_Shell_Sides_L_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__BP_Clamthulu_SM_Clamthulu_01_Shell_Sides_R_K2Node_ComponentBoundEvent_4_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__BP_Clamthulu_SweepTestEnforceOverlapBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CleanHitActors();
	void CrushChecker();
	void CrushHitActor(class AActor* HitActor);
	void DoOpenClose();
	void ExecuteUbergraph_BP_Clamthulu(int32 EntryPoint);
	void InvalidateTimer();
	void LoadAllEyes();
	void LookAtPlayerStart();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void RegisterAgitation(const struct FGameplayTag& StimulisType);
	void UpdateHitLeft(class AActor* HitActor);
	void UpdateHitRight(class AActor* HitActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Clamthulu_C">();
	}
	static class ABP_Clamthulu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Clamthulu_C>();
	}
};

}

