#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_CameraSystemScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CameraSystemScreen.BP_CameraSystemScreen_C
// 0x344A2D50 (0x344A3000 - 0x02B0)
class alignas(0x344A3000) ABP_CameraSystemScreen_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_ProtoypeGenericButton_C*           HasSpotlightIndicatorButton;                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SpotlightActiveIndicator;                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Screen;                                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   CameraName;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWECameraFeedTargetComponent*          UWECameraFeedTarget;                               // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ScreenBG;                                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CameraSystemCamera_C*               InitialCamera;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture*                               FallbackTexture;                                   // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   TextureParameterName;                              // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   NoCameraText;                                      // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_CameraSystemCamera_C*               CurrentCamera;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          Powered;                                           // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_CameraSystemScreen_HasSpotlightIndicatorButton_K2Node_ComponentBoundEvent_4_OnInteractionServer__DelegateSignature(class AController* Controller, class APawn* Pawn);
	void BndEvt__BP_CameraSystemScreen_UWECameraFeedTarget_K2Node_ComponentBoundEvent_2_UWECameraFeedSetCurrentSource__DelegateSignature(class UUWECameraFeedSourceComponent* Source);
	void BndEvt__BP_CameraSystemScreen_UWECameraFeedTarget_K2Node_ComponentBoundEvent_3_UWECameraFeedClearCameraSource__DelegateSignature();
	void BndEvt__BP_VoidCameraScreen_UWECameraFeedTarget_K2Node_ComponentBoundEvent_0_UWECameraFeedSetTextureDelegate__DelegateSignature(class UTexture* Texture);
	void BndEvt__BP_VoidCameraScreen_UWECameraFeedTarget_K2Node_ComponentBoundEvent_1_UWECameraFeedClearTextureDelegate__DelegateSignature();
	void ExecuteUbergraph_BP_CameraSystemScreen(int32 EntryPoint);
	void Initialize_Material_If_Needed();
	void OnRep_CurrentCamera();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Set_Interactable(bool Interactable);
	void SetCamera(class ABP_CameraSystemCamera_C* Camera);
	void SetCollisionPreset(ECollisionChannel CollisionChannel);
	void SetPowerEnabled(bool Powered_0);
	void UpdateCurrentCameraVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CameraSystemScreen_C">();
	}
	static class ABP_CameraSystemScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CameraSystemScreen_C>();
	}
};

}

