#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CoralSeaWhip_02a

#include "Basic.hpp"

#include "UWEGameplay_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_CoralSeaWhip_02a.BP_CoralSeaWhip_02a_C
// 0x0038 (0x0300 - 0x02C8)
class ABP_CoralSeaWhip_02a_C final : public AUWEGameplayActor
{
public:
	class UUWESaveComponent*                      UWESave;                                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEHealthSetComponent*                 UWEHealthSet;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlantGrowerComponent*               UWEPlantGrower;                                    // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USmartObjectComponent*                  SmartObject;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionStimuliSourceComponent*    AIPerceptionStimuliSource;                         // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CoralSeaWhip_02a_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CoralSeaWhip_02a_C")
	}
	static class ABP_CoralSeaWhip_02a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CoralSeaWhip_02a_C>();
	}
};
DUMPER7_ASSERTS_ABP_CoralSeaWhip_02a_C;

SDK_NAMESPACE_END
