#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_ComputerTextInterface_Terminal_Mini_Lifepod

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ComputerTextInterface_Terminal_Mini_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ComputerTextInterface_Terminal_Mini_Lifepod.BP_ComputerTextInterface_Terminal_Mini_Lifepod_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_ComputerTextInterface_Terminal_Mini_Lifepod_C final : public ABP_ComputerTextInterface_Terminal_Mini_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ComputerTextInterface_Terminal_Mini_Lifepod_C; // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEComputerTextInterfaceDialogueData*  DialogueOptionLaunch;                              // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEComputerTextInterfaceDialogueData*  DialogueOptionLaunch_NotAllInLifepod;              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEComputerTextInterfaceDialogueData*  DialogueOptionLaunch_BothClampsAttached;           // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEComputerTextInterfaceDialogueData*  DialogueOptionLaunch_OneClampAttached;             // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RefreshTimer;                                      // 0x0310(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          LaunchLifepodWorldStoryGoal;                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEComputerTextInterfaceDialogueData*  DialogueOption_BootNoA;                            // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEComputerTextInterfaceDialogueData*  DialogueOption_Assess;                             // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          BootLifepodNoAWorldStoryGoal;                      // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          InvestigatorAssignedWorldStoryGoal;                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_LifepodBay_Chunk_Hatch_C*           LifepodBayChunk;                                   // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_LifepodManager_C>    LifepodManager;                                    // 0x0348(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void SetLaunchOption(int32 Option);
	void OnPlayerReady_C6AA98E641F262B60B0D07B9596146F7();
	void ReceiveBeginPlay();
	void RefreshDeepStartOptions();
	void UpdateButtons();
	void CheckIfLaunchLifepod(class UUWEStoryGoal* UnlockedStoryGoal, class AActor* ReceivingActor);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnRadioMessageStateChanged(bool bHasRadioMessage);
	void ExecuteUbergraph_BP_ComputerTextInterface_Terminal_Mini_Lifepod(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ComputerTextInterface_Terminal_Mini_Lifepod_C">();
	}
	static class ABP_ComputerTextInterface_Terminal_Mini_Lifepod_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ComputerTextInterface_Terminal_Mini_Lifepod_C>();
	}
};

}

