#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CG_MegajellyBell_02a

#include "Basic.hpp"

#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_CG_MegajellyBell_02a.BP_CG_MegajellyBell_02a_C
// 0x0030 (0x02E0 - 0x02B0)
class ABP_CG_MegajellyBell_02a_C final : public AActor
{
public:
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BumpsMesh;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   EyesMesh;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BellMesh;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   UndersideMesh;                                     // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CG_MegajellyBell_02a_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CG_MegajellyBell_02a_C")
	}
	static class ABP_CG_MegajellyBell_02a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CG_MegajellyBell_02a_C>();
	}
};
DUMPER7_ASSERTS_ABP_CG_MegajellyBell_02a_C;

SDK_NAMESPACE_END
