#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CG_CoralDomeSmall_02a

#include "Basic.hpp"

#include "BP_CoralDome_Base_classes.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_CG_CoralDomeSmall_02a.BP_CG_CoralDomeSmall_02a_C
// 0x0040 (0x0340 - 0x0300)
class ABP_CG_CoralDomeSmall_02a_C final : public ABP_CoralDome_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CG_CoralDomeSmall_02a_C;         // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstancedStaticMeshComponent*          SM_CoralLobe_03a;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPawnAttachmentOwner*                UWEPawnAttachmentOwner;                            // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_CoralDome_02a_StaticMeshComponent0;          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralDome_Spawn_NiagaraComponent0;              // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralDome_Spawn35_NiagaraComponent0;            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralDome_Spawn36_NiagaraComponent0;            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralDome_Spawn37_NiagaraComponent0;            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void OnRamHit();
	void ExecuteUbergraph_BP_CG_CoralDomeSmall_02a(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CG_CoralDomeSmall_02a_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CG_CoralDomeSmall_02a_C")
	}
	static class ABP_CG_CoralDomeSmall_02a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CG_CoralDomeSmall_02a_C>();
	}
};
DUMPER7_ASSERTS_ABP_CG_CoralDomeSmall_02a_C;

SDK_NAMESPACE_END
