#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cicada_SuitLocker_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Cicada_SuitLocker_01.BP_Cicada_SuitLocker_01_C
// 0x0040 (0x02F0 - 0x02B0)
class ABP_Cicada_SuitLocker_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Cicada_SuitLocker_01_Glass;                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Cicada_SuitLocker_01_DoorRight_Glass;           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Cicada_SuitLocker_01_DoorLeft_Glass;            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Cicada_SuitLocker_01_DoorRight;                 // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Cicada_SuitLocker_01_DoorLeft;                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        DoorLeft_Rotation;                                 // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DoorRight_Rotation;                                // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Cicada_SuitLocker_01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Cicada_SuitLocker_01_C")
	}
	static class ABP_Cicada_SuitLocker_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Cicada_SuitLocker_01_C>();
	}
};
DUMPER7_ASSERTS_ABP_Cicada_SuitLocker_01_C;

SDK_NAMESPACE_END
