#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_CG_CoralDomeMedium_03a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CoralDome_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CG_CoralDomeMedium_03a.BP_CG_CoralDomeMedium_03a_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_CG_CoralDomeMedium_03a_C final : public ABP_CoralDome_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CG_CoralDomeMedium_03a_C;        // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstancedStaticMeshComponent*          SM_CoralLobe_03a;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_CoralLobe_03b;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_CoralTubeLarge_01a;                             // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_CoralTubeLarge_01b;                             // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_CoralTubeLarge_01c;                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPawnAttachmentOwner*                UWEPawnAttachmentOwner;                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_CoralDome_03a_StaticMeshComponent0;          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralDome_Spawn_NiagaraComponent0;              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralDome_Spawn18_NiagaraComponent0;            // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralDome_Spawn20_NiagaraComponent0;            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralDome_Spawn21_NiagaraComponent0;            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralDome_Spawn22_NiagaraComponent0;            // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralDome_Spawn19_NiagaraComponent0;            // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralDome_Spawn23_NiagaraComponent0;            // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CG_CoralDomeMedium_03a(int32 EntryPoint);
	void OnRamHit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CG_CoralDomeMedium_03a_C">();
	}
	static class ABP_CG_CoralDomeMedium_03a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CG_CoralDomeMedium_03a_C>();
	}
};

}

