#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Carryable_WallRack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Carryable_WallRack.BP_Carryable_WallRack_C
// 0x0058 (0x0308 - 0x02B0)
class ABP_Carryable_WallRack_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USN2HighlightComponent*                 SN2InteractHighlight;                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWECarryableAttachPointComponent*      UWECarryableAttachPoint;                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_HardPoint_C*                       BPC_HardPoint;                                     // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESaveComponent*                      UWESave;                                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   EdgeDetail;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementAnchor*                    UWEPlacementAnchor;                                // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDetail;                                        // 0x0300(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	bool CanBeDeconstructed(struct FGameplayTag* CantDeconstructReason);
	void ExecuteUbergraph_BP_Carryable_WallRack(int32 EntryPoint);
	bool GetDeconstructCostOverride(TArray<struct FUWESculpturalBaseCellCost>* Costs);
	void OnLockAdded(const class UUWEBaseCellLockComponent* LockComponent);
	void OnRep_ShowDetail();
	void PreDeconstruct(class ASN2BuilderTool* BuilderTool);
	void ReceiveBeginPlay();
	bool ShouldDeconstructInstantly();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Carryable_WallRack_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Carryable_WallRack_C")
	}
	static class ABP_Carryable_WallRack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Carryable_WallRack_C>();
	}
};
DUMPER7_ASSERTS_ABP_Carryable_WallRack_C;

SDK_NAMESPACE_END
