#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CG_CoralDomeMedium_01a

#include "Basic.hpp"

#include "BP_CoralDome_Base_classes.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_CG_CoralDomeMedium_01a.BP_CG_CoralDomeMedium_01a_C
// 0x0078 (0x0378 - 0x0300)
class ABP_CG_CoralDomeMedium_01a_C final : public ABP_CoralDome_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CG_CoralDomeMedium_01a_C;        // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstancedStaticMeshComponent*          SM_BarnacleFossil_01b8;                            // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_CoralTubeLarge_01c;                             // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_CoralTubeLarge_01b;                             // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_CoralTubeLarge_01a;                             // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_CoralLobe_03b;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          SM_CoralLobe_03a;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPawnAttachmentOwner*                UWEPawnAttachmentOwner;                            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralLobeSpawn6_NiagaraComponent0;              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralLobeSpawn5_NiagaraComponent0;              // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralLobeSpawn_NiagaraComponent0;               // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralLobeSpawn4_NiagaraComponent0;              // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralLobeSpawn3_NiagaraComponent0;              // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_CoralLobeSpawn2_NiagaraComponent0;              // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CG_CoralDome_01a_StaticMeshComponent0;          // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void OnRamHit();
	void ExecuteUbergraph_BP_CG_CoralDomeMedium_01a(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CG_CoralDomeMedium_01a_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CG_CoralDomeMedium_01a_C")
	}
	static class ABP_CG_CoralDomeMedium_01a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CG_CoralDomeMedium_01a_C>();
	}
};
DUMPER7_ASSERTS_ABP_CG_CoralDomeMedium_01a_C;

SDK_NAMESPACE_END
