#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_DynamicActorAssociatedWithProxy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEDynamicItems_structs.hpp"


namespace SDK::Params
{

// Function BP_DynamicActorAssociatedWithProxy.BP_DynamicActorAssociatedWithProxy_C.ExecuteUbergraph_BP_DynamicActorAssociatedWithProxy
// 0x0060 (0x0060 - 0x0000)
struct BP_DynamicActorAssociatedWithProxy_C_ExecuteUbergraph_BP_DynamicActorAssociatedWithProxy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWEPlaceableProxySpawnedActor         CallFunc_GetSpawnedActor_ReturnValue;              // 0x0008(0x0010)(NoDestructor)
	bool                                          K2Node_CustomEvent_Active;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewActive;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWEPlaceableProxySpawnedActor         CallFunc_GetSpawnedActor_ReturnValue_1;            // 0x0040(0x0010)(NoDestructor)
	class ASN2BlightNodeDamagePoint*              K2Node_DynamicCast_AsSN2Blight_Node_Damage_Point;  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNodeBroken_ReturnValue;                 // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_DynamicActorAssociatedWithProxy.BP_DynamicActorAssociatedWithProxy_C.OnProxyStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_DynamicActorAssociatedWithProxy_C_OnProxyStateChanged final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_DynamicActorAssociatedWithProxy.BP_DynamicActorAssociatedWithProxy_C.SetNewActiveState
// 0x0001 (0x0001 - 0x0000)
struct BP_DynamicActorAssociatedWithProxy_C_SetNewActiveState final
{
public:
	bool                                          NewActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

