#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeepPlayerStart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEGameModeTypes_structs.hpp"
#include "Subnautica2_classes.hpp"
#include "UWEUtilities_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_DeepPlayerStart.BP_DeepPlayerStart_C
// 0x0070 (0x0478 - 0x0408)
class ABP_DeepPlayerStart_C final : public ASN2PlayerStart
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<TSoftObjectPtr<class AUWEBioBedBase>>  PossibleBioBeds;                                   // 0x0410(0x0010)(Edit, BlueprintVisible)
	float                                         FirstPlayerStartingTimeOfDay;                      // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                FirstTimeAtSurfaceStoryGoal;                       // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         FirstPlayerSurfacedTimeOfDay;                      // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  PlayerPawn;                                        // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AUWEPlayerTrigger*                      DeepStartIntroTrigger;                             // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         NextBioBedIndex;                                   // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABP_LifepodManager_C>    LifepodManager;                                    // 0x0450(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OnStoryGoalUnlocked_Event(class UUWEStoryGoal* UnlockedStoryGoal, class AActor* ReceivingActor);
	void OnStartConditionsApplied(class APawn* PlayerPawn_0);
	void OnPreSpawnReady(class AController* Player);
	void ExecuteUbergraph_BP_DeepPlayerStart(int32 EntryPoint);
	void AssignToBiobed(class APawn* PlayerPawn_0, class AUWEBioBedBase** AssignedBed);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DeepPlayerStart_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DeepPlayerStart_C")
	}
	static class ABP_DeepPlayerStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeepPlayerStart_C>();
	}
};
DUMPER7_ASSERTS_ABP_DeepPlayerStart_C;

SDK_NAMESPACE_END
