#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeepWingLeviathan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SN2AILargeFish_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_DeepWingLeviathan.BP_DeepWingLeviathan_C
// 0x0078 (0x0548 - 0x04D0)
class ABP_DeepWingLeviathan_C final : public ABP_SN2AILargeFish_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_DeepWing_EggsSpawner;                           // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Deepwing_Blockout_Dynamesh;                        // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_CreatureAnimationComponent_C*      BPC_CreatureAnimationComponent;                    // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEStimulusSystemComponent*            UWEStimulusSystem;                                 // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          LayingEggs;                                        // 0x0500(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           StopEggsTimer;                                     // 0x0508(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       PatrolSplineComponent;                             // 0x0510(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           EggItemSockets;                                    // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        EggItemScale;                                      // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EggItemMinSpawnTime;                               // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EggItemMaxSpawnTime;                               // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           EggTickTimerHandle;                                // 0x0540(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void EggTick();
	void ExecuteUbergraph_BP_DeepWingLeviathan(int32 EntryPoint);
	void InitializeEggParticles(bool Enabled, class USplineComponent* SplineComponent, double CurrentDistanceOnSpline, double TravelSpeed);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ServerDespawnEggs();
	void ServerSpawnEggs();
	void SpawnInteractableEgg();
	void UpdateEggParticles(bool Enabled, double CurrentDistanceOnSpline, double TravelSpeed);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DeepWingLeviathan_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DeepWingLeviathan_C")
	}
	static class ABP_DeepWingLeviathan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeepWingLeviathan_C>();
	}
};
DUMPER7_ASSERTS_ABP_DeepWingLeviathan_C;

SDK_NAMESPACE_END
