#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_DA_WeatherBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "F_GlobalWeatherSettings_structs.hpp"
#include "F_CloudLayersSettings_structs.hpp"
#include "UWEWeather_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DA_WeatherBase.BP_DA_WeatherBase_C
// 0x344A2F88 (0x344A3000 - 0x0078)
class alignas(0x344A3000) UBP_DA_WeatherBase_C final : public UUWEWeatherTypeBase
{
public:
	bool                                          bThunder;                                          // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFloatInterval                         Thunder_Frequency;                                 // 0x007C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLightningStrikes;                                 // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        Lightning_visibility_chance;                       // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_CloudLayersSettings                 CloudsSettings;                                    // 0x0090(0x0200)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_GlobalWeatherSettings               GlobalWeatherSettings;                             // 0x0290(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RainAmount;                                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DA_WeatherBase_C">();
	}
	static class UBP_DA_WeatherBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DA_WeatherBase_C>();
	}
};

}

