#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EquippableBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_EquippableBase.BP_EquippableBase_C.UseLeaderPose
// 0x0001 (0x0001 - 0x0000)
struct BP_EquippableBase_C_UseLeaderPose final
{
public:
	bool                                          bSetParentAsLeaderPose;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EquippableBase_C_UseLeaderPose;

// Function BP_EquippableBase.BP_EquippableBase_C.GetCharacterMorphNameFromTag
// 0x0058 (0x0058 - 0x0000)
struct BP_EquippableBase_C_GetCharacterMorphNameFromTag final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class FName                                   MorphName;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EquippableBase_C_GetCharacterMorphNameFromTag;

// Function BP_EquippableBase.BP_EquippableBase_C.ExecuteUbergraph_BP_EquippableBase
// 0x0028 (0x0028 - 0x0000)
struct BP_EquippableBase_C_ExecuteUbergraph_BP_EquippableBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFirstEquip;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           K2Node_Event_OldEquippedByActor;                   // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_SN2PlayerCharacter_C*               K2Node_DynamicCast_AsBP_SN2Player_Character;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EquippableBase_C_ExecuteUbergraph_BP_EquippableBase;

// Function BP_EquippableBase.BP_EquippableBase_C.ConfigureMorphTargets
// 0x0048 (0x0048 - 0x0000)
struct BP_EquippableBase_C_ConfigureMorphTargets final
{
public:
	class ASN2PlayerCharacter*                    SN2PlayerCharacter;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetCosmeticTagsForPart_ReturnValue;       // 0x0008(0x0020)()
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCharacterMorphNameFromTag_MorphName;   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EquippableBase_C_ConfigureMorphTargets;

// Function BP_EquippableBase.BP_EquippableBase_C.ConfigureLeaderPose
// 0x0010 (0x0010 - 0x0000)
struct BP_EquippableBase_C_ConfigureLeaderPose final
{
public:
	class ACharacter*                             LeaderMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseLeaderPose_bSetParentAsLeaderPose;     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EquippableBase_C_ConfigureLeaderPose;

// Function BP_EquippableBase.BP_EquippableBase_C.ClearMorphTargets
// 0x0001 (0x0001 - 0x0000)
struct BP_EquippableBase_C_ClearMorphTargets final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EquippableBase_C_ClearMorphTargets;

// Function BP_EquippableBase.BP_EquippableBase_C.BPOnUnequipped
// 0x0008 (0x0008 - 0x0000)
struct BP_EquippableBase_C_BPOnUnequipped final
{
public:
	const class AActor*                           OldEquippedByActor;                                // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EquippableBase_C_BPOnUnequipped;

// Function BP_EquippableBase.BP_EquippableBase_C.BPOnEquipped
// 0x0001 (0x0001 - 0x0000)
struct BP_EquippableBase_C_BPOnEquipped final
{
public:
	bool                                          bFirstEquip;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EquippableBase_C_BPOnEquipped;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
