#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_EyeballSponge_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EyeballSponge_Base.BP_EyeballSponge_Base_C
// 0x344A2D38 (0x344A3000 - 0x02C8)
#pragma pack(push, 0x1)
class alignas(0x344A3000) ABP_EyeballSponge_Base_C : public AUWEGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   KnifeableCapA;                                     // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   InteriorA;                                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MainMesh;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           LidsToReplaceWithBPs;                              // 0x02F0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	double                                        ChanceToDestroyEachCap;                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddLidsToList();
	void EitherDestroyCapOrReplaceWithBreakable(class USceneComponent* Fake_Cap_Mesh);
	void ExecuteUbergraph_BP_EyeballSponge_Base(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EyeballSponge_Base_C">();
	}
	static class ABP_EyeballSponge_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EyeballSponge_Base_C>();
	}
};
#pragma pack(pop)

}

