#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Exterior_Interior_VolumetricScatteringIntensity_Fader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Exterior_Interior_VolumetricScatteringIntensity_Fader.BP_Exterior_Interior_VolumetricScatteringIntensity_Fader_C
// 0x344A2D50 (0x344A3000 - 0x02B0)
class alignas(0x344A3000) ABP_Exterior_Interior_VolumetricScatteringIntensity_Fader_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Fade_Alpha_3D169A154522DEBA72DC4196215F2C95;       // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Fade__Direction_3D169A154522DEBA72DC4196215F2C95;  // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Fade;                                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        InteriorVolumetricScatteringIntensity;             // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ExteriorVolumetricScatteringIntensity;             // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ALight*>                         Lights;                                            // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class UBoxComponent*>                  BoxCollisions;                                     // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class USphereComponent*>               SphereCollisions;                                  // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UCapsuleComponent*>              CapsuleCollisions;                                 // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class AActor*>                         Actors_with_interface;                             // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ULightComponent*>                CachedLightComponents;                             // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void EndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_BP_Exterior_Interior_VolumetricScatteringIntensity_Fader(int32 EntryPoint);
	void Fade__FinishedFunc();
	void Fade__UpdateFunc();
	void GetLightComponents(TArray<class ULightComponent*>* LightComponents);
	bool IsOverlappingAnyOtherComponent(class AActor* Actor);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Exterior_Interior_VolumetricScatteringIntensity_Fader_C">();
	}
	static class ABP_Exterior_Interior_VolumetricScatteringIntensity_Fader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Exterior_Interior_VolumetricScatteringIntensity_Fader_C>();
	}
};

}

