#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_FloatingLocker_Carryable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWECarryable_classes.hpp"
#include "UWEVolumeTracker_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FloatingLocker_Carryable.BP_FloatingLocker_Carryable_C
// 0x344A2C60 (0x344A3000 - 0x03A0)
class alignas(0x344A3000) ABP_FloatingLocker_Carryable_C final : public AUWECarryableActorPowered
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_Glintable_C*                       BPC_Glintable;                                     // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FloatingLocker_01_Lid_Emissive;                 // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USN2SustainedHoverComponent*            SN2SustainedHover;                                 // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FloatingLocker_01_Handles;                      // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FloatingLocker_01_Lid;                          // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FloatingLocker_01;                              // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SKM_FloatingLocker_01;                             // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEInventoryInteractionComponent*      UWEInventoryInteraction;                           // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USN2HighlightComponent*                 SN2InteractHighlight;                              // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USN2DeconstructableComponent*           SN2Deconstructable;                                // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEInventoryComponent*                 UWEInventory;                                      // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_FloatingLocker_Carryable_CarryableRootComponent_K2Node_ComponentBoundEvent_0_OnAttachmentChanged__DelegateSignature();
	bool CanBeDeconstructed(struct FGameplayTag* CantDeconstructReason);
	void ExecuteUbergraph_BP_FloatingLocker_Carryable(int32 EntryPoint);
	bool GetDeconstructCostOverride(TArray<struct FUWESculpturalBaseCellCost>* Costs);
	bool IsPickupDisabled(class AActor* FromActor, const struct FHitResult& HitResult);
	void PreDeconstruct(class ASN2BuilderTool* BuilderTool);
	void ReceiveBeginPlay();
	bool ShouldDeconstructInstantly();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FloatingLocker_Carryable_C">();
	}
	static class ABP_FloatingLocker_Carryable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FloatingLocker_Carryable_C>();
	}
};

}

