#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_FloatingLocker_Deprecated

#include "Basic.hpp"

#include "UWEInventory_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FloatingLocker_Deprecated.BP_FloatingLocker_Deprecated_C
// 0x344A2C84 (0x344A303C - 0x03B8)
class alignas(0x344A303C) ABP_FloatingLocker_Deprecated_C final : public AUWEBaseItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget_Rear;                                       // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWERestoreRotationComponent*           UWERestoreRotation;                                // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEInventoryInteractionComponent*      UWEInventoryInteraction;                           // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESaveComponent*                      UWESave;                                           // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEInventoryComponent*                 UWEInventory;                                      // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   FloatingLockerDefaultText;                         // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FloatingLockerPersistentText;                      // 0x0408(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, SaveGame, RepNotify)
	int32                                         Index_0;                                           // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<int32, class ABP_FloatingLocker_Deprecated_C*> FloatingLockerMap;                           // 0x0420(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ABP_FloatingLocker_Deprecated_C*> ExistingLockers;                                  // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void DelayedSetText();
	void DetermineIndex();
	void ExecuteUbergraph_BP_FloatingLocker_Deprecated(int32 EntryPoint);
	bool IsPickupDisabled(class AActor* FromActor, const struct FHitResult& HitResult);
	void OnRep_FloatingLockerPersistentText();
	void ReceiveBeginPlay();
	void SetWidgetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FloatingLocker_Deprecated_C">();
	}
	static class ABP_FloatingLocker_Deprecated_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FloatingLocker_Deprecated_C>();
	}
};

}

