#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_FloatingBaseSupport

#include "Basic.hpp"

#include "UWESculpturalBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FloatingBaseSupport.BP_FloatingBaseSupport_C
// 0x344A2CC8 (0x344A3000 - 0x0338)
class alignas(0x344A3000) ABP_FloatingBaseSupport_C final : public AUWEFloatingBaseSupport
{
public:
	class UStaticMeshComponent*                   UnsupportedIndicatorCube;                          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementAnchor*                    UWEPlacementAnchor;                                // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicOverlayMaterial;                            // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FloatingBaseSupport_C">();
	}
	static class ABP_FloatingBaseSupport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FloatingBaseSupport_C>();
	}
};

}

