#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_FreeBuildPlayerStart

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FreeBuildPlayerStart.BP_FreeBuildPlayerStart_C.ExecuteUbergraph_BP_FreeBuildPlayerStart
// 0x0018 (0x0018 - 0x0000)
struct BP_FreeBuildPlayerStart_C_ExecuteUbergraph_BP_FreeBuildPlayerStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class APawn*                                  K2Node_Event_PlayerPawn;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWEGameConfigComponent*                CallFunc_GetGameConfig_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BP_FreeBuildPlayerStart.BP_FreeBuildPlayerStart_C.OnStartConditionsApplied
// 0x0008 (0x0008 - 0x0000)
struct BP_FreeBuildPlayerStart_C_OnStartConditionsApplied final
{
public:
	class APawn*                                  PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

