#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Flashlight

#include "Basic.hpp"

#include "UWESaveSystem_structs.hpp"


namespace SDK::Params
{

// Function BP_Flashlight.BP_Flashlight_C.BPOnEquipVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_Flashlight_C_BPOnEquipVisibilityChanged final
{
public:
	bool                                          bNewVisible;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Flashlight.BP_Flashlight_C.ExecuteUbergraph_BP_Flashlight
// 0x0008 (0x0008 - 0x0000)
struct BP_Flashlight_C_ExecuteUbergraph_BP_Flashlight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewIsOn;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewVisible;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Flashlight.BP_Flashlight_C.OnUpgradeSaveData
// 0x0008 (0x0008 - 0x0000)
struct BP_Flashlight_C_OnUpgradeSaveData final
{
public:
	int32                                         InSaveDataVersion;                                 // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUWESaveDataUpgradeResult                     ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Flashlight.BP_Flashlight_C.SetIsOn
// 0x0001 (0x0001 - 0x0000)
struct BP_Flashlight_C_SetIsOn final
{
public:
	bool                                          NewIsOn;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

