#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Fabricator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Subnautica2_classes.hpp"
#include "UWECrafting_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Fabricator.BP_Fabricator_C
// 0x344A2C38 (0x344A3000 - 0x03C8)
class alignas(0x344A3000) ABP_Fabricator_C : public ASN2Fabricator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USN2InputDecelerateTarget*              SN2InputDecelerateTarget;                          // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAttachableComponent*                UWEAttachable;                                     // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementAnchor*                    UWEPlacementAnchor;                                // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Fabricator_PoweredApplianceComponent_K2Node_ComponentBoundEvent_0_OnPoweredStateChanged__DelegateSignature(bool NewIsPowered);
	void BndEvt__BP_Fabricator_UWEAttachable_K2Node_ComponentBoundEvent_2_OnAttached__DelegateSignature(class AActor* AttachedTo);
	void CustomEvent();
	void ExecuteUbergraph_BP_Fabricator(int32 EntryPoint);
	struct FInteractionInfo GetInteractionInfo(class AActor* HoverActor, class AActor* ForActor, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);
	void HasPlayersNeaby(bool* Result);
	void InteractClient(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	bool IsInteractDisabled(class AActor* HoverActor, class AActor* ForActor, float Distance, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);
	void IsPowered(bool* Powered);
	void OnPoweredStateChanged();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Fabricator_C">();
	}
	static class ABP_Fabricator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Fabricator_C>();
	}
};

}

