#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Flares

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "UWEEquipment_classes.hpp"
#include "UWESaveSystem_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Flares.BP_Flares_C
// 0x0030 (0x0528 - 0x04F8)
class ABP_Flares_C final : public AUWEEnergyTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWELoopingCuesComponent*               UWELoopingCues;                                    // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAbilitySystemComponent*             UWEAbilitySystem;                                  // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            FlareStimulusEffect;                               // 0x0518(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOn;                                              // 0x0520(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBeenIgnited;                                    // 0x0521(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateGameplayCues();
	void UpdateBurning();
	void TriggerDestruction();
	void Toggle();
	void ReceiveBeginPlay();
	EUWESaveDataUpgradeResult OnUpgradeSaveData(const int32 InSaveDataVersion);
	void OnRep_IsOn();
	void OnRep_Extinguished();
	void OnDropped();
	bool IsPickupDisabled(class AActor* FromActor, const struct FHitResult& HitResult);
	void Ignite();
	void Extinguish();
	void ExecuteUbergraph_BP_Flares(int32 EntryPoint);
	void BPOnHolstered(const class AActor* OldEquippedByActor);
	void BPOnEquipVisibilityChanged(bool bNewVisible);
	void BPOnEquipped(bool bFirstEquip);

	void IsExtinguished(bool* Extinguished) const;
	void IsEnergyEmpty(bool* IsEmpty) const;
	void GetBurnTime(double* Time) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Flares_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Flares_C")
	}
	static class ABP_Flares_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Flares_C>();
	}
};
DUMPER7_ASSERTS_ABP_Flares_C;

SDK_NAMESPACE_END
