#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Flashlight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "UWEEquipment_classes.hpp"
#include "UWESaveSystem_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Flashlight.BP_Flashlight_C
// 0x0038 (0x0530 - 0x04F8)
class ABP_Flashlight_C final : public AUWEEnergyTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_ToolBatteryMesh_C*                 BPC_ToolBatteryMesh;                               // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAbilitySystemComponent*             UWEAbilitySystem;                                  // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEStimulusSystemComponent*            UWEStimulusSystem;                                 // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            StimulusEffect;                                    // 0x0520(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOn;                                              // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetIsOn(bool NewIsOn);
	EUWESaveDataUpgradeResult OnUpgradeSaveData(const int32 InSaveDataVersion);
	void ExecuteUbergraph_BP_Flashlight(int32 EntryPoint);
	void BPOnEquipVisibilityChanged(bool bNewVisible);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Flashlight_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Flashlight_C")
	}
	static class ABP_Flashlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Flashlight_C>();
	}
};
DUMPER7_ASSERTS_ABP_Flashlight_C;

SDK_NAMESPACE_END
