#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Fins

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_EquippableBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Fins.BP_Fins_C
// 0x0060 (0x0488 - 0x0428)
class ABP_Fins_C : public ABP_EquippableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Fins_C;                          // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SKM_Fins;                                          // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SKM_Fins_Boots;                                    // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Tag_Container;                                     // 0x0448(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Equipped;                                          // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnEquippedOnLand;                                  // 0x0470(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAbilityAsync_WaitGameplayTagCountChanged* Async_Action;                                   // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateVisbility();
	void TagCountChanged_FBB279504576913021BBF5B05F6C47CB(int32 TagCount);
	void ExecuteUbergraph_BP_Fins(int32 EntryPoint);
	void EquipperOnLand(bool* OnLand);
	void BPOnUnequipped(const class AActor* OldEquippedByActor);
	void BPOnEquipped(bool bFirstEquip);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Fins_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Fins_C")
	}
	static class ABP_Fins_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Fins_C>();
	}
};
DUMPER7_ASSERTS_ABP_Fins_C;

SDK_NAMESPACE_END
