#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FourEye

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SN2AISmallFish_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_FourEye.BP_FourEye_C
// 0x0040 (0x0530 - 0x04F0)
class ABP_FourEye_C final : public ABP_SN2AISmallFish_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_FourEye_C;                       // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Trail;                                             // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_CreatureAnimationComponent_C*      BPC_CreatureAnimationComponent;                    // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Trail1;                                            // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEStimulusSystemComponent*            UWEStimulusSystem;                                 // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         TrailVFX;                                          // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FourEye(int32 EntryPoint);
	void HideSkeletalMesh();
	bool IsPickupDisabled(class AActor* FromActor, const struct FHitResult& HitResult);
	void ReceiveBeginPlay();
	void ShowSkeletalMesh();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FourEye_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FourEye_C")
	}
	static class ABP_FourEye_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FourEye_C>();
	}
};
DUMPER7_ASSERTS_ABP_FourEye_C;

SDK_NAMESPACE_END
