#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_FlashFish_Held

#include "Basic.hpp"

#include "UWEInventory_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FlashFish_Held.BP_FlashFish_Held_C
// 0x344A2C48 (0x344A3000 - 0x03B8)
class alignas(0x344A3000) ABP_FlashFish_Held_C final : public AUWEBaseItem
{
public:
	class UPointLightComponent*                   PointLight_Ambient;                                // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Flashfish_01_Bulb;                              // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESkeletalMeshComponentManaged*       UWESkeletalMeshComponentManaged;                   // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FlashFish_Held_C">();
	}
	static class ABP_FlashFish_Held_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FlashFish_Held_C>();
	}
};

}

