#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Fins

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_EquippableBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Fins.BP_Fins_C
// 0x344A2BD8 (0x344A3000 - 0x0428)
class alignas(0x344A3000) ABP_Fins_C : public ABP_EquippableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Fins_C;                          // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SKM_Fins;                                          // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SKM_Fins_Boots;                                    // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Tag_Container;                                     // 0x0448(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Equipped;                                          // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnEquippedOnLand;                                  // 0x0470(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAbilityAsync_WaitGameplayTagCountChanged* Async_Action;                                   // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnEquipped(bool bFirstEquip);
	void BPOnUnequipped(const class AActor* OldEquippedByActor);
	void EquipperOnLand(bool* OnLand);
	void ExecuteUbergraph_BP_Fins(int32 EntryPoint);
	void TagCountChanged_FBB279504576913021BBF5B05F6C47CB(int32 TagCount);
	void UpdateVisbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Fins_C">();
	}
	static class ABP_Fins_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Fins_C>();
	}
};

}

