#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_GatewaySpire_01b

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_GatewaySpire_Booster_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GatewaySpire_01b.BP_GatewaySpire_01b_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_GatewaySpire_01b_C final : public ABP_GatewaySpire_Booster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_GatewaySpire_01b_C;              // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEFMODAudioComponent*                 sfx_gateway_spire_hum_loop;                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GatewaySpire_01a;                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GatewaySpire_Stalk_01a;                         // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GatewaySpire_01d;                               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GatewaySpire_01c1;                              // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GatewaySpire_Stalk_01e;                         // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GatewaySpire_01b(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GatewaySpire_01b_C">();
	}
	static class ABP_GatewaySpire_01b_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GatewaySpire_01b_C>();
	}
};

}

