#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_GenericPowerGenerator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GenericPowerGenerator.BP_GenericPowerGenerator_C
// 0x344A2D53 (0x344A3003 - 0x02B0)
#pragma pack(push, 0x1)
class alignas(0x344A3003) ABP_GenericPowerGenerator_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEPowerGeneratorComponent*            UWEPowerGenerator;                                 // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAttachableComponent*                UWEAttachable;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<class UUWEPowerNodeComponent*, class UNiagaraComponent*> EmitterMap;                        // 0x02D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        PowerGeneration;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_PowerTransmitter_UWEAttachable_K2Node_ComponentBoundEvent_2_OnAttached__DelegateSignature(class AActor* AttachedTo);
	void ExecuteUbergraph_BP_GenericPowerGenerator(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GenericPowerGenerator_C">();
	}
	static class ABP_GenericPowerGenerator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GenericPowerGenerator_C>();
	}
};
#pragma pack(pop)

}

