#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_GenericManualActivation_LevelSequence

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWESequence_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GenericManualActivation_LevelSequence.BP_GenericManualActivation_LevelSequence_C
// 0x344A2C90 (0x344A3000 - 0x0370)
#pragma pack(push, 0x1)
class alignas(0x344A3000) ABP_GenericManualActivation_LevelSequence_C : public AUWESerializedLevelSequenceActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEStoryGoal*                          StorygoalToUnlockOnCompletion;                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          RequiredStoryGoalToFire;                           // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CanBeRetriggered;                                  // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBeenTriggered;                                  // 0x0389(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnCompleted;                                       // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          RestoreStateAfterCompletion;                       // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasCompleted;                                      // 0x03A1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateSequence();
	void ExecuteUbergraph_BP_GenericManualActivation_LevelSequence(int32 EntryPoint);
	void IsSequenceActive(bool* Active_);
	void OnStop_Event();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GenericManualActivation_LevelSequence_C">();
	}
	static class ABP_GenericManualActivation_LevelSequence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GenericManualActivation_LevelSequence_C>();
	}
};
#pragma pack(pop)

}

