#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_HydroelectricTurbine_GhostCustomizer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PowerConnection_GhostCustomizer_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HydroelectricTurbine_GhostCustomizer.BP_HydroelectricTurbine_GhostCustomizer_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_HydroelectricTurbine_GhostCustomizer_C final : public ABP_PowerConnection_GhostCustomizer_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_Text_WidgetComponent_C*            BPC_Text_WidgetComponent;                          // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          WorldForceOverlap;                                 // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        GenerationWithNoCurrent;                           // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GenerationWithCurrent;                             // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_HydroelectricTurbine_GhostCustomizer_WorldForceOverlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_HydroelectricTurbine_GhostCustomizer(int32 EntryPoint);
	void UpdateMeshes(const struct FSN2GhostPlacement& Placement);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HydroelectricTurbine_GhostCustomizer_C">();
	}
	static class ABP_HydroelectricTurbine_GhostCustomizer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HydroelectricTurbine_GhostCustomizer_C>();
	}
};

}

