#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_InitialCorridorCustomizer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Subnautica2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InitialCorridorCustomizer.BP_InitialCorridorCustomizer_C
// 0x344A2D38 (0x344A3000 - 0x02C8)
class alignas(0x344A3000) ABP_InitialCorridorCustomizer_C final : public ASN2GhostCustomizer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      SupportBeam1;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SupportBeam;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_SupportCheck_C*                    BPC_SupportCheck1;                                 // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_SupportCheck_C*                    BPC_SupportCheck;                                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InitialCorridorCustomizer(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UpdateMeshes(const struct FSN2GhostPlacement& Placement);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InitialCorridorCustomizer_C">();
	}
	static class ABP_InitialCorridorCustomizer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InitialCorridorCustomizer_C>();
	}
};

}

