#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Light_Wall_Large

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_LampBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Light_Wall_Large.BP_Light_Wall_Large_C
// 0x0000 (0x344A3006 - 0x344A3006)
class ABP_Light_Wall_Large_C final : public ABP_LampBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Light_Wall_Large_C;              // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight;                                         // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementAnchor*                    UWEPlacementAnchor;                                // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   lamp;                                              // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        LightIntensity_Powered;                            // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightIntensity_Unpowered;                          // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_LampWallBulb_UWEPoweredAppliance_K2Node_ComponentBoundEvent_1_OnPoweredStateChanged__DelegateSignature(bool NewIsPowered);
	void ExecuteUbergraph_BP_Light_Wall_Large(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UpdatePowerState(bool IsPowered);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Light_Wall_Large_C">();
	}
	static class ABP_Light_Wall_Large_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Light_Wall_Large_C>();
	}
};

}

