#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Locker_Floor

#include "Basic.hpp"

#include "Subnautica2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Locker_Floor.BP_Locker_Floor_C
// 0x344A2D10 (0x344A3000 - 0x02F0)
class alignas(0x344A3000) ABP_Locker_Floor_C final : public ASN2Locker
{
public:
	class UStaticMeshComponent*                   SM_Locker_Floor_A_Emissive;                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       LabelWidget;                                       // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEUGCComponent*                       UWEUGC;                                            // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_LockerLabel_C*                     BPC_LockerLabel;                                   // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Locker_Floor_C">();
	}
	static class ABP_Locker_Floor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Locker_Floor_C>();
	}
};

}

