#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Locker_Floor

#include "Basic.hpp"

#include "Subnautica2_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Locker_Floor.BP_Locker_Floor_C
// 0x0030 (0x0320 - 0x02F0)
class ABP_Locker_Floor_C final : public ASN2Locker
{
public:
	class UStaticMeshComponent*                   SM_Locker_Floor_A_Emissive;                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       LabelWidget;                                       // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEUGCComponent*                       UWEUGC;                                            // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_LockerLabel_C*                     BPC_LockerLabel;                                   // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPlacementVolumeComponent*           UWEPlacementVolume;                                // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Locker_Floor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Locker_Floor_C")
	}
	static class ABP_Locker_Floor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Locker_Floor_C>();
	}
};
DUMPER7_ASSERTS_ABP_Locker_Floor_C;

SDK_NAMESPACE_END
