#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MPC_ScalabilityLinker

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_MPC_ScalabilityLinker.BP_MPC_ScalabilityLinker_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_MPC_ScalabilityLinker_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_MPC_ScalabilityLinker_C_ReceiveTick;

// Function BP_MPC_ScalabilityLinker.BP_MPC_ScalabilityLinker_C.ExecuteUbergraph_BP_MPC_ScalabilityLinker
// 0x0010 (0x0010 - 0x0000)
struct BP_MPC_ScalabilityLinker_C_ExecuteUbergraph_BP_MPC_ScalabilityLinker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentViewDistanceScale_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_MPC_ScalabilityLinker_C_ExecuteUbergraph_BP_MPC_ScalabilityLinker;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
