#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_NarrativeSignal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NarrativeSignal.BP_NarrativeSignal_C
// 0x344A2D50 (0x344A3000 - 0x02B0)
class alignas(0x344A3000) ABP_NarrativeSignal_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWESaveComponent*                      UWESave;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Ping;                                              // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          StoryGoal;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   SignalText;                                        // 0x02E0(0x0010)(Edit, BlueprintVisible)
	class UUWEPingData*                           Ping_Data;                                         // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          RemoveOnStoryGoal;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUWEStoryGoal*                          HideSignalOnStoryGoal;                             // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NarrativeSignal(int32 EntryPoint);
	void OnUnlocked_62920D1448BD71509596E5B554437304();
	void OnUnlocked_798D037D414E64E523303188A5B43EF4();
	void OnUnlocked_DD1B37CE44DE0D7179F153871FC8B746();
	void ReceiveBeginPlay();
	void RemovePing();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NarrativeSignal_C">();
	}
	static class ABP_NarrativeSignal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NarrativeSignal_C>();
	}
};

}

