#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_OxygenBubble

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Subnautica2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OxygenBubble.BP_OxygenBubble_C
// 0x344A2CB0 (0x344A3000 - 0x0350)
class alignas(0x344A3000) ABP_OxygenBubble_C final : public ASN2OxygenBubble
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEFMODAudioComponent*                 sfx_bubble_loop;                                   // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SquashStretch_NewTrack_0_226B0F8B4460690AC2E9C9BCF5B8DBEA; // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SquashStretch__Direction_226B0F8B4460690AC2E9C9BCF5B8DBEA; // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     SquashStretch;                                     // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnBeginAscend();
	void BP_OnPopped(const class ASN2PlayerCharacter* Player);
	void ExecuteUbergraph_BP_OxygenBubble(int32 EntryPoint);
	void Pop_Old();
	void SquashStretch__FinishedFunc();
	void SquashStretch__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OxygenBubble_C">();
	}
	static class ABP_OxygenBubble_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OxygenBubble_C>();
	}
};

}

