#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_OR_PowerPlant_ControlRoomTerminal_NeedleAlignment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SimpleButton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OR_PowerPlant_ControlRoomTerminal_NeedleAlignment.BP_OR_PowerPlant_ControlRoomTerminal_NeedleAlignment_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_OR_PowerPlant_ControlRoomTerminal_NeedleAlignment_C final : public ABP_SimpleButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_OR_PowerPlant_ControlRoomTerminal_NeedleAlignment_C; // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEFMODAudioComponent*                 axum_console_loop_B;                               // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_AxumVisibilityComponent_C*         BPC_AxumVisibilityComponent;                       // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_ScreenBackground;                              // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         AxumButtonMaterialSlot;                            // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     OffMaterial;                                       // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_OR_PowerPlant_ControlRoom_Upper_C*  UpperControlStation;                               // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         AxumScreenMaterialSlot;                            // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterial*                              OnMaterial;                                        // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OR_PowerPlant_ControlRoomTerminal_NeedleAlignment(int32 EntryPoint);
	bool IsInteractDisabled(class AActor* HoverActor, class AActor* ForActor, float Distance, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);
	void OnButtonPressed();
	void OnLayerToggled_Event(bool NewLayerVisibility);
	void OnUnlocked_97912D184E365C114BE869AC7E212396();
	void OnUnlocked_B18CBAB34126A4DE881D99B7850826F8();
	void OnUnlocked_CCD8A84046CF8DACB83231A39608F3E5();
	void ReceiveBeginPlay();
	void UpdateButtonVisuals(bool Silently, const struct FF_GenericButtonStateData& InData);
	void UpdateTerminalState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OR_PowerPlant_ControlRoomTerminal_NeedleAlignment_C">();
	}
	static class ABP_OR_PowerPlant_ControlRoomTerminal_NeedleAlignment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OR_PowerPlant_ControlRoomTerminal_NeedleAlignment_C>();
	}
};

}

