#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_OR_AB01_Planter_01A

#include "Basic.hpp"

#include "BP_Scannable_BaseClass_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OR_AB01_Planter_01A.BP_OR_AB01_Planter_01A_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_OR_AB01_Planter_01A_C final : public ABP_Scannable_BaseClass_C
{
public:
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UInstancedStaticMeshComponent*          Actor32_InstancedStaticMeshComponent_5;            // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Planter_Exterior_Foot_A6_StaticMeshComponent0;  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Planter_Exterior_Foot_A8_StaticMeshComponent0;  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Planter_Exterior_Foot_A7_StaticMeshComponent0;  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Actor32_InstancedStaticMeshComponent_2;            // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Planter_Exterior_Foot_A5_StaticMeshComponent0;  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Actor32_InstancedStaticMeshComponent_0;            // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Actor32_InstancedStaticMeshComponent_3;            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Actor32_InstancedStaticMeshComponent_4;            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Actor32_InstancedStaticMeshComponent_1;            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OR_AB01_Planter_01A_C">();
	}
	static class ABP_OR_AB01_Planter_01A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OR_AB01_Planter_01A_C>();
	}
};

}

