#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_OR_PowerPlant_ControlRoom_Upper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Subnautica2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OR_PowerPlant_ControlRoom_Upper.BP_OR_PowerPlant_ControlRoom_Upper_C
// 0x344A2C30 (0x344A3000 - 0x03D0)
class alignas(0x344A3000) ABP_OR_PowerPlant_ControlRoom_Upper_C final : public ASN2PowerPlantControlRoomUpper
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Background;                                        // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_AxumVisibilityComponent_C*         BPC_AxumVisibilityComponent;                       // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USN2PowerPlantControlStationUpperViewModel* ViewModel;                                     // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_SelectGlyph_Dial_C*>         NeedleAlignmentDials;                              // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class UUWEStoryGoal*                          StoryGoalOnNeedleDialsComplete;                    // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUWEStoryGoal*>                  WorldStoryGoalsOnSuccess;                          // 0x0418(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UUWEStoryGoal*                          NarrativeRestartFailDialogue;                      // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_SelectGlyph_Dial_C*>         TurbineAlignmentDials;                             // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class UUWEStoryGoal*                          StoryGoalOnTurineDialsComplete;                    // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             FailSound;                                         // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SuccessSound;                                      // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          ActivationStorygoal;                               // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_ScreenBackground;                              // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         AxumScreenMaterialSlot;                            // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     OffMaterial;                                       // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool CanActivateCode();
	void ExecuteUbergraph_BP_OR_PowerPlant_ControlRoom_Upper(int32 EntryPoint);
	void IsNeedleAligned(bool* CompleteStatus);
	void IsTurbineAligned(bool* CompleteStatus);
	void OnCodeActivated_Event(const class AActor* TriggerActor, bool ActivationSuccess);
	void OnLayerToggled_Event(bool NewLayerVisibility);
	void OnUnlocked_74136EBB456325B3504F4A88FD52C794();
	void ReceiveBeginPlay();
	void TrySubmitNeedleAlignment();
	void TrySubmitTurbineAlignment();
	void UpdateTerminalState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OR_PowerPlant_ControlRoom_Upper_C">();
	}
	static class ABP_OR_PowerPlant_ControlRoom_Upper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OR_PowerPlant_ControlRoom_Upper_C>();
	}
};

}

