#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_OR_PowerPlant_ControlRoom_Lower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Subnautica2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OR_PowerPlant_ControlRoom_Lower.BP_OR_PowerPlant_ControlRoom_Lower_C
// 0x344A2C68 (0x344A3000 - 0x0398)
class alignas(0x344A3000) ABP_OR_PowerPlant_ControlRoom_Lower_C final : public ASN2PowerPlantControlRoomLower
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Background;                                        // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_AxumVisibilityComponent_C*         BPC_AxumVisibilityComponent;                       // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USN2PowerPlantControlStationLowerViewModel* ViewModel;                                     // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          ActivationStorygoal;                               // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_ScreenBackground;                              // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         AxumScreenMaterialSlot;                            // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     OffMaterial;                                       // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OR_PowerPlant_ControlRoom_Lower(int32 EntryPoint);
	void LaunchNeedle_BP(bool Success);
	void OnLayerToggled_Event(bool NewLayerVisibility);
	void OnUnlocked_0203A0104C497E8CB0DCE7BD4D6A5C8C();
	void ReceiveBeginPlay();
	void UpdateTerminalState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OR_PowerPlant_ControlRoom_Lower_C">();
	}
	static class ABP_OR_PowerPlant_ControlRoom_Lower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OR_PowerPlant_ControlRoom_Lower_C>();
	}
};

}

