#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_OxygenBubble

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_OxygenBubble.BP_OxygenBubble_C.BP_OnPopped
// 0x0008 (0x0008 - 0x0000)
struct BP_OxygenBubble_C_BP_OnPopped final
{
public:
	const class ASN2PlayerCharacter*              Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_OxygenBubble.BP_OxygenBubble_C.ExecuteUbergraph_BP_OxygenBubble
// 0x00E8 (0x00E8 - 0x0000)
struct BP_OxygenBubble_C_ExecuteUbergraph_BP_OxygenBubble final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	const class ASN2PlayerCharacter*              K2Node_Event_Player;                               // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0010(0x00D8)(ContainsInstancedReference)
};

}

