#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OxygenBubble

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Subnautica2_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_OxygenBubble.BP_OxygenBubble_C
// 0x0038 (0x0388 - 0x0350)
class ABP_OxygenBubble_C final : public ASN2OxygenBubble
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEFMODAudioComponent*                 sfx_bubble_loop;                                   // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SquashStretch_NewTrack_0_226B0F8B4460690AC2E9C9BCF5B8DBEA; // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SquashStretch__Direction_226B0F8B4460690AC2E9C9BCF5B8DBEA; // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SquashStretch;                                     // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void SquashStretch__UpdateFunc();
	void SquashStretch__FinishedFunc();
	void Pop_Old();
	void ExecuteUbergraph_BP_OxygenBubble(int32 EntryPoint);
	void BP_OnPopped(const class ASN2PlayerCharacter* Player);
	void BP_OnBeginAscend();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_OxygenBubble_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_OxygenBubble_C")
	}
	static class ABP_OxygenBubble_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OxygenBubble_C>();
	}
};
DUMPER7_ASSERTS_ABP_OxygenBubble_C;

SDK_NAMESPACE_END
