#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OR_AB01_Room_03_Secondary

#include "Basic.hpp"

#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_OR_AB01_Room_03_Secondary.BP_OR_AB01_Room_03_Secondary_C
// 0x0070 (0x0320 - 0x02B0)
class ABP_OR_AB01_Room_03_Secondary_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Decal_AbandonedBase_Room_Exterior_TopEdge_B18_StaticMeshComponent0; // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Decal_AbandonedBase_Room_Exterior_TopEdge_B24_StaticMeshComponent0; // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Decal_AbandonedBase_Room_Exterior_TopEdge_B4_StaticMeshComponent0; // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Decal_AbandonedBase_Room_Exterior_LowerCorner_A2_StaticMeshComponent0; // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        MI_Basebuilding_Decals5_NewDecalComponent;         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Roof_Cylinder_A3_StaticMeshComponent0;          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Wall_Vent_B5_StaticMeshComponent0;              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Wall_Vent_B6_StaticMeshComponent0;              // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Wall_Vent_A4_StaticMeshComponent0;              // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Roof_Panel_A3_StaticMeshComponent0;             // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Roof_Fan_Double_A4_StaticMeshComponent0;        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Decal_AbandonedBase_Room_Exterior_TopEdge_B23_StaticMeshComponent0; // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_OR_AB01_Room_03_Secondary_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_OR_AB01_Room_03_Secondary_C")
	}
	static class ABP_OR_AB01_Room_03_Secondary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OR_AB01_Room_03_Secondary_C>();
	}
};
DUMPER7_ASSERTS_ABP_OR_AB01_Room_03_Secondary_C;

SDK_NAMESPACE_END
