#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_PCG_OR_HangingKelp_01

#include "Basic.hpp"

#include "BP_PCG_Actor_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PCG_OR_HangingKelp_01.BP_PCG_OR_HangingKelp_01_C
// 0x0085 (0x344A3085 - 0x344A3000)
class alignas(0x344A3085) ABP_PCG_OR_HangingKelp_01_C final : public ABP_PCG_Actor_C
{
public:
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UPCGComponent*                          PCG;                                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoundsSize;                                        // 0x02D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinSize;                                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxSize;                                           // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PCG_OR_HangingKelp_01_C">();
	}
	static class ABP_PCG_OR_HangingKelp_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PCG_OR_HangingKelp_01_C>();
	}
};

}

