#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PCG_OR_NeedlerNeedles

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PCG_Actor_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_PCG_OR_NeedlerNeedles.BP_PCG_OR_NeedlerNeedles_C
// 0x0050 (0x0318 - 0x02C8)
class ABP_PCG_OR_NeedlerNeedles_C final : public ABP_PCG_Actor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       PathSpline;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPCGComponent*                          PCG;                                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Spread;                                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinScale;                                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxScale;                                          // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TiltJitter;                                        // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Density;                                           // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ForceZOffset;                                      // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TagSplines();
	void ExecuteUbergraph_BP_PCG_OR_NeedlerNeedles(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PCG_OR_NeedlerNeedles_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PCG_OR_NeedlerNeedles_C")
	}
	static class ABP_PCG_OR_NeedlerNeedles_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PCG_OR_NeedlerNeedles_C>();
	}
};
DUMPER7_ASSERTS_ABP_PCG_OR_NeedlerNeedles_C;

SDK_NAMESPACE_END
