#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_PowerPlantActivate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_GenericManualActivation_LevelSequence_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PowerPlantActivate.BP_PowerPlantActivate_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_PowerPlantActivate_C final : public ABP_GenericManualActivation_LevelSequence_C
{
public:
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PowerPlantActivate_C;            // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          LightsActivated;                                   // 0x03B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VFX_Activated;                                     // 0x03B1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2[0x2];                                      // 0x03B2(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           VFX_Actor_Data_Group_Id_0;                         // 0x03B4(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StaticMesh_Actor_Data_Group_Id_0;                  // 0x03BC(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           LightActor_Actor_Data_Group_Id_0;                  // 0x03C4(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateLights();
	void ActivateVFX();
	void ExecuteUbergraph_BP_PowerPlantActivate(int32 EntryPoint);
	void OnUnlocked_3A771FEF45B1695647BEF8A1E21897CB();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PowerPlantActivate_C">();
	}
	static class ABP_PowerPlantActivate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PowerPlantActivate_C>();
	}
};

}

