#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_PowerConnectionHelper

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PowerConnectionHelper.BP_PowerConnectionHelper_C.DisableProximityConnection
// 0x0010 (0x0010 - 0x0000)
struct BP_PowerConnectionHelper_C_DisableProximityConnection final
{
public:
	class UUWEPowerNodeComponent*                 PowerNode;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PowerConnectionHelper.BP_PowerConnectionHelper_C.RecheckProximityConnection
// 0x0020 (0x0020 - 0x0000)
struct BP_PowerConnectionHelper_C_RecheckProximityConnection final
{
public:
	class UUWEPowerNodeComponent*                 PowerNode;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 AttachedTo;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetProximityTransmissionEnabled_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

