#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerCinematicCharacter

#include "Basic.hpp"

#include "UWEPlayerCustomization_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_PlayerCinematicCharacter.BP_PlayerCinematicCharacter_C.GetMeshForPart
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerCinematicCharacter_C_GetMeshForPart final
{
public:
	EUWEPlayerCustomizationPartType               PartType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PlayerCinematicCharacter_C_GetMeshForPart;

// Function BP_PlayerCinematicCharacter.BP_PlayerCinematicCharacter_C.ExecuteUbergraph_BP_PlayerCinematicCharacter
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerCinematicCharacter_C_ExecuteUbergraph_BP_PlayerCinematicCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PlayerCinematicCharacter_C_ExecuteUbergraph_BP_PlayerCinematicCharacter;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
