#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerDied_Blackbox_Proto

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Subnautica2_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_PlayerDied_Blackbox_Proto.BP_PlayerDied_Blackbox_Proto_C
// 0x0078 (0x0330 - 0x02B8)
class ABP_PlayerDied_Blackbox_Proto_C final : public ASN2PlayerDeathbox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Blackbox_Hologram;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh1;                                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVolumeTrackerComponent*                VolumeTracker;                                     // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEChaosPhysicsController*             UWEChaosPhysicsController;                         // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEFMODAudioComponent*                 sfx_player_died_black_box_ping_loop;               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESaveComponent*                      UWESave;                                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_Blackbox_InventoryInteractionComponent_Proto_C* BPC_Blackbox_InventoryInteractionComponent_Proto; // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  PingID;                                            // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DestroyAfterEmptySeconds;                          // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           OwningPlayerState;                                 // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          PingsEnabled;                                      // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void InitializePing();
	void ExecuteUbergraph_BP_PlayerDied_Blackbox_Proto(int32 EntryPoint);
	void BndEvt__BP_PlayerDied_Blackbox_Proto_InventoryComponent_K2Node_ComponentBoundEvent_2_OnItemRemoved__DelegateSignature(const struct FUWEInventoryItem& InventoryItem);
	void BndEvt__BP_PlayerDied_Blackbox_Proto_BPC_Blackbox_InventoryInteractionComponent_Proto_K2Node_ComponentBoundEvent_1_OnServerInteract__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlayerDied_Blackbox_Proto_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlayerDied_Blackbox_Proto_C")
	}
	static class ABP_PlayerDied_Blackbox_Proto_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerDied_Blackbox_Proto_C>();
	}
};
DUMPER7_ASSERTS_ABP_PlayerDied_Blackbox_Proto_C;

SDK_NAMESPACE_END
