#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_PowerPlantNeedleActivated_LevelSequence

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PowerPlantNeedleActivated_LevelSequence.BP_PowerPlantNeedleActivated_LevelSequence_C.ExecuteUbergraph_BP_PowerPlantNeedleActivated_LevelSequence
// 0x0048 (0x0048 - 0x0000)
struct BP_PowerPlantNeedleActivated_LevelSequence_C_ExecuteUbergraph_BP_PowerPlantNeedleActivated_LevelSequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          K2Node_CustomEvent_UnlockedStoryGoal;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_ReceivingActor;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUWEStoryGoal* UnlockedStoryGoal, class AActor* ReceivingActor)> K2Node_CreateDelegate_OutputDelegate; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoalsWorldSubsystem*           CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PowerPlantNeedleActivated_LevelSequence.BP_PowerPlantNeedleActivated_LevelSequence_C.WaitForNeedleToActivateComeOnline
// 0x0010 (0x0010 - 0x0000)
struct BP_PowerPlantNeedleActivated_LevelSequence_C_WaitForNeedleToActivateComeOnline final
{
public:
	class UUWEStoryGoal*                          UnlockedStoryGoal;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ReceivingActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

