#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_PowerPlant_FixedTurbineBlade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PowerPlant_FixedTurbineBlade.BP_PowerPlant_FixedTurbineBlade_C
// 0x344A2D50 (0x344A3000 - 0x02B0)
class alignas(0x344A3000) ABP_PowerPlant_FixedTurbineBlade_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_RepairableTurbine_Sparks_01;                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FixedTurbineBlade;                                 // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AStaticMeshActor>        TurbineHousingLights;                              // 0x02D0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UMaterialInterface*                     PostTurbineFixMaterial;                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class AActor>>          ActorsToHide;                                      // 0x0300(0x0010)(Edit, BlueprintVisible)
	class UMaterialInterface*                     DefaultMaterial;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PowerPlant_FixedTurbineBlade(int32 EntryPoint);
	void OnUnlocked_8DED1B5341E414D6BCD2C6B91609A9C5();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PowerPlant_FixedTurbineBlade_C">();
	}
	static class ABP_PowerPlant_FixedTurbineBlade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PowerPlant_FixedTurbineBlade_C>();
	}
};

}

