#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_PowerPlant_Turbine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PowerPlant_Turbine.BP_PowerPlant_Turbine_C
// 0x344A2D5E (0x344A300E - 0x02B0)
class alignas(0x344A300E) ABP_PowerPlant_Turbine_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          PowerOnlineStoryGoal;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          NeedleDropFinishedStoryGoal;                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          TurbineBladesStartupFinishedStoryGoal;             // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         LoopingTickRate;                                   // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class ANiagaraActor*                          ObservatoryGlow;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PowerPlant_Turbine(int32 EntryPoint);
	void OnUnlocked_1669CBD942C09435818BF98188B206B6();
	void OnUnlocked_2B9F430A461EFFBBAE2C3CBDFCAAAD63();
	void ReceiveBeginPlay();
	void Rotate();
	void StartRotation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PowerPlant_Turbine_C">();
	}
	static class ABP_PowerPlant_Turbine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PowerPlant_Turbine_C>();
	}
};

}

