#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_RepairTool

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEEquipment_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RepairTool.BP_RepairTool_C
// 0x344A2B08 (0x344A3000 - 0x04F8)
class alignas(0x344A3000) ABP_RepairTool_C final : public AUWEEnergyTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_ToolBatteryMesh_C*                 BPC_ToolBatteryMesh;                               // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           PlayerState;                                       // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_EmissiveStrip;                                 // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnEquipVisibilityChanged(bool bNewVisible);
	void EnergyChanged(float PercentEnergy);
	void EnergyEmpty();
	void EnergyRefilled();
	void Equipped();
	void ExecuteUbergraph_BP_RepairTool(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Unequipped();
	void UpdateHologram(ESlateVisibility InVisibility);
	void UpdateWelderOnline();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RepairTool_C">();
	}
	static class ABP_RepairTool_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RepairTool_C>();
	}
};

}

