#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_ResourceDeposit_AxumRebar

#include "Basic.hpp"

#include "UWEWorldPopulation2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ResourceDeposit_AxumRebar.BP_ResourceDeposit_AxumRebar_C
// 0x344A2D21 (0x344A3069 - 0x0348)
class alignas(0x344A3069) ABP_ResourceDeposit_AxumRebar_C final : public AUWEWorldPopResourceBaseActor
{
public:
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   E;                                                 // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   er;                                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   rebarz3;                                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   rebarz2;                                           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionStimuliSourceComponent*    AIPerceptionStimuliSource;                         // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ResourceDeposit_AxumRebar_C">();
	}
	static class ABP_ResourceDeposit_AxumRebar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ResourceDeposit_AxumRebar_C>();
	}
};

}

