#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_ResourceDeposit_Fulgurite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEWorldPopulation2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ResourceDeposit_Fulgurite.BP_ResourceDeposit_Fulgurite_C
// 0x344A2CB8 (0x344A3000 - 0x0348)
class alignas(0x344A3000) ABP_ResourceDeposit_Fulgurite_C final : public AUWEWorldPopResourceBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_ResourceBase_01a1;                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ResourceBase_01a;                               // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAbilitySystemComponent*             UWEAbilitySystem;                                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      zaps1;                                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionStimuliSourceComponent*    AIPerceptionStimuliSource;                         // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ResourceDeposit_Fulgurite(int32 EntryPoint);
	void ReceiveBeginPlay();
	void StimulusEmit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ResourceDeposit_Fulgurite_C">();
	}
	static class ABP_ResourceDeposit_Fulgurite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ResourceDeposit_Fulgurite_C>();
	}
};

}

