#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SimpleButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWETrigger_classes.hpp"
#include "F_GenericButtonStateData_structs.hpp"
#include "UWEUtilities_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_SimpleButton.BP_SimpleButton_C
// 0x01B8 (0x0528 - 0x0370)
class ABP_SimpleButton_C final : public AUWEGenericButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USN2InputDecelerateTarget*              SN2InputDecelerateTarget;                          // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Button;                                            // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   Text_Status_ON;                                    // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MinTimeButtonStaysLit;                             // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadedFromSave;                                    // 0x03A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_GenericButtonStateData              ActiveStateData;                                   // 0x03A8(0x0080)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FF_GenericButtonStateData              DefaultStateData;                                  // 0x0428(0x0080)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FF_GenericButtonStateData              DisabledStateData;                                 // 0x04A8(0x0080)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SimpleButton(int32 EntryPoint);
	void LoadVisuals();
	void OnButtonPressed();
	void OnInteractabilityToggled_Event(bool NewState);
	void OnPostDeserialize();
	void OnRep_LoadedFromSave();
	void ReceiveBeginPlay();
	void SetButtonVisuals(bool Silently, const struct FF_GenericButtonStateData& InData);
	void UpdateButtonVisuals(bool Silently, const struct FF_GenericButtonStateData& InData);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SimpleButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SimpleButton_C")
	}
	static class ABP_SimpleButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SimpleButton_C>();
	}
};
DUMPER7_ASSERTS_ABP_SimpleButton_C;

SDK_NAMESPACE_END
