#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_SelectGlyph_Dial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SimpleButton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SelectGlyph_Dial.BP_SelectGlyph_Dial_C
// 0x0000 (0x344A3000 - 0x344A3000)
#pragma pack(push, 0x1)
class alignas(0x344A3000) ABP_SelectGlyph_Dial_C : public ABP_SimpleButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SelectGlyph_Dial_C;              // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_AxumVisibilityComponent_C*         BPC_AxumVisibilityComponent;                       // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         CurentSelectionIndex;                              // 0x0540(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         TargetSelection;                                   // 0x0544(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          StoryGoalToInteract;                               // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnReachedTargetSelection;                          // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         MaxOptionCount;                                    // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstanceDynamic*               DMI_ScreenBackground;                              // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     OffMaterial;                                       // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         AxumScreenMaterialSlot;                            // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SelectGlyph_Dial(int32 EntryPoint);
	void InteractServer(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	bool IsAtTargetSelection();
	bool IsInteractDisabled(class AActor* HoverActor, class AActor* ForActor, float Distance, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);
	void OnLayerToggled_Event(bool NewLayerVisibility);
	void OnPostDeserialize();
	void OnRep_CurentSelectionIndex();
	void OnStoryGoalUnlocked_Event(class UUWEStoryGoal* UnlockedStoryGoal, class AActor* ReceivingActor);
	void ReceiveBeginPlay();
	void UpdateButtonMaterial(bool Condition);
	void UpdateGlyph();
	void UpdateInteractability();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SelectGlyph_Dial_C">();
	}
	static class ABP_SelectGlyph_Dial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SelectGlyph_Dial_C>();
	}
};
#pragma pack(pop)

}

