#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_SplineWorldForce

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEWorldForces_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SplineWorldForce.BP_SplineWorldForce_C
// 0x344A2A50 (0x344A3000 - 0x05B0)
#pragma pack(push, 0x1)
class alignas(0x344A3000) ABP_SplineWorldForce_C : public AUWESplineWorldForce
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USmartObjectComponent*                  SmartObject;                                       // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESplineAudioComponent*               UWESplineAudioWaterLoop;                           // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEFMODAudioComponent*                 FMODAudioWaterLoop;                                // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_WaterCurrent;                              // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        ParticleSpeedModifier;                             // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateParticlesTimerHandle;                        // 0x05E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AlwaysShowPlankton;                                // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        Particle_Spawn_Rate;                               // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Particle_Speed;                                    // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SplineWorldForce(int32 EntryPoint);
	void OnActiveStateChanged();
	void OnEnter(class AActor* Actor);
	void OnExit(class AActor* Actor);
	void ReceiveBeginPlay();
	void SetUpSplineCollision();
	void TryToPlayAudio(class UObject* Object, class UFMODEvent* Event);
	void UpdateNiagaraParameters();
	void UpdateParticles();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SplineWorldForce_C">();
	}
	static class ABP_SplineWorldForce_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SplineWorldForce_C>();
	}
};
#pragma pack(pop)

}

