#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Scannable_BaseClass

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Scannable_BaseClass.BP_Scannable_BaseClass_C
// 0x344A2D50 (0x344A3000 - 0x02B0)
#pragma pack(push, 0x1)
class alignas(0x344A3000) ABP_Scannable_BaseClass_C : public AActor
{
public:
	class UBPC_Glintable_C*                       BPC_Glintable;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAbilitySystemComponent*             UWEAbilitySystem;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BaseMesh;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CachedInteractionDisabled;                         // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FInteractionInfo GetInteractionInfo(class AActor* HoverActor, class AActor* ForActor, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult, class FString* ReturnValue_PrimaryText, struct FGameplayTag* ReturnValue_InteractionType, bool* ReturnValue_bHighlightTarget, struct FGameplayTag* ReturnValue_Reason, class FText* ReturnValue_TextInputOverride);
	float InteractionDistance();
	bool IsInteractDisabled(class AActor* HoverActor, class AActor* ForActor, float Distance, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Scannable_BaseClass_C">();
	}
	static class ABP_Scannable_BaseClass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Scannable_BaseClass_C>();
	}
};
#pragma pack(pop)

}

