#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Sandspear_Juvenile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SN2AILargeFish_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Sandspear_Juvenile.BP_Sandspear_Juvenile_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_Sandspear_Juvenile_C final : public ABP_SN2AILargeFish_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   LureMesh;                                          // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Sandspear_Juvenile_SandTrail_Loop;              // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereVolumeComponent*                 DetectorGrab;                                      // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEStimulusSystemComponent*            UWEStimulusSystem;                                 // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEPawnAttachmentOwner*                UWEPawnAttachmentOwner;                            // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Sandspear_Juvenile(int32 EntryPoint);
	void ToggleVisibility(bool bIsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Sandspear_Juvenile_C">();
	}
	static class ABP_Sandspear_Juvenile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Sandspear_Juvenile_C>();
	}
};

}

