#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineTentacle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_SplineTentacle.BP_SplineTentacle_C
// 0x01F0 (0x04A0 - 0x02B0)
class ABP_SplineTentacle_C final : public AActor
{
public:
	class USplineComponent*                       Spline;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Start_Mesh_Length;                                 // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Middle_Mesh_Length;                                // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        End_Mesh_Length;                                   // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebugArrows;                                   // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClosedLoop;                                        // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        StartScale;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EndScale;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfSegments;                                  // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UStaticMesh*, double>              StartMeshes;                                       // 0x02F8(0x0050)(Edit, BlueprintVisible)
	TMap<class UStaticMesh*, double>              MiddleMeshes;                                      // 0x0348(0x0050)(Edit, BlueprintVisible)
	TMap<class UStaticMesh*, double>              EndMeshes;                                         // 0x0398(0x0050)(Edit, BlueprintVisible)
	bool                                          Override_Mesh_Materials;                           // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     StartMaterial;                                     // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MiddleMaterial;                                    // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     EndMaterial;                                       // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Layer_Blend_Indices;                               // 0x0408(0x0010)(Edit, BlueprintVisible)
	int32                                         LayerIndex;                                        // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BlendIndex;                                        // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               Random_Seed;                                       // 0x0420(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class USplineMeshComponent*, struct FVector4> MeshVertData;                                 // 0x0440(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          Baked;                                             // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SplineTentacle_C*                   Self_0;                                            // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void UnBake();
	void SetVectorParamOnLayer(class UMaterialInstanceDynamic* Material_Instance_Dynamic, class FName Parameter_Name, const struct FLinearColor& Value);
	void SetUpRoll(class USplineMeshComponent* CurrentSplineMeshComponent, double CurrentSplineDistance, double MidpointSplineDistance, double NextSplineDistance);
	void SetUpMeshComponent(class USplineMeshComponent* SplineMeshComponent, class UStaticMesh* StaticMesh, class UMaterialInterface* Material, double CurrentSplineDistance, double NextSplineDistance, double CurrentTileLength);
	void SetSplineMeshRelativeRoll(const struct FRotator& RelativeRotation, double DistanceAlongSpline, double* Roll);
	void SetScalarParamOnLayer(class UMaterialInstanceDynamic* Material_Instance_Dynamic, class FName Parameter_Name, double Value);
	void ReturnSegmentMaterial(const class FString& SegmentType, class UStaticMesh* StaticMesh, class UMaterialInterface** Material, bool* Success);
	void GetRandomSegment(const TMap<class UStaticMesh*, double>& InputMap, class UStaticMesh** SegmentMesh);
	void GetBaked();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SplineTentacle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SplineTentacle_C")
	}
	static class ABP_SplineTentacle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SplineTentacle_C>();
	}
};
DUMPER7_ASSERTS_ABP_SplineTentacle_C;

SDK_NAMESPACE_END
