#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_SonicResonator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEEquipment_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SonicResonator.BP_SonicResonator_C
// 0x344A2B08 (0x344A3000 - 0x04F8)
class alignas(0x344A3000) ABP_SonicResonator_C : public AUWEEnergyTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_ToolBatteryMesh_C*                 BPC_ToolBatteryMesh;                               // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAbilitySystemComponent*             UWEAbilitySystem;                                  // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        TestConeOffset;                                    // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TestAngle;                                         // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TestLength;                                        // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TestDebugDuration;                                 // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstanceDynamic*               DMI_EmissiveStrip;                                 // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         EmissiveSlotIndex;                                 // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnEquipVisibilityChanged(bool bNewVisible);
	void EnergyChanged(float PercentEnergy);
	void EnergyEmpty();
	void EnergyRefilled();
	void Equipped();
	void ExecuteUbergraph_BP_SonicResonator(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Unequipped();
	void UpdateResonatorOnline();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SonicResonator_C">();
	}
	static class ABP_SonicResonator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SonicResonator_C>();
	}
};

}

