#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_SnapshotCamera_Schema

#include "Basic.hpp"

#include "UWEPhotoTours_structs.hpp"
#include "F_SectionData_structs.hpp"


namespace SDK::Params
{

// Function BP_SnapshotCamera_Schema.BP_SnapshotCamera_Schema_C.GetSchema
// 0x0010 (0x0010 - 0x0000)
struct BP_SnapshotCamera_Schema_C_GetSchema final
{
public:
	TArray<struct FF_SectionData>                 Schema_0;                                          // 0x0000(0x0010)(Parm, OutParm)
};

// Function BP_SnapshotCamera_Schema.BP_SnapshotCamera_Schema_C.GetSchemaAsSectionInfo
// 0x0080 (0x0080 - 0x0000)
struct BP_SnapshotCamera_Schema_C_GetSchemaAsSectionInfo final
{
public:
	TArray<struct FCameraSectionInfo>             Array;                                             // 0x0000(0x0010)(Parm, OutParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FF_SectionData>                 CallFunc_GetSchema_Schema;                         // 0x0020(0x0010)(ReferenceParm)
	struct FF_SectionData                         CallFunc_Array_Get_Item;                           // 0x0030(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FCameraSectionInfo                     K2Node_MakeStruct_CameraSectionInfo;               // 0x0058(0x0020)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotCamera_Schema.BP_SnapshotCamera_Schema_C.GetSchemaSections
// 0x0058 (0x0058 - 0x0000)
struct BP_SnapshotCamera_Schema_C_GetSchemaSections final
{
public:
	TArray<class FString>                         SchemaSections;                                    // 0x0000(0x0010)(Parm, OutParm)
	TArray<class FString>                         OutSchemaSections;                                 // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_SectionData                         CallFunc_Array_Get_Item;                           // 0x0030(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotCamera_Schema.BP_SnapshotCamera_Schema_C.SetDisabled
// 0x0001 (0x0001 - 0x0000)
struct BP_SnapshotCamera_Schema_C_SetDisabled final
{
public:
	bool                                          Disabled_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

