#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Scanner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UWEEquipment_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Scanner.BP_Scanner_C
// 0x344A2B47 (0x344A303F - 0x04F8)
class alignas(0x344A303F) ABP_Scanner_C : public AUWEEnergyTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_ToolBatteryMesh_C*                 BPC_ToolBatteryMesh;                               // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_EmissiveStrip;                                 // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         EmissiveSlotIndex;                                 // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           OnlineCueTag;                                      // 0x051C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AmmoLoaded();
	void AmmoReleased();
	void BPOnEquipVisibilityChanged(bool bNewVisible);
	void EnergyChanged(float PercentEnergy);
	void EnergyEmpty();
	void EnergyRefilled();
	void Equipped();
	void ExecuteUbergraph_BP_Scanner(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Unequipped();
	void UpdateScannerOnlineCue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Scanner_C">();
	}
	static class ABP_Scanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Scanner_C>();
	}
};

}

