#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_SnapshotScreenPrototype

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.BndEvt__BP_CameraSystemScreen_HasSpotlightIndicatorButton_K2Node_ComponentBoundEvent_4_OnInteractionServer__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_SnapshotScreenPrototype_C_BndEvt__BP_CameraSystemScreen_HasSpotlightIndicatorButton_K2Node_ComponentBoundEvent_4_OnInteractionServer__DelegateSignature final
{
public:
	class AController*                            Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Pawn;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.BndEvt__BP_CameraSystemScreen_UWECameraFeedTarget_K2Node_ComponentBoundEvent_2_UWECameraFeedSetCurrentSource__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_SnapshotScreenPrototype_C_BndEvt__BP_CameraSystemScreen_UWECameraFeedTarget_K2Node_ComponentBoundEvent_2_UWECameraFeedSetCurrentSource__DelegateSignature final
{
public:
	class UUWECameraFeedSourceComponent*          Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.BndEvt__BP_VoidCameraScreen_UWECameraFeedTarget_K2Node_ComponentBoundEvent_0_UWECameraFeedSetTextureDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_SnapshotScreenPrototype_C_BndEvt__BP_VoidCameraScreen_UWECameraFeedTarget_K2Node_ComponentBoundEvent_0_UWECameraFeedSetTextureDelegate__DelegateSignature final
{
public:
	class UTexture*                               Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.ExecuteUbergraph_BP_SnapshotScreenPrototype
// 0x0040 (0x0040 - 0x0000)
struct BP_SnapshotScreenPrototype_C_ExecuteUbergraph_BP_SnapshotScreenPrototype final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWECameraFeedSourceComponent*          K2Node_ComponentBoundEvent_Source;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture*                               K2Node_ComponentBoundEvent_Texture;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AController*                            K2Node_ComponentBoundEvent_Controller;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ComponentBoundEvent_Pawn;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.Initialize Material If Needed
// 0x0020 (0x0020 - 0x0000)
struct BP_SnapshotScreenPrototype_C_Initialize_Material_If_Needed final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.OnRep_CurrentCamera
// 0x0018 (0x0018 - 0x0000)
struct BP_SnapshotScreenPrototype_C_OnRep_CurrentCamera final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SnapshotScreenPrototype_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.Set Interactable
// 0x0001 (0x0001 - 0x0000)
struct BP_SnapshotScreenPrototype_C_Set_Interactable final
{
public:
	bool                                          Interactable;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.SetCamera
// 0x0010 (0x0010 - 0x0000)
struct BP_SnapshotScreenPrototype_C_SetCamera final
{
public:
	class ABP_CameraSystemCamera_C*               Camera;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.SetCollisionPreset
// 0x0001 (0x0001 - 0x0000)
struct BP_SnapshotScreenPrototype_C_SetCollisionPreset final
{
public:
	ECollisionChannel                             CollisionChannel;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.SetPowerEnabled
// 0x0002 (0x0002 - 0x0000)
struct BP_SnapshotScreenPrototype_C_SetPowerEnabled final
{
public:
	bool                                          Powered_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.UpdateCurrentCameraVisuals
// 0x0003 (0x0003 - 0x0000)
struct BP_SnapshotScreenPrototype_C_UpdateCurrentCameraVisuals final
{
public:
	bool                                          CallFunc_GetAllowSpotlight_Enabled;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSpotlightEnabled_Enabled;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SnapshotScreenPrototype.BP_SnapshotScreenPrototype_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_SnapshotScreenPrototype_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

