#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_SN2_Logo_RenderTargetCreator

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SN2_Logo_RenderTargetCreator.BP_SN2_Logo_RenderTargetCreator_C.ExecuteUbergraph_BP_SN2_Logo_RenderTargetCreator
// 0x0010 (0x0010 - 0x0000)
struct BP_SN2_Logo_RenderTargetCreator_C_ExecuteUbergraph_BP_SN2_Logo_RenderTargetCreator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SN2_Logo_RenderTargetCreator.BP_SN2_Logo_RenderTargetCreator_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_SN2_Logo_RenderTargetCreator_C_UserConstructionScript final
{
public:
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ReferenceParm)
};

}

