#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_SlidingDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEDoor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SlidingDoor.BP_SlidingDoor_C
// 0x344A2C48 (0x344A3000 - 0x03B8)
class alignas(0x344A3000) ABP_SlidingDoor_C final : public AUWEDoorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DoorEnd;                                           // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Door;                                          // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         DoorLightMaterialIndex;                            // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     LightMaterialOverride;                             // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__BP_SlidingDoor_Box_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_SlidingDoor_Box_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_SlidingDoor_LockComponent_K2Node_ComponentBoundEvent_0_LockDelegate__DelegateSignature(bool IsLocked);
	void ExecuteUbergraph_BP_SlidingDoor(int32 EntryPoint);
	void LockStatus_EmissiveColor(class UMaterialInstanceDynamic* MaterialInstanceDynamic);
	void OnOpenedFractionChanged(float Fraction);
	void OnPostDeserialize();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SlidingDoor_C">();
	}
	static class ABP_SlidingDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SlidingDoor_C>();
	}
};

}

