#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_StaticLifepod_Underwater

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_StaticLifepod_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StaticLifepod_Underwater.BP_StaticLifepod_Underwater_C
// 0x00F4 (0x344A30F4 - 0x344A3000)
class alignas(0x344A30F4) ABP_StaticLifepod_Underwater_C final : public ABP_StaticLifepod_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_StaticLifepod_Underwater_C;      // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxVolumeComponent*                    BoxVolume;                                         // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TubeCover;                                         // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Membrane;                                          // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_StaticLifepod_Underwater(int32 EntryPoint);
	void HideLifepod();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StaticLifepod_Underwater_C">();
	}
	static class ABP_StaticLifepod_Underwater_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StaticLifepod_Underwater_C>();
	}
};

}

