#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Tufa_RockPile_01e

#include "Basic.hpp"

#include "BP_PCG_Actor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Tufa_RockPile_01e.BP_Tufa_RockPile_01e_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_Tufa_RockPile_01e_C final : public ABP_PCG_Actor_C
{
public:
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UPCGComponent*                          PCG;                                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PCG_Bounds;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RockRubble_TufaBoulderMed_06a3_StaticMeshComponent0; // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Tufa_RockPile_01e_C">();
	}
	static class ABP_Tufa_RockPile_01e_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Tufa_RockPile_01e_C>();
	}
};

}

