#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_ThermalPlant_GhostCustomizer

#include "Basic.hpp"

#include "BP_PowerConnection_GhostCustomizer_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ThermalPlant_GhostCustomizer.BP_ThermalPlant_GhostCustomizer_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_ThermalPlant_GhostCustomizer_C final : public ABP_PowerConnection_GhostCustomizer_C
{
public:
	class UStaticMeshComponent*                   EfficiencyBar;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWETemperatureRegionTracker*           UWETemperatureRegionTracker;                       // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        MinPowerGeneration;                                // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxPowerGeneration;                                // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxTemperature;                                    // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateMeshes(const struct FSN2GhostPlacement& Placement);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ThermalPlant_GhostCustomizer_C">();
	}
	static class ABP_ThermalPlant_GhostCustomizer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ThermalPlant_GhostCustomizer_C>();
	}
};

}

