#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Wakemaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEEquipment_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Wakemaker.BP_Wakemaker_C
// 0x344A2B08 (0x344A3000 - 0x04F8)
class alignas(0x344A3000) ABP_Wakemaker_C final : public AUWEEnergyTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_ToolBatteryMesh_C*                 BPC_ToolBatteryMesh_Left;                          // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ToolBatteryMesh_C*                 BPC_ToolBatteryMesh_Right;                         // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAbilitySystemComponent*             UWEAbilitySystem;                                  // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnergyEmpty;                                     // 0x0520(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstanceDynamic*               DMI_EmissiveStrip;                                 // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Battery_Left_Imposter_Emissive;                // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOn;                                              // 0x0538(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnEquipVisibilityChanged(bool bNewVisible);
	void EnergyChanged(float PercentEnergy);
	void EnergyEmpty();
	void EnergyRefilled();
	void ExecuteUbergraph_BP_Wakemaker(int32 EntryPoint);
	void OnRep_IsEnergyEmpty();
	void ReceiveBeginPlay();
	void SetLightsOn(bool SetOn);

	void GetLightsOn(bool* LightsOn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Wakemaker_C">();
	}
	static class ABP_Wakemaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Wakemaker_C>();
	}
};

}

