#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterSlugWorldPopProxy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEWorldPopulation2_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_WaterSlugWorldPopProxy.BP_WaterSlugWorldPopProxy_C
// 0x0038 (0x0380 - 0x0348)
class ABP_WaterSlugWorldPopProxy_C final : public AUWEWorldPopResourceBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Collision;                                         // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BubbleBreath;                                      // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionStimuliSourceComponent*    AIPerceptionStimuliSource;                         // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerInProximity;                                 // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayersInProximity;                                // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerInShakeDistance;                             // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StopMontage();
	void ShowSkeletalMesh();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OutOfRangeCallback_81DD16274EA8108B0927E1850BAB72A4();
	void OutOfRangeCallback_05D1145246D8322E4C1CB28789A7EAC8();
	void OnHasBeenGathered();
	void InRangeCallback_81DD16274EA8108B0927E1850BAB72A4();
	void InRangeCallback_05D1145246D8322E4C1CB28789A7EAC8();
	void HideSkeletalMesh();
	void ExecuteUbergraph_BP_WaterSlugWorldPopProxy(int32 EntryPoint);
	void EventStopShakingAnim();
	void EventPlayShakingAnim();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WaterSlugWorldPopProxy_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WaterSlugWorldPopProxy_C")
	}
	static class ABP_WaterSlugWorldPopProxy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WaterSlugWorldPopProxy_C>();
	}
};
DUMPER7_ASSERTS_ABP_WaterSlugWorldPopProxy_C;

SDK_NAMESPACE_END
