#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_WorldSupplyLocker_Blighted

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_WorldSupplyLocker_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WorldSupplyLocker_Blighted.BP_WorldSupplyLocker_Blighted_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_WorldSupplyLocker_Blighted_C final : public ABP_WorldSupplyLocker_C
{
public:
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_WorldSupplyLocker_Blighted_C;    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        BlightSpawnPoint;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBlightRemoved;                                   // 0x0310(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UClass*                                 BlightSapClass;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 BlightSapInstance;                                 // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WorldSupplyLocker_Blighted(int32 EntryPoint);
	void OnBlightDied(class AActor* SourceActor, class AActor* TargetActor);
	void OnRep_IsBlightRemoved();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void UpdateInteractionCollision();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WorldSupplyLocker_Blighted_C">();
	}
	static class ABP_WorldSupplyLocker_Blighted_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WorldSupplyLocker_Blighted_C>();
	}
};

}

