#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_Waxmoon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SN2AILargeFish_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Waxmoon.BP_Waxmoon_C
// 0x0000 (0x344A3000 - 0x344A3000)
class ABP_Waxmoon_C final : public ABP_SN2AILargeFish_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEFMODAudioComponent*                 sfx_idle_vocal_loop;                               // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEFMODAudioComponent*                 sfx_breathing_loop;                                // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEFMODAudioComponent*                 sfx_swim_loop;                                     // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_CreatureAnimationComponent_C*      BPC_CreatureAnimationComponent;                    // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEStimulusSystemComponent*            UWEStimulusSystem;                                 // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Body_Material;                                     // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UABP_MarrowBreach_01_C*                 ABP_MarrowBreach;                                  // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TargetFinPhysics;                                  // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FinsTransitionDuration;                            // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TargetColour;                                      // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetFinsEmissiveStrength;                        // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FinsEmissiveStrength;                              // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EmissiveTransitionDuration;                        // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Waxmoon(int32 EntryPoint);
	void Set_Fins_Emissive(const struct FLinearColor& Colour, double Strength, double Transition);
	void Set_Fins_Physics(double Amount, double duration);
	void TickFinsEmissive(class UMaterialInstance* Material, const struct FLinearColor& Color, double Target_Value, double Delta_Seconds, double duration);
	void TickFinsPhysics(class UABP_MarrowBreach_01_C* AnimInstance, double Target_Value, double Delta_Seconds, double duration);
	void UpdateTendrils(double Food, double Temper);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Waxmoon_C">();
	}
	static class ABP_Waxmoon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Waxmoon_C>();
	}
};

}

