#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterCurrentBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEWaterCurrents_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_WaterCurrentBase.BP_WaterCurrentBase_C
// 0x0028 (0x0460 - 0x0438)
class ABP_WaterCurrentBase_C : public AUWESplineWaterCurrent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEFMODAudioComponent*                 FMODAudioWaterLoop;                                // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USmartObjectComponent*                  SmartObject;                                       // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Currents_MidRangeRibbons_V2;                    // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESplineAudioComponent*               UWESplineAudioWaterLoop;                           // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void TryToPlayAudio(class UObject* Object, class UFMODEvent* Event);
	void ReceiveBeginPlay();
	void OnExit(class AActor* Actor);
	void OnEnter(class AActor* Actor);
	void ExecuteUbergraph_BP_WaterCurrentBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WaterCurrentBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WaterCurrentBase_C")
	}
	static class ABP_WaterCurrentBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WaterCurrentBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_WaterCurrentBase_C;

SDK_NAMESPACE_END
