#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Wakemaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEEquipment_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_Wakemaker.BP_Wakemaker_C
// 0x0048 (0x0540 - 0x04F8)
class ABP_Wakemaker_C final : public AUWEEnergyTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_ToolBatteryMesh_C*                 BPC_ToolBatteryMesh_Left;                          // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ToolBatteryMesh_C*                 BPC_ToolBatteryMesh_Right;                         // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAbilitySystemComponent*             UWEAbilitySystem;                                  // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWEAssetDataComponent*                 UWEAssetData;                                      // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnergyEmpty;                                     // 0x0520(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DMI_EmissiveStrip;                                 // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Battery_Left_Imposter_Emissive;                // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOn;                                              // 0x0538(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetLightsOn(bool SetOn);
	void ReceiveBeginPlay();
	void OnRep_IsEnergyEmpty();
	void ExecuteUbergraph_BP_Wakemaker(int32 EntryPoint);
	void EnergyRefilled();
	void EnergyEmpty();
	void EnergyChanged(float PercentEnergy);
	void BPOnEquipVisibilityChanged(bool bNewVisible);

	void GetLightsOn(bool* LightsOn) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Wakemaker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Wakemaker_C")
	}
	static class ABP_Wakemaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Wakemaker_C>();
	}
};
DUMPER7_ASSERTS_ABP_Wakemaker_C;

SDK_NAMESPACE_END
