#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_WaterCurrentBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEWaterCurrents_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WaterCurrentBase.BP_WaterCurrentBase_C
// 0x344A2BC8 (0x344A3000 - 0x0438)
#pragma pack(push, 0x1)
class alignas(0x344A3000) ABP_WaterCurrentBase_C : public AUWESplineWaterCurrent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEFMODAudioComponent*                 FMODAudioWaterLoop;                                // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USmartObjectComponent*                  SmartObject;                                       // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Currents_MidRangeRibbons_V2;                    // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUWESplineAudioComponent*               UWESplineAudioWaterLoop;                           // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WaterCurrentBase(int32 EntryPoint);
	void OnEnter(class AActor* Actor);
	void OnExit(class AActor* Actor);
	void ReceiveBeginPlay();
	void TryToPlayAudio(class UObject* Object, class UFMODEvent* Event);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WaterCurrentBase_C">();
	}
	static class ABP_WaterCurrentBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WaterCurrentBase_C>();
	}
};
#pragma pack(pop)

}

