#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BPC_HydroelectricGeneratorComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_HydroelectricGeneratorComponent.BPC_HydroelectricGeneratorComponent_C.SetNumOverlapping
// 0x0020 (0x0020 - 0x0000)
struct BPC_HydroelectricGeneratorComponent_C_SetNumOverlapping final
{
public:
	int32                                         Overlaps;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEPowerNodeSimulation*                CallFunc_GetSimulationObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWECurrentGeneratorSimulation*         K2Node_DynamicCast_AsUWECurrent_Generator_Simulation; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

