#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_LockableInventoryInteractComponent

#include "Basic.hpp"

#include "UWEInventory_classes.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_LockableInventoryInteractComponent.BPC_LockableInventoryInteractComponent_C
// 0x0060 (0x0640 - 0x05E0)
class UBPC_LockableInventoryInteractComponent_C final : public UUWEInventoryInteractionComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFMODEvent*                             LockedInteractionSound;                            // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FComponentReference                    Lock;                                              // 0x05F0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult)> InteractedOnServer; // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult)> InteractedOnClient; // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          CanUnlockViaInteraction;                           // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void InteractServer(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	void InteractClient(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	void GetLock(class UUWEGenericLockComponent** Lock_Component);
	struct FInteractionInfo GetInteractionInfo(class AActor* HoverActor, class AActor* ForActor, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);
	void ExecuteUbergraph_BPC_LockableInventoryInteractComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_LockableInventoryInteractComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_LockableInventoryInteractComponent_C")
	}
	static class UBPC_LockableInventoryInteractComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_LockableInventoryInteractComponent_C>();
	}
};
DUMPER7_ASSERTS_UBPC_LockableInventoryInteractComponent_C;

SDK_NAMESPACE_END
