#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BPC_LockableInventoryInteractComponent

#include "Basic.hpp"

#include "UWEInventory_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_LockableInventoryInteractComponent.BPC_LockableInventoryInteractComponent_C
// 0x344A2A20 (0x344A3000 - 0x05E0)
class alignas(0x344A3000) UBPC_LockableInventoryInteractComponent_C final : public UUWEInventoryInteractionComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFMODEvent*                             LockedInteractionSound;                            // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FComponentReference                    Lock;                                              // 0x05F0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult)> InteractedOnServer; // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult)> InteractedOnClient; // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          CanUnlockViaInteraction;                           // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_LockableInventoryInteractComponent(int32 EntryPoint);
	struct FInteractionInfo GetInteractionInfo(class AActor* HoverActor, class AActor* ForActor, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);
	void GetLock(class UUWEGenericLockComponent** Lock_Component);
	void InteractClient(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	void InteractServer(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_LockableInventoryInteractComponent_C">();
	}
	static class UBPC_LockableInventoryInteractComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_LockableInventoryInteractComponent_C>();
	}
};

}

