#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BPC_SupportCheck

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_SupportCheck.BPC_SupportCheck_C
// 0x344A2DB0 (0x344A3000 - 0x0250)
class alignas(0x344A3000) UBPC_SupportCheck_C final : public USceneComponent
{
public:
	struct FVector                                LocalEnd;                                          // 0x0250(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalStart;                                        // 0x0268(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EndPadding;                                        // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      VisualizationBeam;                                 // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Must_be_on_Ground;                                 // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Must_be_on_Base;                                   // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void IsLegal(bool* Legal);
	void SetVIsualizationBeam(class UNiagaraComponent* VisualizationBeam_0);
	bool SupportIsOverlapped(const struct FVector& SpherePos);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_SupportCheck_C">();
	}
	static class UBPC_SupportCheck_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_SupportCheck_C>();
	}
};

}

