#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BPC_CarryableAbilityTrigger

#include "Basic.hpp"

#include "F_CarryableAbilities_RequiredAttributes_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_CarryableAbilityTriggerTarget_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_CarryableAbilityTrigger.BPC_CarryableAbilityTrigger_C
// 0x344A29D8 (0x344A3000 - 0x0628)
class alignas(0x344A3000) UBPC_CarryableAbilityTrigger_C final : public UStaticMeshComponent
{
public:
	uint8                                         Pad_628[0x8];                                      // 0x0628(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FF_CarryableAbilities_RequiredAttributes> RequiredAttributes;                      // 0x0638(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 PrimaryHint;                                       // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           InteractionType;                                   // 0x0658(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	E_CarryableAbilityTriggerTarget               AbilityTriggerTarget;                              // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<TSubclassOf<class UGameplayAbility>>   AbilitiesToTrigger;                                // 0x0668(0x0010)(Edit, BlueprintVisible)
	class UAbilitySystemComponent*                ASC;                                               // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UClass* GameplayAbility)> OnAbilityTriggered;                // 0x0680(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BPC_CarryableAbilityTrigger(int32 EntryPoint);
	struct FInteractionInfo GetInteractionInfo(class AActor* HoverActor, class AActor* ForActor, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);
	void Interact(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	void InteractClient(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	void InteractEnd(class AController* Controller, class APawn* Pawn);
	void InteractEndClient(class AController* Controller, class APawn* Pawn);
	void InteractEndServer(class AController* Controller, class APawn* Pawn);
	float InteractionDistance();
	void InteractServer(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	bool IsInteractDisabled(class AActor* HoverActor, class AActor* ForActor, float Distance, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);
	void Trigger();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_CarryableAbilityTrigger_C">();
	}
	static class UBPC_CarryableAbilityTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_CarryableAbilityTrigger_C>();
	}
};

}

