#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Blackbox_InventoryInteractionComponent_Proto

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BPC_Blackbox_InventoryInteractionComponent_Proto.BPC_Blackbox_InventoryInteractionComponent_Proto_C.InteractServer
// 0x0110 (0x0110 - 0x0000)
struct BPC_Blackbox_InventoryInteractionComponent_Proto_C_InteractServer final
{
public:
	class AController*                            Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Pawn;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0010(0x0100)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BPC_Blackbox_InventoryInteractionComponent_Proto_C_InteractServer;

// Function BPC_Blackbox_InventoryInteractionComponent_Proto.BPC_Blackbox_InventoryInteractionComponent_Proto_C.ExecuteUbergraph_BPC_Blackbox_InventoryInteractionComponent_Proto
// 0x0118 (0x0118 - 0x0000)
struct BPC_Blackbox_InventoryInteractionComponent_Proto_C_ExecuteUbergraph_BPC_Blackbox_InventoryInteractionComponent_Proto final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_Controller;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_Pawn;                                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0018(0x0100)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BPC_Blackbox_InventoryInteractionComponent_Proto_C_ExecuteUbergraph_BPC_Blackbox_InventoryInteractionComponent_Proto;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
