#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BPC_DataReceiver_PowerPlantActivationInstanceStaticMeshActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UWEGlobalActorData_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_DataReceiver_PowerPlantActivationInstanceStaticMeshActor.BPC_DataReceiver_PowerPlantActivationInstanceStaticMeshActor_C
// 0x344A2F28 (0x344A3000 - 0x00D8)
class alignas(0x344A3000) UBPC_DataReceiver_PowerPlantActivationInstanceStaticMeshActor_C final : public UUWEActorDataReceiverComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         RelevantMaterialIndex;                             // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UInstancedStaticMeshComponent*>  LightComponents;                                   // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       DMIs;                                              // 0x00F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           EnabledEmissiveColor;                              // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DisabledEmissiveColor;                             // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_DataReceiver_PowerPlantActivationInstanceStaticMeshActor(int32 EntryPoint);
	void OnDataChanged(const struct FGameplayTag& ActorDataGroupId);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_DataReceiver_PowerPlantActivationInstanceStaticMeshActor_C">();
	}
	static class UBPC_DataReceiver_PowerPlantActivationInstanceStaticMeshActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_DataReceiver_PowerPlantActivationInstanceStaticMeshActor_C>();
	}
};

}

