#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BPC_SnapMeshToSurface

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_SnapMeshToSurface.BPC_SnapMeshToSurface_C
// 0x344A2F7C (0x344A303C - 0x00C0)
class alignas(0x344A303C) UBPC_SnapMeshToSurface_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Raycast_Distance;                                  // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     InitialTransforms;                                 // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasBeenInitialized;                                // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UPrimitiveComponent*>            Primitives;                                        // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AActor*                                 TempActor;                                         // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_SnapMeshToSurface(int32 EntryPoint);
	void Initialize();
	void ResetMeshes();
	void RestoreMeshTransforms();
	void SnapMeshes();
	void SnapMeshesToSurface();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_SnapMeshToSurface_C">();
	}
	static class UBPC_SnapMeshToSurface_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_SnapMeshToSurface_C>();
	}
};

}

