#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_BlightCoreRewardButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Subnautica2_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_BlightCoreRewardButton.BPC_BlightCoreRewardButton_C
// 0x00C0 (0x06F0 - 0x0630)
class UBPC_BlightCoreRewardButton_C final : public UStaticMeshComponent
{
public:
	uint8                                         Pad_628[0x8];                                      // 0x0628(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          ActiveForLocalPlayer;                              // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     InactiveMaterial;                                  // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ActiveMaterial;                                    // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AdaptationToAdd;                                   // 0x0650(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        DelayApplyEffectsTime;                             // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUWEStoryGoal*>                  StoryGoalsToTriggerOnBegin;                        // 0x0660(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class AActor*                                 Actor;                                             // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class UUWEAbilitySystemComponent*, struct FActiveGameplayEffectHandle> TemporaryInvincibilities; // 0x0678(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UUWEAbilitySystemComponent*>     ActivePlayers;                                     // 0x06C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUWEAbilitySystemComponent*             CurrentASC;                                        // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         ExtraGameplayEffectsOnAdapt;                       // 0x06E0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void UpdateVisuals();
	void UpdateState();
	void ReceiveBeginPlay();
	void OnPlayerReady_F73915BF455DFAF9ACB6E0AC215405EB();
	void OnNodeStateChanged(EBlightNodeState NewState);
	void OnFinish_DDAAB54F4D6A132A231A8696A84C601E();
	void OnDetach(class AActor* Actor_0, const class FName& SlotName);
	bool IsInteractDisabled(class AActor* HoverActor, class AActor* ForActor, float Distance, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);
	void InteractServer(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	float InteractionDistance();
	void InteractEndServer(class AController* Controller, class APawn* Pawn);
	void InteractEndClient(class AController* Controller, class APawn* Pawn);
	void InteractEnd(class AController* Controller, class APawn* Pawn);
	void InteractClient(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	void Interact(class AController* Controller, class APawn* Pawn, const struct FHitResult& HitResult);
	void GetOwnerIsRemediated(bool* NewParam);
	void GetOwnerDataAsset(class USN2BlightNodeDataAsset** DataAsset);
	struct FInteractionInfo GetInteractionInfo(class AActor* HoverActor, class AActor* ForActor, class UPrimitiveComponent* HoverComponent, const struct FHitResult& HitResult);
	void FinalizePlayerAdaptation(class UUWEAbilitySystemComponent* ASC);
	void ExecuteUbergraph_BPC_BlightCoreRewardButton(int32 EntryPoint);
	void ButtonActiveForPlayer(class APawn* Player, bool* Active);
	void ApplyAdaptation(class APawn* Pawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_BlightCoreRewardButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_BlightCoreRewardButton_C")
	}
	static class UBPC_BlightCoreRewardButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_BlightCoreRewardButton_C>();
	}
};
DUMPER7_ASSERTS_UBPC_BlightCoreRewardButton_C;

SDK_NAMESPACE_END
