#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BPC_BlightCall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Subnautica2_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_BlightCall.BPC_BlightCall_C
// 0x344A2F40 (0x344A3000 - 0x00C0)
class alignas(0x344A3000) UBPC_BlightCall_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           PlayerRangeCheck;                                  // 0x00C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           PlayerState;                                       // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TimeBetweenDialogues;                              // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUWEDialogueNode*                       DefaultDialogueContainer;                          // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUWEDialogueNode*>               DialogueOptions;                                   // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MaxIndex;                                          // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        MaxPlayerDistance;                                 // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastIndex;                                         // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEDialogueNode*                       DialogueContainer_CoreHasSickJuveniles;            // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        TimeVariance;                                      // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUWEDialogueNode*                       DialogueContainer_CoreAllJuvenilesHealed;          // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWEDialogueNode*                       DialogueContainer_Juvenile_IsSick;                 // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWEDialogueNode*                       DialogueContainer_Juvenil_IsHealed;                // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableOnAdaption;                                 // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           AdaptionToCheck;                                   // 0x013C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           DialogueTimer;                                     // 0x0148(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBlightCore;                                      // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEDialogueNode*                       DialogueContainer_CoreComeAdapt;                   // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasComeAdaptDialogue;                              // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnPlayerReady_FE4632924FC22EBD427B9C94D884A407();
	void CheckForPlayerInDistance();
	void WaitForNewDialogue();
	void ResetDialogueTimer(float Time);
	void SetupDialogueOptions(class UUWEDialogueNode* DialogueContainer);
	void ReceiveBeginPlay();
	void ReShuffleDialogueOptions();
	void OnStateChanged_Event_BlightNode(EBlightNodeState NewState);
	void ClearTimers();
	void CheckBlightCoreomplete();
	void OnStateChanged_Event_BlightCore(EBlightNodeState NewState);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BPC_BlightCall(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_BlightCall_C">();
	}
	static class UBPC_BlightCall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_BlightCall_C>();
	}
};

}

