#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BPC_WorldBlocker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_WorldBlocker.BPC_WorldBlocker_C
// 0x344A2F40 (0x344A3000 - 0x00C0)
class alignas(0x344A3000) UBPC_WorldBlocker_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActorDataLayer                        In_Data_Layer;                                     // 0x00C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 Feature;                                           // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UDataLayerAsset*                        In_Data_Layer_Asset;                               // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UDataLayerAsset*>                UnloadedInShipping;                                // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UDataLayerAsset*>                ActivatedInShipping;                               // 0x00F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BPC_WorldBlocker(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_WorldBlocker_C">();
	}
	static class UBPC_WorldBlocker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_WorldBlocker_C>();
	}
};

}

