#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_LockerLabel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_LockerLabel.BPC_LockerLabel_C
// 0x0030 (0x0280 - 0x0250)
class UBPC_LockerLabel_C final : public USceneComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUWEUGCComponent*                       UGCComponent;                                      // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_LockerLabelScreen_C*               TextRender;                                        // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TextRenderSize;                                    // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FText NewText)> LabelUpdated;                                // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BeginPlayEvent();
	void ExecuteUbergraph_BPC_LockerLabel(int32 EntryPoint);
	int32 LabelLen(const class FText& Label);
	void OnPlayerTextChangedEvent();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void UpdateLabel();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_LockerLabel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_LockerLabel_C")
	}
	static class UBPC_LockerLabel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_LockerLabel_C>();
	}
};
DUMPER7_ASSERTS_UBPC_LockerLabel_C;

SDK_NAMESPACE_END
