#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BPI_SyncAnimation

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_SyncAnimation.BPI_SyncAnimation_C.SetSyncBlendOut
// 0x0010 (0x0010 - 0x0000)
struct BPI_SyncAnimation_C_SetSyncBlendOut final
{
public:
	class FName                                   SyncEndPoseSnapshot;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PoseBlendOutTime;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_SyncAnimation.BPI_SyncAnimation_C.SetSyncDriver
// 0x0020 (0x0020 - 0x0000)
struct BPI_SyncAnimation_C_SetSyncDriver final
{
public:
	class USkeletalMeshComponent*                 MeshComponentDriver;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMeshPoseDriven;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        BlendInTime;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendOutTime;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

