#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CompositeCore

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class CompositeCore.CompositeCoreSubsystem
// 0x0010 (0x0050 - 0x0040)
class UCompositeCoreSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void RegisterPrimitive(class UPrimitiveComponent* InPrimitiveComponent);
	void UnregisterPrimitive(class UPrimitiveComponent* InPrimitiveComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompositeCoreSubsystem">();
	}
	static class UCompositeCoreSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompositeCoreSubsystem>();
	}
};

// Class CompositeCore.HoldoutCompositeComponent
// 0x0010 (0x0260 - 0x0250)
class UHoldoutCompositeComponent final : public USceneComponent
{
public:
	bool                                          bIsEnabled;                                        // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_251[0xF];                                      // 0x0251(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetEnabled(bool bInEnabled);

	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoldoutCompositeComponent">();
	}
	static class UHoldoutCompositeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoldoutCompositeComponent>();
	}
};

// Class CompositeCore.CompositeCorePluginSettings
// 0x0088 (0x00C0 - 0x0038)
class UCompositeCorePluginSettings final : public UDeveloperSettings
{
public:
	uint8                                         bApplyPreExposure : 1;                             // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bApplyFXAA : 1;                                    // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FSoftClassPath>                 DisabledPrimitiveClasses;                          // 0x0040(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 AllowedComponentClasses;                           // 0x0050(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	int32                                         SceneViewExtensionPriority;                        // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x5C];                                      // 0x0064(0x005C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompositeCorePluginSettings">();
	}
	static class UCompositeCorePluginSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompositeCorePluginSettings>();
	}
};

}

