#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CR_Jetocaris_EyeFollow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass CR_Jetocaris_EyeFollow.CR_Jetocaris_EyeFollow_C
// 0x5C2E1490 (0x5C2E2000 - 0x0B70)
class alignas(0x5C2E2000) UCR_Jetocaris_EyeFollow_C final : public UControlRig
{
public:
	TArray<struct FVector>                        RandomLocs;                                        // 0x0B70(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                LastLoc;                                           // 0x0B80(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Input_POI;                                         // 0x0B98(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         timer001;                                          // 0x0BB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         timer002;                                          // 0x0BB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                newRandomLoc;                                      // 0x0BB8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LookAtOverride;                                    // 0x0BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CR_Jetocaris_EyeFollow_C">();
	}
	static class UCR_Jetocaris_EyeFollow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_Jetocaris_EyeFollow_C>();
	}
};

}

