#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CR_Leviathan_01_TentacleMovement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "Engine_structs.hpp"
#include "ControlRigSpline_structs.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass CR_Leviathan_01_TentacleMovement.CR_Leviathan_01_TentacleMovement_C
// 0x5C2E1490 (0x5C2E2000 - 0x0B70)
class alignas(0x5C2E2000) UCR_Leviathan_01_TentacleMovement_C final : public UControlRig
{
public:
	struct FVector                                AimPositionInput_InnerRight;                       // 0x0B70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTadpole;                                        // 0x0B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B89[0x7];                                      // 0x0B89(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             InnerRightAttachTransform;                         // 0x0B90(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0BF0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InnerRightTentacleClampMax;                        // 0x0C08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C0C[0x4];                                      // 0x0C0C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        InnerRightAttachDistance;                          // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FControlRigSpline                      InnerTentacleSpline;                               // 0x0C18(0x0018)(Edit, BlueprintVisible)
	double                                        TorsoSwayScale;                                    // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TorsoSwayDuration;                                 // 0x0C38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3C[0x4];                                      // 0x0C3C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRuntimeFloatCurve                     TorsoSwayRelationCurve;                            // 0x0C40(0x0088)(Edit, BlueprintVisible)
	struct FVector                                TorsoSwayAxis;                                     // 0x0CC8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0CE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE1[0x3];                                      // 0x0CE1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRigComponentKey                       AddPhysicsSolver_PhysicsSolverComponentKey;        // 0x0CE4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CR_Leviathan_01_TentacleMovement_C">();
	}
	static class UCR_Leviathan_01_TentacleMovement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_Leviathan_01_TentacleMovement_C>();
	}
};

}

