#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CR_PCBase_PostProcess

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass CR_PCBase_PostProcess.CR_PCBase_PostProcess_C
// 0x54066490 (0x54067000 - 0x0B70)
class alignas(0x54067000) UCR_PCBase_PostProcess_C final : public UControlRig
{
public:
	bool                                          In_Editor;                                         // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0B71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B72[0x2];                                      // 0x0B72(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRigElementKey                         Lowerarm_correctiveRoot_l_Duplicate;               // 0x0B74(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Lowerarm_correctiveRoot_r_Duplicate;               // 0x0B80(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Hand_l_Duplicate;                                  // 0x0B8C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Hand_r_Duplicate;                                  // 0x0B98(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA4[0x4];                                      // 0x0BA4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FRigElementKey>                 InEditor_ctrls;                                    // 0x0BA8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x0BB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CR_PCBase_PostProcess_C">();
	}
	static class UCR_PCBase_PostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_PCBase_PostProcess_C>();
	}
};

}

