#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CR_Surgejelly_Lean

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass CR_Surgejelly_Lean.CR_Surgejelly_Lean_C
// 0x5C2E1490 (0x5C2E2000 - 0x0B70)
class alignas(0x5C2E2000) UCR_Surgejelly_Lean_C final : public UControlRig
{
public:
	double                                        Euler_X;                                           // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Euler_Y;                                           // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EaseTimer;                                         // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldIGetNewLoc;                                  // 0x0B84(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B85[0xB];                                      // 0x0B85(0x000B)(Fixing Size After Last Property [ Dumper-8 ])
	struct FQuat                                  CurrentLoc;                                        // 0x0B90(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  NewLoc;                                            // 0x0BB0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldIEaseLoc;                                    // 0x0BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CR_Surgejelly_Lean_C">();
	}
	static class UCR_Surgejelly_Lean_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_Surgejelly_Lean_C>();
	}
};

}

