#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DataflowCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Chaos_structs.hpp"


namespace SDK
{

// Enum DataflowCore.EDataflowImageResolution
// NumValues: 0x000B
enum class EDataflowImageResolution : uint32
{
	Resolution16                             = 16,
	Resolution32                             = 32,
	Resolution64                             = 64,
	Resolution128                            = 128,
	Resolution256                            = 256,
	Resolution512                            = 512,
	Resolution1024                           = 1024,
	Resolution2048                           = 2048,
	Resolution4096                           = 4096,
	Resolution8192                           = 8192,
	EDataflowImageResolution_MAX             = 8193,
};

// Enum DataflowCore.EDataflowImageChannel
// NumValues: 0x0005
enum class EDataflowImageChannel : uint8
{
	Red                                      = 0,
	Green                                    = 1,
	Blue                                     = 2,
	Alpha                                    = 3,
	EDataflowImageChannel_MAX                = 4,
};

// Enum DataflowCore.EDataflowImageCombineResolutionOption
// NumValues: 0x0004
enum class EDataflowImageCombineResolutionOption : uint32
{
	Lowest                                   = 0,
	Highest                                  = 1,
	UserDefined                              = 2,
	EDataflowImageCombineResolutionOption_MAX = 3,
};

// Enum DataflowCore.EDataflowMathConstantsEnum
// NumValues: 0x000E
enum class EDataflowMathConstantsEnum : uint8
{
	Dataflow_Math_Constants_Pi               = 0,
	Dataflow_Math_Constants_HalfPi           = 1,
	Dataflow_Math_Constants_TwoPi            = 2,
	Dataflow_Math_Constants_FourPi           = 3,
	Dataflow_Math_Constants_InvPi            = 4,
	Dataflow_Math_Constants_InvTwoPi         = 5,
	Dataflow_Math_Constants_Sqrt2            = 6,
	Dataflow_Math_Constants_InvSqrt2         = 7,
	Dataflow_Math_Constants_Sqrt3            = 8,
	Dataflow_Math_Constants_InvSqrt3         = 9,
	Dataflow_Math_Constants_E                = 10,
	Dataflow_Math_Constants_Gamma            = 11,
	Dataflow_Math_Constants_GoldenRatio      = 12,
	Dataflow_Math_Constants_Max              = 13,
};

// Enum DataflowCore.EDataflowSelectionType
// NumValues: 0x0005
enum class EDataflowSelectionType : uint8
{
	Transform                                = 0,
	Vertices                                 = 1,
	Faces                                    = 2,
	Geometry                                 = 3,
	EDataflowSelectionType_MAX               = 4,
};

// ScriptStruct DataflowCore.DataflowAnyType
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FDataflowAnyType
{
};
#pragma pack(pop)

// ScriptStruct DataflowCore.DataflowAllTypes
// 0x0001 (0x0001 - 0x0000)
struct FDataflowAllTypes final : public FDataflowAnyType
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowArrayTypes
// 0x0001 (0x0001 - 0x0000)
struct FDataflowArrayTypes final : public FDataflowAnyType
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowNumericTypes
// 0x0008 (0x0008 - 0x0000)
struct FDataflowNumericTypes final : public FDataflowAnyType
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowVectorTypes
// 0x0020 (0x0020 - 0x0000)
struct FDataflowVectorTypes final : public FDataflowAnyType
{
public:
	struct FVector4                               Value;                                             // 0x0000(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowStringTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowStringTypes final : public FDataflowAnyType
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowBoolTypes
// 0x0001 (0x0001 - 0x0000)
struct FDataflowBoolTypes final : public FDataflowAnyType
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowTransformTypes
// 0x0060 (0x0060 - 0x0000)
struct FDataflowTransformTypes final : public FDataflowAnyType
{
public:
	struct FTransform                             Value;                                             // 0x0000(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowStringConvertibleTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowStringConvertibleTypes final : public FDataflowAnyType
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowUObjectConvertibleTypes
// 0x0008 (0x0008 - 0x0000)
struct FDataflowUObjectConvertibleTypes final : public FDataflowAnyType
{
public:
	class UObject*                                Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowSelection
// 0x0028 (0x0028 - 0x0000)
struct FDataflowSelection
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowSelectionTypes
// 0x0028 (0x0028 - 0x0000)
struct FDataflowSelectionTypes final : public FDataflowAnyType
{
public:
	struct FDataflowSelection                     Value;                                             // 0x0000(0x0028)(NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowVectorArrayTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowVectorArrayTypes final : public FDataflowAnyType
{
public:
	TArray<struct FVector4>                       Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowNumericArrayTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowNumericArrayTypes final : public FDataflowAnyType
{
public:
	TArray<double>                                Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowStringArrayTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowStringArrayTypes final : public FDataflowAnyType
{
public:
	TArray<class FString>                         Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowBoolArrayTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowBoolArrayTypes final : public FDataflowAnyType
{
public:
	TArray<bool>                                  Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowTransformArrayTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowTransformArrayTypes final : public FDataflowAnyType
{
public:
	TArray<struct FTransform>                     Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowRotationTypes
// 0x0018 (0x0018 - 0x0000)
struct FDataflowRotationTypes final : public FDataflowAnyType
{
public:
	struct FRotator                               Value;                                             // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowNode
// 0x0280 (0x0280 - 0x0000)
struct FDataflowNode
{
public:
	uint8                                         Pad_0[0xD8];                                       // 0x0000(0x00D8)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bActive;                                           // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideColor;                                    // 0x00D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FLinearColor                           OverrideColor;                                     // 0x00DC(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x144];                                     // 0x00EC(0x0144)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInstancedPropertyBag                  FrozenProperties;                                  // 0x0230(0x0010)(NativeAccessSpecifierPrivate)
	bool                                          bIsFrozen;                                         // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_241[0x3F];                                     // 0x0241(0x003F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.ConvertNumericTypesDataflowNode
// 0x0010 (0x0290 - 0x0280)
struct FConvertNumericTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowNumericTypes                  In;                                                // 0x0280(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Out;                                               // 0x0288(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.ConvertVectorTypesDataflowNode
// 0x0040 (0x02C0 - 0x0280)
struct FConvertVectorTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowVectorTypes                   In;                                                // 0x0280(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   Out;                                               // 0x02A0(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.ConvertStringTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertStringTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowStringTypes                   In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowStringTypes                   Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.ConvertBoolTypesDataflowNode
// 0x0008 (0x0288 - 0x0280)
struct FConvertBoolTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowBoolTypes                     In;                                                // 0x0280(0x0001)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowBoolTypes                     Out;                                               // 0x0281(0x0001)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.ConvertTransformTypesDataflowNode
// 0x00C0 (0x0340 - 0x0280)
struct FConvertTransformTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowTransformTypes                In;                                                // 0x0280(0x0060)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowTransformTypes                Out;                                               // 0x02E0(0x0060)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.ConvertStringConvertibleTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertStringConvertibleTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowStringConvertibleTypes        In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowStringConvertibleTypes        Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.ConvertUObjectConvertibleTypesDataflowNode
// 0x0010 (0x0290 - 0x0280)
struct FConvertUObjectConvertibleTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowUObjectConvertibleTypes       In;                                                // 0x0280(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowUObjectConvertibleTypes       Out;                                               // 0x0288(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.ConvertSelectionTypesDataflowNode
// 0x0108 (0x0388 - 0x0280)
struct FConvertSelectionTypesDataflowNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x0280(0x00B0)(NativeAccessSpecifierPrivate)
	struct FDataflowSelectionTypes                In;                                                // 0x0330(0x0028)(NativeAccessSpecifierPrivate)
	bool                                          bAllElementsMustBeSelected;                        // 0x0358(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDataflowSelectionTypes                Out;                                               // 0x0360(0x0028)(NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.ConvertVectorArrayTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertVectorArrayTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowVectorArrayTypes              In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowVectorArrayTypes              Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.ConvertNumericArrayTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertNumericArrayTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowNumericArrayTypes             In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowNumericArrayTypes             Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.ConvertStringArrayTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertStringArrayTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowStringArrayTypes              In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowStringArrayTypes              Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.ConvertBoolArrayTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertBoolArrayTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowBoolArrayTypes                In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowBoolArrayTypes                Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.ConvertTransformArrayTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertTransformArrayTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowTransformArrayTypes           In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowTransformArrayTypes           Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.ConvertRotationDataflowNode
// 0x0030 (0x02B0 - 0x0280)
struct FConvertRotationDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowRotationTypes                 In;                                                // 0x0280(0x0018)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowRotationTypes                 Out;                                               // 0x0298(0x0018)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowReRouteNode
// 0x0008 (0x0288 - 0x0280)
struct FDataflowReRouteNode final : public FDataflowNode
{
public:
	struct FDataflowAnyType                       Value;                                             // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowBranchNode
// 0x0008 (0x0288 - 0x0280)
struct FDataflowBranchNode final : public FDataflowNode
{
public:
	struct FDataflowAnyType                       TrueValue;                                         // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataflowAnyType                       FalseValue;                                        // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCondition;                                        // 0x0282(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataflowAnyType                       Result;                                            // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowSelectNode
// 0x0018 (0x0298 - 0x0280)
struct FDataflowSelectNode final : public FDataflowNode
{
public:
	TArray<struct FDataflowAnyType>               Inputs;                                            // 0x0280(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         SelectedIndex;                                     // 0x0290(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataflowAnyType                       Result;                                            // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowPrintNode
// 0x0010 (0x0290 - 0x0280)
struct FDataflowPrintNode final : public FDataflowNode
{
public:
	struct FDataflowStringConvertibleTypes        Value;                                             // 0x0280(0x0010)(NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowForceDependencyNode
// 0x0008 (0x0288 - 0x0280)
struct FDataflowForceDependencyNode final : public FDataflowNode
{
public:
	struct FDataflowAnyType                       Value;                                             // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataflowAnyType                       DependentValue;                                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowBaseElement
// 0x0060 (0x0060 - 0x0000)
struct FDataflowBaseElement
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowImage
// 0x0028 (0x0028 - 0x0000)
struct FDataflowImage final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowImageFromColorNode
// 0x0040 (0x02C0 - 0x0280)
struct FDataflowImageFromColorNode final : public FDataflowNode
{
public:
	struct FLinearColor                           FillColor;                                         // 0x0280(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EDataflowImageResolution                      Resolution;                                        // 0x0290(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDataflowImage                         Image;                                             // 0x0298(0x0028)(NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowImageSplitChannelsNode
// 0x00C8 (0x0348 - 0x0280)
struct FDataflowImageSplitChannelsNode final : public FDataflowNode
{
public:
	struct FDataflowImage                         Image;                                             // 0x0280(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Red;                                               // 0x02A8(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Green;                                             // 0x02D0(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Blue;                                              // 0x02F8(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         alpha;                                             // 0x0320(0x0028)(NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowImageCombineChannelsNode
// 0x00D0 (0x0350 - 0x0280)
struct FDataflowImageCombineChannelsNode final : public FDataflowNode
{
public:
	struct FDataflowImage                         Red;                                               // 0x0280(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Green;                                             // 0x02A8(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Blue;                                              // 0x02D0(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         alpha;                                             // 0x02F8(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Image;                                             // 0x0320(0x0028)(NativeAccessSpecifierPrivate)
	EDataflowImageCombineResolutionOption         ResolutionOptions;                                 // 0x0348(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EDataflowImageResolution                      Resolution;                                        // 0x034C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowMathOneInputOperatorNode
// 0x0010 (0x0290 - 0x0280)
struct FDataflowMathOneInputOperatorNode : public FDataflowNode
{
public:
	struct FDataflowNumericTypes                  A;                                                 // 0x0280(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataflowNumericTypes                  Result;                                            // 0x0288(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowMathTwoInputsOperatorNode
// 0x0018 (0x0298 - 0x0280)
struct FDataflowMathTwoInputsOperatorNode : public FDataflowNode
{
public:
	struct FDataflowNumericTypes                  A;                                                 // 0x0280(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataflowNumericTypes                  B;                                                 // 0x0288(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataflowNumericTypes                  Result;                                            // 0x0290(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowMathAddNode
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathAddNode final : public FDataflowMathTwoInputsOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathSubtractNode
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathSubtractNode final : public FDataflowMathTwoInputsOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathMultiplyNode
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathMultiplyNode final : public FDataflowMathTwoInputsOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathDivideNode
// 0x0008 (0x02A0 - 0x0298)
struct FDataflowMathDivideNode final : public FDataflowMathTwoInputsOperatorNode
{
public:
	struct FDataflowNumericTypes                  Fallback;                                          // 0x0298(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowMathMinimumNode
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathMinimumNode final : public FDataflowMathTwoInputsOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathMinimumNode_v2
// 0x0018 (0x0298 - 0x0280)
struct FDataflowMathMinimumNode_v2 final : public FDataflowNode
{
public:
	TArray<struct FDataflowNumericTypes>          Inputs;                                            // 0x0280(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Result;                                            // 0x0290(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowMathMaximumNode
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathMaximumNode final : public FDataflowMathTwoInputsOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathMaximumNode_v2
// 0x0018 (0x0298 - 0x0280)
struct FDataflowMathMaximumNode_v2 final : public FDataflowNode
{
public:
	TArray<struct FDataflowNumericTypes>          Inputs;                                            // 0x0280(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Result;                                            // 0x0290(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowMathReciprocalNode
// 0x0008 (0x0298 - 0x0290)
struct FDataflowMathReciprocalNode final : public FDataflowMathOneInputOperatorNode
{
public:
	struct FDataflowNumericTypes                  Fallback;                                          // 0x0290(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowMathSquareNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathSquareNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathCubeNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathCubeNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathSquareRootNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathSquareRootNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathInverseSquareRootNode
// 0x0008 (0x0298 - 0x0290)
struct FDataflowMathInverseSquareRootNode final : public FDataflowMathOneInputOperatorNode
{
public:
	struct FDataflowNumericTypes                  Fallback;                                          // 0x0290(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowMathNegateNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathNegateNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathAbsNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathAbsNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathFloorNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathFloorNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathCeilNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathCeilNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathRoundNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathRoundNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathTruncNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathTruncNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathFracNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathFracNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathPowNode
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathPowNode final : public FDataflowMathTwoInputsOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathLogXNode
// 0x0008 (0x0298 - 0x0290)
struct FDataflowMathLogXNode final : public FDataflowMathOneInputOperatorNode
{
public:
	struct FDataflowNumericTypes                  base;                                              // 0x0290(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowMathLogNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathLogNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathExpNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathExpNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathSignNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathSignNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathOneMinusNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathOneMinusNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathConstantNode
// 0x0010 (0x0290 - 0x0280)
struct FDataflowMathConstantNode final : public FDataflowNode
{
public:
	EDataflowMathConstantsEnum                    Constant;                                          // 0x0280(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDataflowNumericTypes                  Result;                                            // 0x0288(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowMathClampNode
// 0x0010 (0x02A0 - 0x0290)
struct FDataflowMathClampNode final : public FDataflowMathOneInputOperatorNode
{
public:
	struct FDataflowNumericTypes                  min_0;                                             // 0x0290(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataflowNumericTypes                  max_0;                                             // 0x0298(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowMathSinNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathSinNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathCosNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathCosNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathTanNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathTanNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathArcSinNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathArcSinNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathArcCosNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathArcCosNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathArcTanNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathArcTanNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathArcTan2Node
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathArcTan2Node final : public FDataflowMathTwoInputsOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathDegToRadNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathDegToRadNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowMathRadToDegNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathRadToDegNode final : public FDataflowMathOneInputOperatorNode
{
};

// ScriptStruct DataflowCore.DataflowVectorMakeVec2Node
// 0x0030 (0x02B0 - 0x0280)
struct FDataflowVectorMakeVec2Node final : public FDataflowNode
{
public:
	struct FDataflowNumericTypes                  X;                                                 // 0x0280(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Y;                                                 // 0x0288(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   Vector2D;                                          // 0x0290(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowVectorMakeVec3Node
// 0x0040 (0x02C0 - 0x0280)
struct FDataflowVectorMakeVec3Node final : public FDataflowNode
{
public:
	struct FDataflowNumericTypes                  X;                                                 // 0x0280(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Y;                                                 // 0x0288(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Z;                                                 // 0x0290(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDataflowVectorTypes                   Vector3d;                                          // 0x02A0(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowVectorMakeVec4Node
// 0x0040 (0x02C0 - 0x0280)
struct FDataflowVectorMakeVec4Node final : public FDataflowNode
{
public:
	struct FDataflowNumericTypes                  X;                                                 // 0x0280(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Y;                                                 // 0x0288(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Z;                                                 // 0x0290(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  W;                                                 // 0x0298(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   Vector4d;                                          // 0x02A0(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowVectorBreakNode
// 0x0040 (0x02C0 - 0x0280)
struct FDataflowVectorBreakNode final : public FDataflowNode
{
public:
	struct FDataflowVectorTypes                   V;                                                 // 0x0280(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  X;                                                 // 0x02A0(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Y;                                                 // 0x02A8(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Z;                                                 // 0x02B0(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  W;                                                 // 0x02B8(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowVectorAddNode
// 0x0060 (0x02E0 - 0x0280)
struct FDataflowVectorAddNode final : public FDataflowNode
{
public:
	struct FDataflowVectorTypes                   A;                                                 // 0x0280(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   B;                                                 // 0x02A0(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   V;                                                 // 0x02C0(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowVectorSubtractNode
// 0x0060 (0x02E0 - 0x0280)
struct FDataflowVectorSubtractNode final : public FDataflowNode
{
public:
	struct FDataflowVectorTypes                   A;                                                 // 0x0280(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   B;                                                 // 0x02A0(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   V;                                                 // 0x02C0(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowVectorDotProductNode
// 0x0050 (0x02D0 - 0x0280)
struct FDataflowVectorDotProductNode final : public FDataflowNode
{
public:
	struct FDataflowVectorTypes                   A;                                                 // 0x0280(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   B;                                                 // 0x02A0(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  DotProduct;                                        // 0x02C0(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowVectorLengthNode
// 0x0030 (0x02B0 - 0x0280)
struct FDataflowVectorLengthNode final : public FDataflowNode
{
public:
	struct FDataflowVectorTypes                   V;                                                 // 0x0280(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Length;                                            // 0x02A0(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowVectorSquaredLengthNode
// 0x0030 (0x02B0 - 0x0280)
struct FDataflowVectorSquaredLengthNode final : public FDataflowNode
{
public:
	struct FDataflowVectorTypes                   V;                                                 // 0x0280(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  SquaredLength;                                     // 0x02A0(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowVectorDistanceNode
// 0x0050 (0x02D0 - 0x0280)
struct FDataflowVectorDistanceNode final : public FDataflowNode
{
public:
	struct FDataflowVectorTypes                   A;                                                 // 0x0280(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   B;                                                 // 0x02A0(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Distance;                                          // 0x02C0(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowVectorCrossProductNode
// 0x0060 (0x02E0 - 0x0280)
struct FDataflowVectorCrossProductNode final : public FDataflowNode
{
public:
	struct FDataflowVectorTypes                   A;                                                 // 0x0280(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   B;                                                 // 0x02A0(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   CrossProduct;                                      // 0x02C0(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowVectorScaleNode
// 0x0050 (0x02D0 - 0x0280)
struct FDataflowVectorScaleNode final : public FDataflowNode
{
public:
	struct FDataflowVectorTypes                   V;                                                 // 0x0280(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Scale;                                             // 0x02A0(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDataflowVectorTypes                   Scaled;                                            // 0x02B0(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowVectorNormalize
// 0x0040 (0x02C0 - 0x0280)
struct FDataflowVectorNormalize final : public FDataflowNode
{
public:
	struct FDataflowVectorTypes                   V;                                                 // 0x0280(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   Normalized;                                        // 0x02A0(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct DataflowCore.DataflowConnection
// 0x0060 (0x0060 - 0x0000)
struct FDataflowConnection
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowInput
// 0x0010 (0x0070 - 0x0060)
struct FDataflowInput : public FDataflowConnection
{
public:
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowArrayInput
// 0x0010 (0x0080 - 0x0070)
struct FDataflowArrayInput final : public FDataflowInput
{
public:
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowOutput
// 0x0030 (0x0090 - 0x0060)
struct FDataflowOutput : public FDataflowConnection
{
public:
	uint8                                         Pad_60[0x30];                                      // 0x0060(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowArrayOutput
// 0x0010 (0x00A0 - 0x0090)
struct FDataflowArrayOutput final : public FDataflowOutput
{
public:
	uint8                                         Pad_90[0x10];                                      // 0x0090(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowFreezeActions
// 0x0001 (0x0001 - 0x0000)
struct FDataflowFreezeActions final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowOverrideNode
// 0x0020 (0x02A0 - 0x0280)
struct FDataflowOverrideNode : public FDataflowNode
{
public:
	class FName                                   Key;                                               // 0x0280(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Default;                                           // 0x0288(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOverriden;                                       // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowPath
// 0x0040 (0x0040 - 0x0000)
struct FDataflowPath final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct DataflowCore.DataflowTransformSelection
// 0x0000 (0x0028 - 0x0028)
struct FDataflowTransformSelection final : public FDataflowSelection
{
};

// ScriptStruct DataflowCore.DataflowVertexSelection
// 0x0000 (0x0028 - 0x0028)
struct FDataflowVertexSelection final : public FDataflowSelection
{
};

// ScriptStruct DataflowCore.DataflowFaceSelection
// 0x0000 (0x0028 - 0x0028)
struct FDataflowFaceSelection final : public FDataflowSelection
{
};

// ScriptStruct DataflowCore.DataflowGeometrySelection
// 0x0000 (0x0028 - 0x0028)
struct FDataflowGeometrySelection final : public FDataflowSelection
{
};

// ScriptStruct DataflowCore.DataflowMaterialSelection
// 0x0000 (0x0028 - 0x0028)
struct FDataflowMaterialSelection final : public FDataflowSelection
{
};

// ScriptStruct DataflowCore.NodeColors
// 0x0020 (0x0020 - 0x0000)
struct FNodeColors final
{
public:
	struct FLinearColor                           NodeTitleColor;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NodeBodyTintColor;                                 // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.PinSettings
// 0x0014 (0x0014 - 0x0000)
struct FPinSettings final
{
public:
	struct FLinearColor                           PinColor;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WireThickness;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.TransformLevelColors
// 0x0020 (0x0020 - 0x0000)
struct FTransformLevelColors final
{
public:
	TArray<struct FLinearColor>                   LevelColors;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           BlankColor;                                        // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowTerminalNode
// 0x0000 (0x0280 - 0x0280)
struct FDataflowTerminalNode : public FDataflowNode
{
};

}

