#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DataflowEngine

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DataflowEngine_structs.hpp"


namespace SDK
{

// Class DataflowEngine.DataflowDebugDrawComponent
// 0x0000 (0x0590 - 0x0590)
class UDataflowDebugDrawComponent final : public UDebugDrawComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowDebugDrawComponent">();
	}
	static class UDataflowDebugDrawComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowDebugDrawComponent>();
	}
};

// Class DataflowEngine.DataflowContextObject
// 0x0050 (0x0078 - 0x0028)
class UDataflowContextObject : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class UDataflowEdNode*                        SelectedNode;                                      // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	class UDataflow*                              DataflowGraph;                                     // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowContextObject">();
	}
	static class UDataflowContextObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowContextObject>();
	}
};

// Class DataflowEngine.DataflowBaseContent
// 0x0030 (0x00A8 - 0x0078)
class UDataflowBaseContent : public UDataflowContextObject
{
public:
	class FString                                 DataflowTerminal;                                  // 0x0078(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                TerminalAsset;                                     // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bIsConstructionDirty;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSimulationDirty;                                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9A[0xE];                                       // 0x009A(0x000E)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowBaseContent">();
	}
	static class UDataflowBaseContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowBaseContent>();
	}
};

// Class DataflowEngine.DataflowInstanceInterface
// 0x0000 (0x0000 - 0x0000)
class IDataflowInstanceInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowInstanceInterface">();
	}
	static class IDataflowInstanceInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDataflowInstanceInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class DataflowEngine.DataflowMesh
// 0x0018 (0x0040 - 0x0028)
class UDataflowMesh final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0030(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowMesh">();
	}
	static class UDataflowMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowMesh>();
	}
};

// Class DataflowEngine.DataflowSubGraph
// 0x0018 (0x0078 - 0x0060)
class UDataflowSubGraph final : public UEdGraph
{
public:
	struct FGuid                                  SubGraphGuid;                                      // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsForEach;                                        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowSubGraph">();
	}
	static class UDataflowSubGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowSubGraph>();
	}
};

// Class DataflowEngine.DataflowBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UDataflowBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void EvaluateTerminalNodeByName(class UDataflow* Dataflow, class FName TerminalNodeName, class UObject* ResultAsset);
	static bool OverrideDataflowVariableBool(class UObject* Asset, class FName VariableName, bool VariableValue);
	static bool OverrideDataflowVariableBoolArray(class UObject* Asset, class FName VariableName, const TArray<bool>& VariableArrayValue);
	static bool OverrideDataflowVariableFloat(class UObject* Asset, class FName VariableName, float VariableValue);
	static bool OverrideDataflowVariableFloatArray(class UObject* Asset, class FName VariableName, const TArray<float>& VariableArrayValue);
	static bool OverrideDataflowVariableInt(class UObject* Asset, class FName VariableName, int64 VariableValue);
	static bool OverrideDataflowVariableIntArray(class UObject* Asset, class FName VariableName, const TArray<int32>& VariableArrayValue);
	static bool OverrideDataflowVariableObject(class UObject* Asset, class FName VariableName, class UObject* VariableValue);
	static bool OverrideDataflowVariableObjectArray(class UObject* Asset, class FName VariableName, const TArray<class UObject*>& VariableArrayValue);
	static bool RegenerateAssetFromDataflow(class UObject* AssetToRegenerate, bool bRegenerateDependentAssets);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowBlueprintLibrary">();
	}
	static class UDataflowBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowBlueprintLibrary>();
	}
};

// Class DataflowEngine.DataflowContentOwner
// 0x0000 (0x0000 - 0x0000)
class IDataflowContentOwner final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowContentOwner">();
	}
	static class IDataflowContentOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDataflowContentOwner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class DataflowEngine.DataflowSkeletalContent
// 0x0018 (0x00C0 - 0x00A8)
class UDataflowSkeletalContent : public UDataflowBaseContent
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x00A8(0x0008)(Edit, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimationAsset*                        AnimationAsset;                                    // 0x00B0(0x0008)(Edit, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowSkeletalContent">();
	}
	static class UDataflowSkeletalContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowSkeletalContent>();
	}
};

// Class DataflowEngine.DataflowEdNode
// 0x0040 (0x00D8 - 0x0098)
class UDataflowEdNode final : public UEdGraphNode
{
public:
	uint8                                         Pad_98[0x20];                                      // 0x0098(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bRenderInAssetEditor;                              // 0x00B8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRenderWireframeInAssetEditor;                     // 0x00B9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanEnableRenderWireframe;                         // 0x00BA(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BB[0x1D];                                      // 0x00BB(0x001D)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowEdNode">();
	}
	static class UDataflowEdNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowEdNode>();
	}
};

// Class DataflowEngine.Dataflow
// 0x00A8 (0x0108 - 0x0060)
class UDataflow final : public UEdGraph
{
public:
	uint8                                         Pad_60[0x48];                                      // 0x0060(0x0048)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bActive;                                           // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UObject*>                        Targets;                                           // 0x00B0(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	class UMaterial*                              Material;                                          // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowType                                 Type;                                              // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInstancedPropertyBag                  Variables;                                         // 0x00D0(0x0010)(NativeAccessSpecifierPublic)
	TArray<class UDataflowSubGraph*>              DataflowSubGraphs;                                 // 0x00E0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x18];                                      // 0x00F0(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Dataflow">();
	}
	static class UDataflow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflow>();
	}
};

}

