#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DaySequence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DaySequence_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class DaySequence.DaySequenceActor
// 0x01D8 (0x0488 - 0x02B0)
class ADaySequenceActor : public AInfo
{
public:
	uint8                                         Pad_2B0[0x10];                                     // 0x02B0(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class UCurveFloat*                            DayInterpCurve;                                    // 0x02C0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDaySequenceCollectionAsset*            DaySequenceCollection;                             // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDaySequenceCollectionAsset*>    DaySequenceCollections;                            // 0x02D0(0x0010)(Edit, Net, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                         Bias;                                              // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMovieSceneBindingOverrides*            BindingOverrides;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bReplicatePlayback : 1;                            // 0x02F0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UDaySequencePlayer*                     SequencePlayer;                                    // 0x02F8(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDaySequence*                           RootSequence;                                      // 0x0300(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SequenceUpdateInterval;                            // 0x0308(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRunDayCycle;                                      // 0x030C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseInterpCurve;                                   // 0x030D(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30E[0x2];                                      // 0x030E(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDaySequenceTime                       DayLength;                                         // 0x0310(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDaySequenceTime                       TimePerCycle;                                      // 0x031C(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDaySequenceTime                       InitialTimeOfDay;                                  // 0x0328(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_334[0x14];                                     // 0x0334(0x0014)(Fixing Size After Last Property [ Dumper-8 ])
	EDaySequenceStaticTimeMode                    StaticTimeMode;                                    // 0x0348(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UDaySequenceCameraModifierManager*      CameraModifierManager;                             // 0x0350(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_358[0xE0];                                     // 0x0358(0x00E0)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<TSubclassOf<class UDaySequenceConditionTag>, class UDaySequenceConditionTag*> TrackConditionMap; // 0x0438(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	bool ContainsDaySequence(const class UDaySequence* InDaySequence);
	void Multicast_SetTimePerCycle(float InHours);
	void Pause();
	void Play();
	void SetPlayRate(float NewRate);
	void SetReplicatePlayback(bool ReplicatePlayback);
	bool SetTimeOfDay(float InHours, const class UObject* InCaller);
	void SetTimeOfDayPreview(float InHours);
	void StartDaySequenceUpdateTimer();
	void StopDaySequenceUpdateTimer();

	float GetApparentTimeOfDay() const;
	float GetDayLength() const;
	float GetInitialTimeOfDay() const;
	float GetPlayRate() const;
	float GetStaticTimeOfDay() const;
	float GetTimeOfDay() const;
	float GetTimeOfDayPreview() const;
	float GetTimePerCycle() const;
	bool HasStaticTimeOfDay() const;
	bool IsPaused() const;
	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceActor">();
	}
	static class ADaySequenceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADaySequenceActor>();
	}
};

// Class DaySequence.BaseDaySequenceActor
// 0x0038 (0x04C0 - 0x0488)
class ABaseDaySequenceActor : public ADaySequenceActor
{
public:
	class USceneComponent*                        SunRootComponent;                                  // 0x0488(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDirectionalLightComponent*             SunComponent;                                      // 0x0490(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkyAtmosphereComponent*                SkyAtmosphereComponent;                            // 0x0498(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkyLightComponent*                     SkyLightComponent;                                 // 0x04A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UExponentialHeightFogComponent*         ExponentialHeightFogComponent;                     // 0x04A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVolumetricCloudComponent*              VolumetricCloudComponent;                          // 0x04B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   SkySphereComponent;                                // 0x04B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseDaySequenceActor">();
	}
	static class ABaseDaySequenceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseDaySequenceActor>();
	}
};

// Class DaySequence.DaySequenceCheatManagerExtension
// 0x0000 (0x0028 - 0x0028)
class UDaySequenceCheatManagerExtension final : public UCheatManagerExtension
{
public:
	void SetTimeOfDay(float NewTimeOfDay) const;
	void SetTimeOfDaySpeed(float NewTimeOfDaySpeedMultiplier) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceCheatManagerExtension">();
	}
	static class UDaySequenceCheatManagerExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceCheatManagerExtension>();
	}
};

// Class DaySequence.DaySequenceConditionTag
// 0x0038 (0x0060 - 0x0028)
class UDaySequenceConditionTag final : public UObject
{
public:
	class FString                                 ConditionName;                                     // 0x0028(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDaySequenceConditionTagInitializationPhase   InitializationPhase;                               // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x27];                                      // 0x0039(0x0027)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void BroadcastOnConditionValueChanged() const;
	bool Evaluate() const;
	void SetupOnConditionValueChanged() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceConditionTag">();
	}
	static class UDaySequenceConditionTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceConditionTag>();
	}
};

// Class DaySequence.DaySequenceModifierEasingFunction
// 0x0038 (0x0060 - 0x0028)
class UDaySequenceModifierEasingFunction final : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceModifierEasingFunction">();
	}
	static class UDaySequenceModifierEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceModifierEasingFunction>();
	}
};

// Class DaySequence.DaySequenceModifierComponent
// 0x00F0 (0x0340 - 0x0250)
class UDaySequenceModifierComponent : public USceneComponent
{
public:
	class ADaySequenceActor*                      TargetActor;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_258[0x10];                                     // 0x0258(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FComponentReference>            VolumeShapeComponents;                             // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class APlayerController>       WeakBlendTarget;                                   // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDaySequence*                           UserDaySequence;                                   // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDaySequence*                           TransientSequence;                                 // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDaySequenceCollectionAsset*            DaySequenceCollection;                             // 0x0290(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UDaySequenceCollectionAsset*>    DaySequenceCollections;                            // 0x0298(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UDaySequenceModifierEasingFunction*     EasingFunction;                                    // 0x02A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Bias;                                              // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DayNightCycleTime;                                 // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BlendAmount;                                       // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BlendTime;                                         // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UserBlendWeight;                                   // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDayNightCycleMode                            DayNightCycle;                                     // 0x02C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDaySequenceModifierMode                      Mode;                                              // 0x02C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDaySequenceModifierUserBlendPolicy           BlendPolicy;                                       // 0x02C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C7[0x1];                                      // 0x02C7(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnPostReinitializeSubSequences;                    // 0x02C8(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnPostEnableModifier;                              // 0x02D8(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         bIgnoreBias : 1;                                   // 0x02E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsComponentEnabled : 1;                           // 0x02E8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsEnabled : 1;                                    // 0x02E8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bPreview : 1;                                      // 0x02E8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bUseCollection : 1;                                // 0x02E8(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bSmoothBlending : 1;                               // 0x02E8(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bForceSmoothBlending : 1;                          // 0x02E8(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_2E9[0x57];                                     // 0x02E9(0x0057)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void BindToDaySequenceActor(class ADaySequenceActor* DaySequenceActor);
	void DisableComponent();
	void EnableComponent();
	void SetBlendTarget(class APlayerController* InActor);
	void UnbindFromDaySequenceActor();

	float GetBlendWeight() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceModifierComponent">();
	}
	static class UDaySequenceModifierComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceModifierComponent>();
	}
};

// Class DaySequence.DaySequenceModifierVolume
// 0x0088 (0x0338 - 0x02B0)
class ADaySequenceModifierVolume final : public AActor
{
public:
	class UDaySequenceModifierComponent*          DaySequenceModifier;                               // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                          DefaultBox;                                        // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADaySequenceActor*                      DaySequenceActor;                                  // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerController*                      CachedPlayerController;                            // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D0[0x8];                                      // 0x02D0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bEnableSplitscreenSupport;                         // 0x02D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<class APlayerController*, class UDaySequenceModifierComponent*> AdditionalPlayers;          // 0x02E0(0x0050)(ExportObject, Transient, DuplicateTransient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnDaySequenceActorBound(class ADaySequenceActor* InActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceModifierVolume">();
	}
	static class ADaySequenceModifierVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADaySequenceModifierVolume>();
	}
};

// Class DaySequence.DaySequenceStaticTimeContributor
// 0x0018 (0x0040 - 0x0028)
class UDaySequenceStaticTimeContributor final : public UObject
{
public:
	float                                         BlendWeight;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaticTime;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWantsStaticTime;                                  // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class ADaySequenceActor*                      TargetActor;                                       // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BindToDaySequenceActor(class ADaySequenceActor* InTargetActor, int32 Priority);
	void UnbindFromDaySequenceActor();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceStaticTimeContributor">();
	}
	static class UDaySequenceStaticTimeContributor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceStaticTimeContributor>();
	}
};

// Class DaySequence.ProceduralDaySequenceBuilder
// 0x0028 (0x0050 - 0x0028)
class UProceduralDaySequenceBuilder final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AddBoolKey(class FName PropertyName, float Key, bool Value);
	void AddBoolOverride(class FName PropertyName, bool Value);
	void AddColorMaterialParameterOverride(class FName ParameterName, int32 MaterialIndex, const struct FLinearColor& Value);
	void AddColorOverride(class FName PropertyName, const struct FLinearColor& Value);
	void AddMaterialOverride(int32 MaterialIndex, class UMaterialInterface* Value);
	void AddRotationKey(float Key, const struct FRotator& Value, ERichCurveInterpMode InterpMode);
	void AddScalarKey(class FName PropertyName, float Key, double Value, ERichCurveInterpMode InterpMode);
	void AddScalarMaterialParameterOverride(class FName ParameterName, int32 MaterialIndex, float Value);
	void AddScalarOverride(class FName PropertyName, double Value);
	void AddScaleKey(float Key, const struct FVector& Value, ERichCurveInterpMode InterpMode);
	void AddTransformOverride(const struct FTransform& Value);
	void AddTranslationKey(float Key, const struct FVector& Value, ERichCurveInterpMode InterpMode);
	void AddVectorKey(class FName PropertyName, float Key, const struct FVector& Value, ERichCurveInterpMode InterpMode);
	void AddVectorOverride(class FName PropertyName, const struct FVector& Value);
	void AddVisibilityOverride(bool bValue);
	void ClearKeys();
	class UDaySequence* Initialize(class ADaySequenceActor* InActor, class UDaySequence* InitialSequence, bool bClearInitialSequence);
	void SetActiveBoundObject(class UObject* InObject);

	bool IsInitialized() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralDaySequenceBuilder">();
	}
	static class UProceduralDaySequenceBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralDaySequenceBuilder>();
	}
};

// Class DaySequence.SunMoonDaySequenceActor
// 0x0008 (0x04C8 - 0x04C0)
class ASunMoonDaySequenceActor final : public ABaseDaySequenceActor
{
public:
	class UDirectionalLightComponent*             MoonComponent;                                     // 0x04C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SunMoonDaySequenceActor">();
	}
	static class ASunMoonDaySequenceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASunMoonDaySequenceActor>();
	}
};

// Class DaySequence.UWEDaySequenceMovieSceneToolsProjectSettings
// 0x0020 (0x0048 - 0x0028)
class UUWEDaySequenceMovieSceneToolsProjectSettings final : public UObject
{
public:
	float                                         DaySequenceDefaultStartTime;                       // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDaySequenceTime                       DaySequenceDefaultDuration;                        // 0x002C(0x000C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FFrameRate                             DaySequenceDefaultTickResolution;                  // 0x0038(0x0008)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             DaySequenceDefaultDisplayRate;                     // 0x0040(0x0008)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDaySequenceMovieSceneToolsProjectSettings">();
	}
	static class UUWEDaySequenceMovieSceneToolsProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEDaySequenceMovieSceneToolsProjectSettings>();
	}
};

// Class DaySequence.DaySequence
// 0x0168 (0x01D0 - 0x0068)
class UDaySequence final : public UMovieSceneSequence
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UMovieScene*                            MovieScene;                                        // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDaySequenceBindingReferences          BindingReferences;                                 // 0x0078(0x0140)(Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UObject>                    DirectorClass;                                     // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAssetUserData*>                 AssetUserData;                                     // 0x01C0(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequence">();
	}
	static class UDaySequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequence>();
	}
};

// Class DaySequence.DaySequenceCameraModifierManager
// 0x0050 (0x0078 - 0x0028)
class UDaySequenceCameraModifierManager final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceCameraModifierManager">();
	}
	static class UDaySequenceCameraModifierManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceCameraModifierManager>();
	}
};

// Class DaySequence.DaySequenceCameraModifier
// 0x0768 (0x07B0 - 0x0048)
class UDaySequenceCameraModifier final : public UCameraModifier
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPostProcessSettings                   Settings;                                          // 0x0050(0x0760)(Edit, BlueprintVisible, Interp, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceCameraModifier">();
	}
	static class UDaySequenceCameraModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceCameraModifier>();
	}
};

// Class DaySequence.DaySequenceCollectionAsset
// 0x0020 (0x0050 - 0x0030)
class UDaySequenceCollectionAsset final : public UDataAsset
{
public:
	TArray<struct FDaySequenceCollectionEntry>    DaySequences;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ProceduralDaySequences;                            // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceCollectionAsset">();
	}
	static class UDaySequenceCollectionAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceCollectionAsset>();
	}
};

// Class DaySequence.DaySequenceDirector
// 0x0010 (0x0038 - 0x0028)
class UDaySequenceDirector : public UObject
{
public:
	class UDaySequencePlayer*                     Player;                                            // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubSequenceID;                                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MovieScenePlayerIndex;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class AActor* GetBoundActor(const struct FMovieSceneObjectBindingID& ObjectBinding);
	TArray<class AActor*> GetBoundActors(const struct FMovieSceneObjectBindingID& ObjectBinding);
	class UObject* GetBoundObject(const struct FMovieSceneObjectBindingID& ObjectBinding);
	TArray<class UObject*> GetBoundObjects(const struct FMovieSceneObjectBindingID& ObjectBinding);
	class UMovieSceneSequence* GetSequence();
	void OnCreated();

	struct FQualifiedFrameTime GetCurrentTime() const;
	struct FQualifiedFrameTime GetRootSequenceTime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceDirector">();
	}
	static class UDaySequenceDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceDirector>();
	}
};

// Class DaySequence.DaySequencePlayer
// 0x0458 (0x0480 - 0x0028)
class UDaySequencePlayer : public UObject
{
public:
	uint8                                         Pad_28[0x200];                                     // 0x0028(0x0200)(Fixing Size After Last Property [ Dumper-8 ])
	TScriptInterface<class IMovieSceneSequencePlayerObserver> Observer;                              // 0x0228(0x0010)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlay;                                            // 0x0238(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlayReverse;                                     // 0x0248(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnStop;                                            // 0x0258(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPause;                                           // 0x0268(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFinished;                                        // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_288[0x10];                                     // 0x0288(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	EMovieScenePlayerStatus                       Status;                                            // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UMovieSceneSequence*                    sequence;                                          // 0x02A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFrameNumber                           StartTime;                                         // 0x02A8(0x0004)(Net, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DurationFrames;                                    // 0x02AC(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DurationSubFrames;                                 // 0x02B0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentNumLoops;                                   // 0x02B4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SerialNumber;                                      // 0x02B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMovieSceneSequencePlaybackSettings    PlaybackSettings;                                  // 0x02BC(0x0028)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance;                           // 0x02E8(0x0020)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_308[0x84];                                     // 0x0308(0x0084)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMovieSceneSequenceReplProperties      NetSyncProps;                                      // 0x038C(0x0014)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TScriptInterface<class IMovieScenePlaybackClient> PlaybackClient;                                // 0x03A0(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B0[0xA0];                                     // 0x03B0(0x00A0)(Fixing Size After Last Property [ Dumper-8 ])
	class UMovieSceneEntitySystemLinker*          Linker;                                            // 0x0450(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_458[0x28];                                     // 0x0458(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	TArray<class UObject*> GetBoundObjects(const struct FMovieSceneObjectBindingID& ObjectBinding);
	bool GetDisableCameraCuts();
	TArray<struct FMovieSceneObjectBindingID> GetObjectBindings(class UObject* InObject);
	void GoToEndAndStop();
	void Play();
	void PlayLooping(int32 NumLoops);
	void RemoveWeight();
	void RequestInvalidateBinding(const struct FMovieSceneObjectBindingID& ObjectBinding);
	void RPC_ExplicitServerUpdateEvent(EUpdatePositionMethod Method, const struct FFrameTime& RelevantTime, int32 NewSerialNumber);
	void RPC_OnFinishPlaybackEvent(const struct FFrameTime& StoppedTime, int32 NewSerialNumber);
	void RPC_OnPlayRateChanged();
	void RPC_OnStopEvent(const struct FFrameTime& StoppedTime, int32 NewSerialNumber);
	void Scrub();
	void SetCompletionModeOverride(EMovieSceneCompletionModeOverride CompletionModeOverride);
	void SetDisableCameraCuts(bool bInDisableCameraCuts);
	void SetFrameRange(int32 StartFrame, int32 duration, float SubFrames);
	void SetFrameRate(const struct FFrameRate& FrameRate);
	void SetPlayRate(float PlayRate);
	void SetWeight(double InWeight);
	void Stop();
	void StopAtCurrentTime();

	EMovieSceneCompletionModeOverride GetCompletionModeOverride() const;
	struct FQualifiedFrameTime GetEndTime() const;
	int32 GetFrameDuration() const;
	struct FFrameRate GetFrameRate() const;
	float GetPlayRate() const;
	class UMovieSceneSequence* GetSequence() const;
	class FString GetSequenceName(bool bAddClientInfo) const;
	struct FQualifiedFrameTime GetStartTime() const;
	bool IsPaused() const;
	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequencePlayer">();
	}
	static class UDaySequencePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequencePlayer>();
	}
};

// Class DaySequence.DaySequenceProjectSettings
// 0x0030 (0x0068 - 0x0038)
class UDaySequenceProjectSettings final : public UDeveloperSettings
{
public:
	bool                                          bDefaultLockEngineToDisplayRate;                   // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 DefaultDisplayRate;                                // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultTickResolution;                             // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUpdateClockSource                            DefaultClockSource;                                // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceProjectSettings">();
	}
	static class UDaySequenceProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceProjectSettings>();
	}
};

// Class DaySequence.DaySequenceSubsystem
// 0x0038 (0x0068 - 0x0030)
class UDaySequenceSubsystem final : public UWorldSubsystem
{
public:
	TMulticastInlineDelegate<void(class ADaySequenceActor* NewActor)> OnDaySequenceActorSet;         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetDaySequenceActor(class ADaySequenceActor* InActor);

	class ADaySequenceActor* GetDaySequenceActor(bool bFindFallbackOnNull) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceSubsystem">();
	}
	static class UDaySequenceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceSubsystem>();
	}
};

// Class DaySequence.DaySequenceTrack
// 0x0000 (0x0120 - 0x0120)
class UDaySequenceTrack final : public UMovieSceneSubTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceTrack">();
	}
	static class UDaySequenceTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceTrack>();
	}
};

}

