#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DaySequence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function DaySequence.DaySequenceActor.ContainsDaySequence
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceActor_ContainsDaySequence final
{
public:
	const class UDaySequence*                     InDaySequence;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DaySequence.DaySequenceActor.Multicast_SetTimePerCycle
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_Multicast_SetTimePerCycle final
{
public:
	float                                         InHours;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.SetPlayRate
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_SetPlayRate final
{
public:
	float                                         NewRate;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.SetReplicatePlayback
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceActor_SetReplicatePlayback final
{
public:
	bool                                          ReplicatePlayback;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.SetTimeOfDay
// 0x0018 (0x0018 - 0x0000)
struct DaySequenceActor_SetTimeOfDay final
{
public:
	float                                         InHours;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	const class UObject*                          InCaller;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DaySequence.DaySequenceActor.SetTimeOfDayPreview
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_SetTimeOfDayPreview final
{
public:
	float                                         InHours;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.GetApparentTimeOfDay
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetApparentTimeOfDay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.GetDayLength
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetDayLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.GetInitialTimeOfDay
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetInitialTimeOfDay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.GetPlayRate
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetPlayRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.GetStaticTimeOfDay
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetStaticTimeOfDay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.GetTimeOfDay
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetTimeOfDay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.GetTimeOfDayPreview
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetTimeOfDayPreview final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.GetTimePerCycle
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetTimePerCycle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.HasStaticTimeOfDay
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceActor_HasStaticTimeOfDay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.IsPaused
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceActor_IsPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceActor.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceActor_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceCheatManagerExtension.SetTimeOfDay
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceCheatManagerExtension_SetTimeOfDay final
{
public:
	float                                         NewTimeOfDay;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceCheatManagerExtension.SetTimeOfDaySpeed
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceCheatManagerExtension_SetTimeOfDaySpeed final
{
public:
	float                                         NewTimeOfDaySpeedMultiplier;                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceConditionTag.Evaluate
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceConditionTag_Evaluate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceModifierComponent.BindToDaySequenceActor
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceModifierComponent_BindToDaySequenceActor final
{
public:
	class ADaySequenceActor*                      DaySequenceActor;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceModifierComponent.SetBlendTarget
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceModifierComponent_SetBlendTarget final
{
public:
	class APlayerController*                      InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceModifierComponent.GetBlendWeight
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceModifierComponent_GetBlendWeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceModifierVolume.OnDaySequenceActorBound
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceModifierVolume_OnDaySequenceActorBound final
{
public:
	class ADaySequenceActor*                      InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceStaticTimeContributor.BindToDaySequenceActor
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceStaticTimeContributor_BindToDaySequenceActor final
{
public:
	class ADaySequenceActor*                      InTargetActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddBoolKey
// 0x0010 (0x0010 - 0x0000)
struct ProceduralDaySequenceBuilder_AddBoolKey final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Key;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddBoolOverride
// 0x000C (0x000C - 0x0000)
struct ProceduralDaySequenceBuilder_AddBoolOverride final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddColorMaterialParameterOverride
// 0x001C (0x001C - 0x0000)
struct ProceduralDaySequenceBuilder_AddColorMaterialParameterOverride final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialIndex;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x000C(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddColorOverride
// 0x0018 (0x0018 - 0x0000)
struct ProceduralDaySequenceBuilder_AddColorOverride final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddMaterialOverride
// 0x0010 (0x0010 - 0x0000)
struct ProceduralDaySequenceBuilder_AddMaterialOverride final
{
public:
	int32                                         MaterialIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     Value;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddRotationKey
// 0x0028 (0x0028 - 0x0000)
struct ProceduralDaySequenceBuilder_AddRotationKey final
{
public:
	float                                         Key;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRotator                               Value;                                             // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	ERichCurveInterpMode                          InterpMode;                                        // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddScalarKey
// 0x0020 (0x0020 - 0x0000)
struct ProceduralDaySequenceBuilder_AddScalarKey final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Key;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveInterpMode                          InterpMode;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddScalarMaterialParameterOverride
// 0x0010 (0x0010 - 0x0000)
struct ProceduralDaySequenceBuilder_AddScalarMaterialParameterOverride final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialIndex;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddScalarOverride
// 0x0010 (0x0010 - 0x0000)
struct ProceduralDaySequenceBuilder_AddScalarOverride final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Value;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddScaleKey
// 0x0028 (0x0028 - 0x0000)
struct ProceduralDaySequenceBuilder_AddScaleKey final
{
public:
	float                                         Key;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Value;                                             // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveInterpMode                          InterpMode;                                        // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddTransformOverride
// 0x0060 (0x0060 - 0x0000)
struct ProceduralDaySequenceBuilder_AddTransformOverride final
{
public:
	struct FTransform                             Value;                                             // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddTranslationKey
// 0x0028 (0x0028 - 0x0000)
struct ProceduralDaySequenceBuilder_AddTranslationKey final
{
public:
	float                                         Key;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Value;                                             // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveInterpMode                          InterpMode;                                        // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddVectorKey
// 0x0030 (0x0030 - 0x0000)
struct ProceduralDaySequenceBuilder_AddVectorKey final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Key;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Value;                                             // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveInterpMode                          InterpMode;                                        // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddVectorOverride
// 0x0020 (0x0020 - 0x0000)
struct ProceduralDaySequenceBuilder_AddVectorOverride final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.ProceduralDaySequenceBuilder.AddVisibilityOverride
// 0x0001 (0x0001 - 0x0000)
struct ProceduralDaySequenceBuilder_AddVisibilityOverride final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.ProceduralDaySequenceBuilder.Initialize
// 0x0020 (0x0020 - 0x0000)
struct ProceduralDaySequenceBuilder_Initialize final
{
public:
	class ADaySequenceActor*                      InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDaySequence*                           InitialSequence;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClearInitialSequence;                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UDaySequence*                           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.ProceduralDaySequenceBuilder.SetActiveBoundObject
// 0x0008 (0x0008 - 0x0000)
struct ProceduralDaySequenceBuilder_SetActiveBoundObject final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.ProceduralDaySequenceBuilder.IsInitialized
// 0x0001 (0x0001 - 0x0000)
struct ProceduralDaySequenceBuilder_IsInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceDirector.GetBoundActor
// 0x0020 (0x0020 - 0x0000)
struct DaySequenceDirector_GetBoundActor final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceDirector.GetBoundActors
// 0x0028 (0x0028 - 0x0000)
struct DaySequenceDirector_GetBoundActors final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceDirector.GetBoundObject
// 0x0020 (0x0020 - 0x0000)
struct DaySequenceDirector_GetBoundObject final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceDirector.GetBoundObjects
// 0x0028 (0x0028 - 0x0000)
struct DaySequenceDirector_GetBoundObjects final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceDirector.GetSequence
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceDirector_GetSequence final
{
public:
	class UMovieSceneSequence*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceDirector.GetCurrentTime
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceDirector_GetCurrentTime final
{
public:
	struct FQualifiedFrameTime                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceDirector.GetRootSequenceTime
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceDirector_GetRootSequenceTime final
{
public:
	struct FQualifiedFrameTime                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.GetBoundObjects
// 0x0028 (0x0028 - 0x0000)
struct DaySequencePlayer_GetBoundObjects final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.GetDisableCameraCuts
// 0x0001 (0x0001 - 0x0000)
struct DaySequencePlayer_GetDisableCameraCuts final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.GetObjectBindings
// 0x0018 (0x0018 - 0x0000)
struct DaySequencePlayer_GetObjectBindings final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMovieSceneObjectBindingID>     ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.PlayLooping
// 0x0004 (0x0004 - 0x0000)
struct DaySequencePlayer_PlayLooping final
{
public:
	int32                                         NumLoops;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.RequestInvalidateBinding
// 0x0018 (0x0018 - 0x0000)
struct DaySequencePlayer_RequestInvalidateBinding final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.RPC_ExplicitServerUpdateEvent
// 0x0010 (0x0010 - 0x0000)
struct DaySequencePlayer_RPC_ExplicitServerUpdateEvent final
{
public:
	EUpdatePositionMethod                         Method;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFrameTime                             RelevantTime;                                      // 0x0004(0x0008)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         NewSerialNumber;                                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.RPC_OnFinishPlaybackEvent
// 0x000C (0x000C - 0x0000)
struct DaySequencePlayer_RPC_OnFinishPlaybackEvent final
{
public:
	struct FFrameTime                             StoppedTime;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         NewSerialNumber;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.RPC_OnStopEvent
// 0x000C (0x000C - 0x0000)
struct DaySequencePlayer_RPC_OnStopEvent final
{
public:
	struct FFrameTime                             StoppedTime;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         NewSerialNumber;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.SetCompletionModeOverride
// 0x0001 (0x0001 - 0x0000)
struct DaySequencePlayer_SetCompletionModeOverride final
{
public:
	EMovieSceneCompletionModeOverride             CompletionModeOverride;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.SetDisableCameraCuts
// 0x0001 (0x0001 - 0x0000)
struct DaySequencePlayer_SetDisableCameraCuts final
{
public:
	bool                                          bInDisableCameraCuts;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.SetFrameRange
// 0x000C (0x000C - 0x0000)
struct DaySequencePlayer_SetFrameRange final
{
public:
	int32                                         StartFrame;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         duration;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SubFrames;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.SetFrameRate
// 0x0008 (0x0008 - 0x0000)
struct DaySequencePlayer_SetFrameRate final
{
public:
	struct FFrameRate                             FrameRate;                                         // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.SetPlayRate
// 0x0004 (0x0004 - 0x0000)
struct DaySequencePlayer_SetPlayRate final
{
public:
	float                                         PlayRate;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.SetWeight
// 0x0008 (0x0008 - 0x0000)
struct DaySequencePlayer_SetWeight final
{
public:
	double                                        InWeight;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.GetCompletionModeOverride
// 0x0001 (0x0001 - 0x0000)
struct DaySequencePlayer_GetCompletionModeOverride final
{
public:
	EMovieSceneCompletionModeOverride             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.GetEndTime
// 0x0010 (0x0010 - 0x0000)
struct DaySequencePlayer_GetEndTime final
{
public:
	struct FQualifiedFrameTime                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.GetFrameDuration
// 0x0004 (0x0004 - 0x0000)
struct DaySequencePlayer_GetFrameDuration final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.GetFrameRate
// 0x0008 (0x0008 - 0x0000)
struct DaySequencePlayer_GetFrameRate final
{
public:
	struct FFrameRate                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.GetPlayRate
// 0x0004 (0x0004 - 0x0000)
struct DaySequencePlayer_GetPlayRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.GetSequence
// 0x0008 (0x0008 - 0x0000)
struct DaySequencePlayer_GetSequence final
{
public:
	class UMovieSceneSequence*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.GetSequenceName
// 0x0018 (0x0018 - 0x0000)
struct DaySequencePlayer_GetSequenceName final
{
public:
	bool                                          bAddClientInfo;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.GetStartTime
// 0x0010 (0x0010 - 0x0000)
struct DaySequencePlayer_GetStartTime final
{
public:
	struct FQualifiedFrameTime                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.IsPaused
// 0x0001 (0x0001 - 0x0000)
struct DaySequencePlayer_IsPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequencePlayer.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct DaySequencePlayer_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceSubsystem.SetDaySequenceActor
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceSubsystem_SetDaySequenceActor final
{
public:
	class ADaySequenceActor*                      InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DaySequence.DaySequenceSubsystem.GetDaySequenceActor
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceSubsystem_GetDaySequenceActor final
{
public:
	bool                                          bFindFallbackOnNull;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class ADaySequenceActor*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

