#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EQC_DecisionTarget

#include "Basic.hpp"

#include "UWEAI_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQC_DecisionTarget.EQC_DecisionTarget_C.ProvideSingleLocation
// 0x00D0 (0x00D0 - 0x0000)
struct EQC_DecisionTarget_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUWEAIController*                       K2Node_DynamicCast_AsUWEAIController;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAIDecisionComponent*                CallFunc_GetAIDecision_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUWEAIDecisionTargetInfo               CallFunc_GetDecisionTargetInfo_ReturnValue;        // 0x0048(0x0088)(NoDestructor)
};

}

