#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: F_HighCloudsSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_HighCloudsSettings.F_HighCloudsSettings
// 0x0028 (0x0028 - 0x0000)
struct FF_HighCloudsSettings final
{
public:
	double                                        HighCloudsType_2_B42C29334F26853117858493DE541E0F; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HighCloudsOpacity_7_32627BA743348D6AA5D0188AE303B007; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HighCloudsCoverageMin_8_92CB5B0545FCA383CF5ED888153FE944; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HighCloudsCoverageMax_9_DA1DA13A44C8D8F50920F59B5E696C16; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HighCloudsScrollSpeed_10_E001C6534086183ED23F878CC16A87B3; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

