#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_AI_FourEye_Bite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AI_FourEye_Bite.GA_AI_FourEye_Bite_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_AI_FourEye_Bite_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         AbilityDamage;                                     // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DamageType;                                        // 0x0544(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x054C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRadius;                                      // 0x0554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            AttackMontage;                                     // 0x0558(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void DealDamage();
	void ExecuteUbergraph_GA_AI_FourEye_Bite(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnBlendedIn_813F888849B26C8E09580C9A40177C03();
	void OnBlendOut_813F888849B26C8E09580C9A40177C03();
	void OnCancelled_813F888849B26C8E09580C9A40177C03();
	void OnCompleted_813F888849B26C8E09580C9A40177C03();
	void OnInterrupted_813F888849B26C8E09580C9A40177C03();
	void OnLoaded_8B98B00C425C4B32A6C2D8951BFDD004(class UObject* Loaded);
	void OnNotifyBegin_0DD9D01F4AC11A3059DD0291530C76A4();
	void OnNotifyBegin_C8F23454470431432541B3A5029ABECD();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AI_FourEye_Bite_C">();
	}
	static class UGA_AI_FourEye_Bite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AI_FourEye_Bite_C>();
	}
};

}

