#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_AI_NeedlerShark_Reload

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AI_NeedlerShark_Reload.GA_AI_NeedlerShark_Reload_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_AI_NeedlerShark_Reload_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         AbilityDamage;                                     // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DamageType;                                        // 0x0544(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x054C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRadius;                                      // 0x0554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            AttackMontage;                                     // 0x0558(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_AI_NeedlerShark_Reload(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendedIn_69442D8E44216FE60AAE96A88363C4F9();
	void OnBlendedIn_7A6AD2474EAEE6B015E877881E0FBE29();
	void OnBlendOut_69442D8E44216FE60AAE96A88363C4F9();
	void OnBlendOut_7A6AD2474EAEE6B015E877881E0FBE29();
	void OnCancelled_69442D8E44216FE60AAE96A88363C4F9();
	void OnCancelled_7A6AD2474EAEE6B015E877881E0FBE29();
	void OnCompleted_69442D8E44216FE60AAE96A88363C4F9();
	void OnCompleted_7A6AD2474EAEE6B015E877881E0FBE29();
	void OnInterrupted_69442D8E44216FE60AAE96A88363C4F9();
	void OnInterrupted_7A6AD2474EAEE6B015E877881E0FBE29();
	void OnLoaded_6E28A69943E3B6BEEDFA02AA5E061E2F(class UObject* Loaded);
	void OnNotifyBegin_A4063EA24723DEA57E23179B9BF52348();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AI_NeedlerShark_Reload_C">();
	}
	static class UGA_AI_NeedlerShark_Reload_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AI_NeedlerShark_Reload_C>();
	}
};

}

