#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_AI_Sandspear_GrabPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AI_Sandspear_GrabPlayer.GA_AI_Sandspear_GrabPlayer_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_AI_Sandspear_GrabPlayer_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_Sandspear_Juvenile_C*               SandSpearJuvenile;                                 // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 GrabbedActor;                                      // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsGrabbed;                                        // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   AttachSlotName;                                    // 0x0554(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DamagePlayer();
	void DetachPlayer();
	void ExecuteUbergraph_GA_AI_Sandspear_GrabPlayer(int32 EntryPoint);
	void ForceDetach();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAttachAnimationIsDone_121824134E8D5D53F37B4284C0C5AE5C();
	void OnAttachFinished_121824134E8D5D53F37B4284C0C5AE5C();
	void OnAttachInterpolationToSocketIsDone_121824134E8D5D53F37B4284C0C5AE5C();
	void OnAttachStarted_121824134E8D5D53F37B4284C0C5AE5C();
	void OnBeginOverlapDetectorEvent(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnBlendedIn_677B5FB14F66976DB485579C12A40D07();
	void OnBlendedIn_CC8A35FC4600BDF50DB557A767060920();
	void OnBlendOut_677B5FB14F66976DB485579C12A40D07();
	void OnBlendOut_CC8A35FC4600BDF50DB557A767060920();
	void OnCancelled_677B5FB14F66976DB485579C12A40D07();
	void OnCancelled_CC8A35FC4600BDF50DB557A767060920();
	void OnCompleted_677B5FB14F66976DB485579C12A40D07();
	void OnCompleted_CC8A35FC4600BDF50DB557A767060920();
	void OnDetachAnimationIsDone_43BB48C1473F809909FE71A0D62B7C5A();
	void OnDetachFinished_43BB48C1473F809909FE71A0D62B7C5A();
	void OnDetachStarted_43BB48C1473F809909FE71A0D62B7C5A();
	void OnFinish_BA1A5633420CB29283508C9FB0ABB96D();
	void OnInterrupted_677B5FB14F66976DB485579C12A40D07();
	void OnInterrupted_CC8A35FC4600BDF50DB557A767060920();
	void OnNotifyBegin_189126324082A53B9D84459EA78EBA22();
	void OnNotifyBegin_CD2B3B3D4F2042F7D40979A36D7FA65F();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AI_Sandspear_GrabPlayer_C">();
	}
	static class UGA_AI_Sandspear_GrabPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AI_Sandspear_GrabPlayer_C>();
	}
};

}

