#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_AI_NeedlerShark_Shoot_Stun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AI_NeedlerShark_Shoot_Stun.GA_AI_NeedlerShark_Shoot_Stun_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_AI_NeedlerShark_Shoot_Stun_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ShootRange;                                        // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShotsToFire;                                       // 0x0544(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceEnd;                                          // 0x0550(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NeedlerShark_C*                     OwningNeedler;                                     // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DamageType;                                        // 0x0570(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                SocketLocation;                                    // 0x0580(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_AI_NeedlerShark_Shoot_Stun(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendedIn_F116371F40E0C56D3F7C57BAE7135DBF();
	void OnBlendOut_F116371F40E0C56D3F7C57BAE7135DBF();
	void OnCancelled_F116371F40E0C56D3F7C57BAE7135DBF();
	void OnCompleted_F116371F40E0C56D3F7C57BAE7135DBF();
	void OnFinished_47D2DE604583FCD694D90DA6C1010DC2(int32 ActionNumber);
	void OnInterrupted_F116371F40E0C56D3F7C57BAE7135DBF();
	void OnLoaded_D5BD2DC941D385BFA8F05EB421DA7FD4(class UObject* Loaded);
	void OnPerformAction_47D2DE604583FCD694D90DA6C1010DC2(int32 ActionNumber);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AI_NeedlerShark_Shoot_Stun_C">();
	}
	static class UGA_AI_NeedlerShark_Shoot_Stun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AI_NeedlerShark_Shoot_Stun_C>();
	}
};

}

