#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_AI_JetoCaris_Forage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AI_JetoCaris_Forage.GA_AI_JetoCaris_Forage_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_AI_JetoCaris_Forage_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Success;                                           // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        FoodFound;                                         // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AbilityLocation;                                   // 0x0550(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MainMontage;                                       // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_AI_JetoCaris_Forage(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnBlendedIn_08ACCFE541D1A1CEE4B81489B53ED008();
	void OnBlendedIn_C0BD4D1A483D6AC07225BDAD1053F185();
	void OnBlendedIn_DE8D622440AED70CD5A87CA1519631FF();
	void OnBlendOut_08ACCFE541D1A1CEE4B81489B53ED008();
	void OnBlendOut_C0BD4D1A483D6AC07225BDAD1053F185();
	void OnBlendOut_DE8D622440AED70CD5A87CA1519631FF();
	void OnCancelled_08ACCFE541D1A1CEE4B81489B53ED008();
	void OnCancelled_C0BD4D1A483D6AC07225BDAD1053F185();
	void OnCancelled_DE8D622440AED70CD5A87CA1519631FF();
	void OnCompleted_08ACCFE541D1A1CEE4B81489B53ED008();
	void OnCompleted_C0BD4D1A483D6AC07225BDAD1053F185();
	void OnCompleted_DE8D622440AED70CD5A87CA1519631FF();
	void OnInterrupted_08ACCFE541D1A1CEE4B81489B53ED008();
	void OnInterrupted_C0BD4D1A483D6AC07225BDAD1053F185();
	void OnInterrupted_DE8D622440AED70CD5A87CA1519631FF();
	void OnLoaded_23E6825C488E1A162EF4598EBCD136FB(class UObject* Loaded);
	void OnLoaded_5271E9F04D65A79D451382A2FAB5E9E6(class UObject* Loaded);
	void OnLoaded_CF3C370E4151F74F48D099B262FB4249(class UObject* Loaded);
	void OnLoaded_D3D990F9490662BA8E891383CB023D2F(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AI_JetoCaris_Forage_C">();
	}
	static class UGA_AI_JetoCaris_Forage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AI_JetoCaris_Forage_C>();
	}
};

}

