#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_AI_LeviathanGrabAttackTadpole

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AI_LeviathanGrabAttackTadpole.GA_AI_LeviathanGrabAttackTadpole_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_AI_LeviathanGrabAttackTadpole_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_CollectorLeviathan_C*               As_BP_Collector_Leviathan;                         // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0548(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          bIsGrabbed;                                        // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FHitResult                             HitResult;                                         // 0x0650(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_Tadpole_C*                          As_BP_Tadpole;                                     // 0x0750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PostGrabForwardVector;                             // 0x0758(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyDamageEvent();
	void ExecuteUbergraph_GA_AI_LeviathanGrabAttackTadpole(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void KillPlayer();
	void OnBeginOverlapEvent(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnCompleted_04B83F594B4DE348CD62A5B540AD77BB();
	void OnCompleted_D1CD32F54133C1F09D785E87F81589B1();
	void OnCompleted_F0B3F8DD434C505BCED37EB36C96A7E3();
	void OnNotifyBegin_6A68BF1F4F4C0B470D138BA2D19AE67F();
	void OnNotifyBegin_8DC5178B44ACB8A40A975D80A483AD5F();
	void TryAddImpulse();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AI_LeviathanGrabAttackTadpole_C">();
	}
	static class UGA_AI_LeviathanGrabAttackTadpole_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AI_LeviathanGrabAttackTadpole_C>();
	}
};

}

