#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_AI_Mesmerize

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AI_Mesmerize.GA_AI_Mesmerize_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_AI_Mesmerize_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 TargetActor;                                       // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        LookAtAngle;                                       // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FallbackTime;                                      // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckLookAtTarget;                                 // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        CutoffDistance;                                    // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ActiveStimulusEffectHandle;                        // 0x0568(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            TargetEffectHandle;                                // 0x0570(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_AI_Mesmerize(int32 EntryPoint);
	void Is_Looking_at_Target(bool* Result);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendedIn_969901F947A8D272FE354FAECDAEA3C0();
	void OnBlendOut_969901F947A8D272FE354FAECDAEA3C0();
	void OnCancelled_969901F947A8D272FE354FAECDAEA3C0();
	void OnCompleted_969901F947A8D272FE354FAECDAEA3C0();
	void OnFinish_5D8F91E9499294CC577901A9D59D684E();
	void OnInterrupted_969901F947A8D272FE354FAECDAEA3C0();
	void OnLoaded_D2ED0E7C4377393BF7632FA32423A34A(class UObject* Loaded);
	void OnTick_73C5C0FA40836B47C7D38ABF9EEB2653(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AI_Mesmerize_C">();
	}
	static class UGA_AI_Mesmerize_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AI_Mesmerize_C>();
	}
};

}

