#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Builder_MoveMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEInterfaces_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function GA_Builder_MoveMode.GA_Builder_MoveMode_C.GetAbilityInfo
// 0x0188 (0x0188 - 0x0000)
struct GA_Builder_MoveMode_C_GetAbilityInfo final
{
public:
	class AActor*                                 HoverActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ForActor;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    HoverComponent;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0020(0x0100)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FAbilityInfoData                       ReturnValue;                                       // 0x0120(0x0068)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_GA_Builder_MoveMode_C_GetAbilityInfo;

// Function GA_Builder_MoveMode.GA_Builder_MoveMode_C.ExecuteUbergraph_GA_Builder_MoveMode
// 0x0008 (0x0008 - 0x0000)
struct GA_Builder_MoveMode_C_ExecuteUbergraph_GA_Builder_MoveMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Builder_MoveMode_C_ExecuteUbergraph_GA_Builder_MoveMode;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
