#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Builder_DeconstructMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Subnautica2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Builder_DeconstructMode.GA_Builder_DeconstructMode_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_Builder_DeconstructMode_C final : public USN2BaseDeconstructAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ASN2BuilderGhost*                       Ghost;                                             // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USN2AbilityTask_WaitGhostConstruction*  ReconstructTask;                                   // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DeconstructTime;                                   // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDeconstruct;                                     // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EnableDeconstruct();
	void EnableShrink();
	void ExecuteUbergraph_GA_Builder_DeconstructMode(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnActionValue_DEC1849C47BDC87ECB6A85A275D24295(const struct FInputActionValue& Value);
	void OnActionValue_E0B94C2A4DD8E5F63343B58B1D90E1A3(const struct FInputActionValue& Value);
	void OnCompleted_DEC1849C47BDC87ECB6A85A275D24295(const struct FInputActionValue& Value);
	void OnCompleted_E0B94C2A4DD8E5F63343B58B1D90E1A3(const struct FInputActionValue& Value);
	void OnOngoing_DEC1849C47BDC87ECB6A85A275D24295(const struct FInputActionValue& Value);
	void OnOngoing_E0B94C2A4DD8E5F63343B58B1D90E1A3(const struct FInputActionValue& Value);
	void OnStarted_DEC1849C47BDC87ECB6A85A275D24295(const struct FInputActionValue& Value);
	void OnStarted_E0B94C2A4DD8E5F63343B58B1D90E1A3(const struct FInputActionValue& Value);
	void RemoveVisualEffects();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Builder_DeconstructMode_C">();
	}
	static class UGA_Builder_DeconstructMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Builder_DeconstructMode_C>();
	}
};

}

