#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Builder_OpenMenu

#include "Basic.hpp"

#include "UWEInterfaces_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function GA_Builder_OpenMenu.GA_Builder_OpenMenu_C.OnPress_53975A4F490B654B1FDE96B0C431205D
// 0x0004 (0x0004 - 0x0000)
struct GA_Builder_OpenMenu_C_OnPress_53975A4F490B654B1FDE96B0C431205D final
{
public:
	float                                         TimeWaited;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Builder_OpenMenu_C_OnPress_53975A4F490B654B1FDE96B0C431205D;

// Function GA_Builder_OpenMenu.GA_Builder_OpenMenu_C.ExecuteUbergraph_GA_Builder_OpenMenu
// 0x0048 (0x0048 - 0x0000)
struct GA_Builder_OpenMenu_C_ExecuteUbergraph_GA_Builder_OpenMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeWaited;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeWaited)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputPress*            CallFunc_WaitInputPress_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWindowManager*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWindowManager*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UModalActivatableWidget*                CallFunc_PushToLayerWithContext_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Builder_OpenMenu_C_ExecuteUbergraph_GA_Builder_OpenMenu;

// Function GA_Builder_OpenMenu.GA_Builder_OpenMenu_C.GetActivateAbilityInfo
// 0x00E0 (0x00E0 - 0x0000)
struct GA_Builder_OpenMenu_C_GetActivateAbilityInfo final
{
public:
	struct FAbilityInfoData                       ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	struct FAbilityInfoData                       K2Node_MakeStruct_AbilityInfoData;                 // 0x0078(0x0068)()
};
DUMPER7_ASSERTS_GA_Builder_OpenMenu_C_GetActivateAbilityInfo;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
