#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Builder_DeconstructMode

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Builder_DeconstructMode.GA_Builder_DeconstructMode_C.ExecuteUbergraph_GA_Builder_DeconstructMode
// 0x03F8 (0x03F8 - 0x0000)
struct GA_Builder_DeconstructMode_C_ExecuteUbergraph_GA_Builder_DeconstructMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInputActionValue                      K2Node_CustomEvent_Value_7;                        // 0x0008(0x0020)(NoDestructor)
	struct FInputActionValue                      K2Node_CustomEvent_Value_6;                        // 0x0028(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate;     // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value_5;                        // 0x0058(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_1;   // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value_4;                        // 0x0088(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_2;   // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      Temp_struct_Variable;                              // 0x00B8(0x0020)(NoDestructor)
	class UUWEAbilityTask_WaitInputActionValue*   CallFunc_WaitInputActionValue_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInputActionValue                      K2Node_CustomEvent_Value_3;                        // 0x00E8(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_3;   // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value_2;                        // 0x0118(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_4;   // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value_1;                        // 0x0148(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_5;   // 0x0168(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value;                          // 0x0178(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_6;   // 0x0198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      Temp_struct_Variable_1;                            // 0x01A8(0x0020)(NoDestructor)
	class UUWEAbilityTask_WaitInputActionValue*   CallFunc_WaitInputActionValue_ReturnValue_1;       // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x01D8(0x00B0)()
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_7;   // 0x0288(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData_1;             // 0x0298(0x00B0)()
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData_2;             // 0x0348(0x00B0)()
};

// Function GA_Builder_DeconstructMode.GA_Builder_DeconstructMode_C.OnActionValue_DEC1849C47BDC87ECB6A85A275D24295
// 0x0020 (0x0020 - 0x0000)
struct GA_Builder_DeconstructMode_C_OnActionValue_DEC1849C47BDC87ECB6A85A275D24295 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_Builder_DeconstructMode.GA_Builder_DeconstructMode_C.OnActionValue_E0B94C2A4DD8E5F63343B58B1D90E1A3
// 0x0020 (0x0020 - 0x0000)
struct GA_Builder_DeconstructMode_C_OnActionValue_E0B94C2A4DD8E5F63343B58B1D90E1A3 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_Builder_DeconstructMode.GA_Builder_DeconstructMode_C.OnCompleted_DEC1849C47BDC87ECB6A85A275D24295
// 0x0020 (0x0020 - 0x0000)
struct GA_Builder_DeconstructMode_C_OnCompleted_DEC1849C47BDC87ECB6A85A275D24295 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_Builder_DeconstructMode.GA_Builder_DeconstructMode_C.OnCompleted_E0B94C2A4DD8E5F63343B58B1D90E1A3
// 0x0020 (0x0020 - 0x0000)
struct GA_Builder_DeconstructMode_C_OnCompleted_E0B94C2A4DD8E5F63343B58B1D90E1A3 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_Builder_DeconstructMode.GA_Builder_DeconstructMode_C.OnOngoing_DEC1849C47BDC87ECB6A85A275D24295
// 0x0020 (0x0020 - 0x0000)
struct GA_Builder_DeconstructMode_C_OnOngoing_DEC1849C47BDC87ECB6A85A275D24295 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_Builder_DeconstructMode.GA_Builder_DeconstructMode_C.OnOngoing_E0B94C2A4DD8E5F63343B58B1D90E1A3
// 0x0020 (0x0020 - 0x0000)
struct GA_Builder_DeconstructMode_C_OnOngoing_E0B94C2A4DD8E5F63343B58B1D90E1A3 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_Builder_DeconstructMode.GA_Builder_DeconstructMode_C.OnStarted_DEC1849C47BDC87ECB6A85A275D24295
// 0x0020 (0x0020 - 0x0000)
struct GA_Builder_DeconstructMode_C_OnStarted_DEC1849C47BDC87ECB6A85A275D24295 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_Builder_DeconstructMode.GA_Builder_DeconstructMode_C.OnStarted_E0B94C2A4DD8E5F63343B58B1D90E1A3
// 0x0020 (0x0020 - 0x0000)
struct GA_Builder_DeconstructMode_C_OnStarted_E0B94C2A4DD8E5F63343B58B1D90E1A3 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

}

