#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Builder_PlaceGhost

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Subnautica2_classes.hpp"
#include "EnhancedInput_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Builder_PlaceGhost.GA_Builder_PlaceGhost_C
// 0x0040 (0x05A8 - 0x0568)
class UGA_Builder_PlaceGhost_C final : public USN2PlaceConstructionGhostAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USN2BuilderConstructActionData*         ConstructActionData;                               // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASN2BuilderTool*                        BuilderTool;                                       // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreInput;                                       // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 PrevOld;                                           // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PrevNew;                                           // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  TargetGUID;                                        // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetupFromEvent(const struct FGameplayEventData& GameplayEventData);
	void SetModeTexture();
	void ResetModeTexture();
	void RemoveTags();
	void OnStarted_ABD2308D40B657806C5492B607B9EAFC(const struct FInputActionValue& Value);
	void OnStarted_7CDC401B44811CC1C497E788E7C58138(const struct FInputActionValue& Value);
	void OnRelease_30D19913444A175D9253708FEBA4B8FC(float TimeHeld);
	void OnPress_CAD8DC7D4BE35C6D997F499D95549A06(float TimeWaited);
	void OnOngoing_ABD2308D40B657806C5492B607B9EAFC(const struct FInputActionValue& Value);
	void OnOngoing_7CDC401B44811CC1C497E788E7C58138(const struct FInputActionValue& Value);
	void OnCompleted_ABD2308D40B657806C5492B607B9EAFC(const struct FInputActionValue& Value);
	void OnCompleted_7CDC401B44811CC1C497E788E7C58138(const struct FInputActionValue& Value);
	void OnChanged_DABAC71B4782D90F3A27078807956509(class AActor* OldConstructTarget, class AActor* NewConstructTarget);
	void OnActionValue_ABD2308D40B657806C5492B607B9EAFC(const struct FInputActionValue& Value);
	void OnActionValue_7CDC401B44811CC1C497E788E7C58138(const struct FInputActionValue& Value);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void ExecuteUbergraph_GA_Builder_PlaceGhost(int32 EntryPoint);
	void ApplyGCOnBuilder(const struct FGameplayTag& GC);
	void AddTags();
	void Added_3E0D26D946EE90E8D8E1E0BBD9601E27();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Builder_PlaceGhost_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Builder_PlaceGhost_C")
	}
	static class UGA_Builder_PlaceGhost_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Builder_PlaceGhost_C>();
	}
};
DUMPER7_ASSERTS_UGA_Builder_PlaceGhost_C;

SDK_NAMESPACE_END
