#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Break

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Break.GA_Break_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_Break_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActor*>                         HitActors;                                         // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         HitsToBreak;                                       // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 TargetActor;                                       // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentHitIndex;                                   // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        BreakDelayWithTool;                                // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PendingBreak;                                      // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyHitStimulus();
	void Cancelled_6DA24E1148AFFE09D4E4F5947E4519B6(const struct FUWETargetActor& HoverTarget);
	void ExecuteUbergraph_GA_Break(int32 EntryPoint);
	bool IsPlayerHoldingATool();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnCompleted_C29956DD4FB1DFE15E5344B9E2E285E2();
	void OnFinish_0918950547BC57B5716867835CAEAAB6();
	void OnSync_483D7DD342D8A5E62E3AA18CFC65962F();
	void OnTasksDeactivated_811D1AA64CF4288955A696BB339FD3C7();
	void PlayBreakEffect(const class AActor* Actor);
	void PlayImpactEffect();
	void RegisterHit();
	void ShowHitCue();
	void ValidData_6DA24E1148AFFE09D4E4F5947E4519B6(const struct FUWETargetActor& HoverTarget);

	void GetNumHits(class AActor* Actor, int32* NumHits) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Break_C">();
	}
	static class UGA_Break_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Break_C>();
	}
};

}

