#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_BaseEdit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Subnautica2_structs.hpp"
#include "Subnautica2_classes.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_BaseEdit.GA_BaseEdit_C
// 0x344A2AB0 (0x344A3000 - 0x0550)
class alignas(0x344A3000) UGA_BaseEdit_C final : public USN2BaseEditAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USN2ItemBrushActionData*                ActionData;                                        // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Released;                                          // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USN2AbilityTask_WaitGhostConstruction*  GhostConstructionTask;                             // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USN2AbilityTask_WaitGhostConstruction*  DecayTask;                                         // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsConstructing;                                    // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           ApplicationGCTag;                                  // 0x057C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            EnergyConsumptionHandle;                           // 0x0584(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          EnergyDrainActive;                                 // 0x058C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class USN2AbilityTask_UpdateBaseEdit*         UpdateSelectionTask;                               // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPaused;                                          // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_CBC08D3D4905146DC96FF1A3BA69FA59();
	void ApplyGCOnBuilder(const struct FGameplayTag& GC);
	void BeginEnergyConsumption();
	void CanApply(bool* Result);
	void EndEnergyConsumption();
	void EventReceived_E4BCA5504B196F8B07B0F980A98090CC(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_BaseEdit(int32 EntryPoint);
	struct FSN2BuilderConstructionInfo GetConstructionInfo();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnActionValue_0E982EFD477169FC2522E5899EB66C68(const struct FInputActionValue& Value);
	void OnActionValue_2778B8044F7AD4DB9FDFF2A7F85D6BD6(const struct FInputActionValue& Value);
	void OnActionValue_91D54FE44C0FE27B0177B79B6CA0E7CF(const struct FInputActionValue& Value);
	void OnBrushChanged_69748BEB4967D786DD29EAA78532419B(const struct FSN2EditBrush& EditBrush);
	void OnChanged_F4E07EEA41FD0FC0564F6FA7EFD9D3AD(class AActor* OldConstructTarget, class AActor* NewConstructTarget);
	void OnCompleted_0E982EFD477169FC2522E5899EB66C68(const struct FInputActionValue& Value);
	void OnCompleted_2778B8044F7AD4DB9FDFF2A7F85D6BD6(const struct FInputActionValue& Value);
	void OnCompleted_91D54FE44C0FE27B0177B79B6CA0E7CF(const struct FInputActionValue& Value);
	void OnOngoing_0E982EFD477169FC2522E5899EB66C68(const struct FInputActionValue& Value);
	void OnOngoing_2778B8044F7AD4DB9FDFF2A7F85D6BD6(const struct FInputActionValue& Value);
	void OnOngoing_91D54FE44C0FE27B0177B79B6CA0E7CF(const struct FInputActionValue& Value);
	void OnPress_843320A046488C4ECA366993A5F87743(float TimeWaited);
	void OnStarted_0E982EFD477169FC2522E5899EB66C68(const struct FInputActionValue& Value);
	void OnStarted_2778B8044F7AD4DB9FDFF2A7F85D6BD6(const struct FInputActionValue& Value);
	void OnStarted_91D54FE44C0FE27B0177B79B6CA0E7CF(const struct FInputActionValue& Value);
	void RemoveVisualEffects();
	void ServerSetDeconstructTags(bool Add);
	void SetDeconstructTags(bool Add);
	void SpawnGhostFromClass(class USN2ItemBrushActionData* ActionData_0);
	void SpawnGhostFromEditAction(class USN2ItemBrushActionData* ActionData_0, bool* Success);
	void TryApply(class UObject* ActionData_0, bool* Success);
	void UpdateBuilderModeTexture(bool UseAddTexture);

	struct FAbilityInfoData GetActivateAbilityInfo() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_BaseEdit_C">();
	}
	static class UGA_BaseEdit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_BaseEdit_C>();
	}
};

}

