#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Builder_Construct

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Subnautica2_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Builder_Construct.GA_Builder_Construct_C
// 0x0028 (0x0568 - 0x0540)
class UGA_Builder_Construct_C final : public USN2BuilderAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            EnergyConsumptionHandle;                           // 0x0548(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          EnergyDrainActive;                                 // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  GhostGUID;                                         // 0x0554(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RemoveVisualEffects();
	void OnDepleted_31844852419019612D87FBB017C72230();
	void OnCompleted_5DC3313A4EF7A434BBCFDD88FC71AAC6();
	void OnChanged_A340B72B4C987A8F338A94A6F41AD5F7(class AActor* OldConstructTarget, class AActor* NewConstructTarget);
	void OnCantAfford_95222AC9443E432DD0C24DB6F33016CF();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_CommitExecute();
	void ExecuteUbergraph_GA_Builder_Construct(int32 EntryPoint);
	void Added_0C99EA8140648770BC2BE8882131DF48();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;
	struct FAbilityInfoData GetActivateAbilityInfo() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Builder_Construct_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Builder_Construct_C")
	}
	static class UGA_Builder_Construct_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Builder_Construct_C>();
	}
};
DUMPER7_ASSERTS_UGA_Builder_Construct_C;

SDK_NAMESPACE_END
