#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Carry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEVolumeTracker_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Carry.GA_Carry_C
// 0x344A2B53 (0x344A308B - 0x0538)
class alignas(0x344A308B) UGA_Carry_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         MaxPickupDistanceMeters;                           // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAbilityTask_WaitAttachCarryable*    CarryTask;                                         // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CarriedActor;                                      // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPickedUp;                                       // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         LastEquippedSlot;                                  // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Cancelled_DCB1712A42E5BCA8E24652A54D1342BA(const struct FUWETargetActor& HoverTarget);
	void Cancelled_E0A8638347E27C0FE6B06A9738A2EA44(const struct FUWETargetActor& HoverTarget);
	void ExecuteUbergraph_GA_Carry(int32 EntryPoint);
	class FString GetItemTypeFileNameForActor(const class AActor* Actor);
	void K2_ActivateAbility();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnCancelled_AC5BE472468C7F58CA800CB11FC282D9();
	void OnCancelled_C415A70A4C25359B4266C1A48074ABC0();
	void OnFinish_DD87FBDA4231983E126E639D4B086BEF();
	void OnPress_734E80D74608449634ED68B6208D60AC(float TimeWaited);
	void RecordEndCarryEvent(const class AActor* Actor, class UActorComponent* AttachPoint);
	void RecordStartCarryEvent(const class AActor* Actor);
	void SetCarryablePhysicsEnabled(bool Enabled);
	void SetCarryActor(class AActor* Actor);
	void SetMeshDriver(class USkeletalMeshComponent* SourceMeshComponent);
	void SetToolEnergy(double EnergyLevel);
	void TryDeflateCarryable();
	void TryInflateCarryable();
	void TrySendCarryableDroppedGameplayEvent();
	void ValidData_DCB1712A42E5BCA8E24652A54D1342BA(const struct FUWETargetActor& HoverTarget);
	void ValidData_E0A8638347E27C0FE6B06A9738A2EA44(const struct FUWETargetActor& HoverTarget);

	void IsBeingCarried(class AActor* Actor, bool* Carried) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Carry_C">();
	}
	static class UGA_Carry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Carry_C>();
	}
};

}

