#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Dash_ActiveBioAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Dash_ActiveBioAbility.GA_Dash_ActiveBioAbility_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_Dash_ActiveBioAbility_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        DashAcceleration;                                  // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DashDuration;                                      // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                DashDirection;                                     // 0x0550(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Dash_ActiveBioAbility(int32 EntryPoint);
	void K2_ActivateAbility();
	void LimitUpwardsAcceleration(const struct FVector& InAccel, struct FVector* OutAccel);
	void OnCompleted_448587EF4D9824036BB55A891E362B18();
	void OnFinish_7D3ACC7E42A0A7E89B74F8A9C78D30EB();
	void OnTick_22833C0242B71BA9A361FB9508882079(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Dash_ActiveBioAbility_C">();
	}
	static class UGA_Dash_ActiveBioAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Dash_ActiveBioAbility_C>();
	}
};

}

