#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Detach

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Detach.GA_Detach_C.ExecuteUbergraph_GA_Detach
// 0x0020 (0x0020 - 0x0000)
struct GA_Detach_C_ExecuteUbergraph_GA_Detach final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class ASN2BaseCharacter*                      CallFunc_GetCharacterFromAbilityActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASN2PlayerCharacter*                    K2Node_DynamicCast_AsSN2Player_Character;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

