#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DoublePing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_DoublePing.GA_DoublePing_C
// 0x0040 (0x0578 - 0x0538)
class UGA_DoublePing_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         PingLineTraceLength;                               // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lifetime;                                          // 0x0544(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PingLocation;                                      // 0x0548(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SelfPingDistance;                                  // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  TrackingActor;                                     // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASN2PlayerController*                   CurrentAbilityPlayerController;                    // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void K2_ActivateAbility();
	void ExecuteUbergraph_GA_DoublePing(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_DoublePing_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_DoublePing_C")
	}
	static class UGA_DoublePing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DoublePing_C>();
	}
};
DUMPER7_ASSERTS_UGA_DoublePing_C;

SDK_NAMESPACE_END
