#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_EMTTorsion_Base

#include "Basic.hpp"

#include "UWEInterfaces_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UWEAbilitySystem_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_EMTTorsion_Base.GA_EMTTorsion_Base_C.Cancelled_61E478724007C9FD1EC2C8A603A73633
// 0x0138 (0x0138 - 0x0000)
struct GA_EMTTorsion_Base_C_Cancelled_61E478724007C9FD1EC2C8A603A73633 final
{
public:
	struct FUWETargetActor                        HoverTarget;                                       // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};

// Function GA_EMTTorsion_Base.GA_EMTTorsion_Base_C.ExecuteUbergraph_GA_EMTTorsion_Base
// 0x0758 (0x0758 - 0x0000)
struct GA_EMTTorsion_Base_C_ExecuteUbergraph_GA_EMTTorsion_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AUWEBaseItem*                           CallFunc_GetToolFromAbilityActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_GetDefaultCueParams_ReturnValue;          // 0x0010(0x00D8)(ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USN2AbilityTask_WaitEnergyDepleted*     CallFunc_WaitEnergyDepleted_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USN2AbilityTask_WaitHoverTargetLost*    CallFunc_WaitHoverTargetLost_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ActionNumber)>           K2Node_CreateDelegate_OutputDelegate_2;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         K2Node_CustomEvent_ActionNumber_1;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ActionNumber;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ActionNumber)>           K2Node_CreateDelegate_OutputDelegate_3;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWETargetActor                        K2Node_CustomEvent_HoverTarget_1;                  // 0x0158(0x0138)(ConstParm, NoDestructor, ContainsInstancedReference)
	TDelegate<void(const struct FUWETargetActor& HoverTarget)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0290(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUWETargetActor                        K2Node_CustomEvent_HoverTarget;                    // 0x02A0(0x0138)(ConstParm, NoDestructor, ContainsInstancedReference)
	TDelegate<void(const struct FUWETargetActor& HoverTarget)> K2Node_CreateDelegate_OutputDelegate_5; // 0x03D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUWETargetActor                        Temp_struct_Variable;                              // 0x03E8(0x0138)(NoDestructor, ContainsInstancedReference)
	class USN2AbilityTask_WaitHoverTarget*        CallFunc_WaitHoverTargetSynced_ReturnValue;        // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x3];                                      // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USN2EMTTorsionPointComponent*           CallFunc_GetTorsionPointFromHoverTarget_AsSN2EMTTorsion_Point_Component; // 0x0530(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTorsionPointFromHoverTarget_bFound;    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x3];                                      // 0x0539(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           CallFunc_GetTorsionPointFromHoverTarget_NotFoundReason; // 0x053C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate_6;            // 0x0544(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAbilityTask_Repeat*                    CallFunc_RepeatAction_ReturnValue;                 // 0x0558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Temp_real_Variable;                                // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0580(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUWEBaseItem*                           CallFunc_GetToolFromAbilityActorInfo_ReturnValue_1; // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUWEBaseItem*                           CallFunc_GetToolFromAbilityActorInfo_ReturnValue_2; // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_GetDefaultCueParams_ReturnValue_1;        // 0x0598(0x00D8)(ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_GetDefaultCueParams_ReturnValue_2;        // 0x0670(0x00D8)(ContainsInstancedReference)
	float                                         CallFunc_ApplyTorsion_Multiplier_ImplicitCast;     // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RepeatAction_TimeBetweenActions_ImplicitCast; // 0x074C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyTorsion_DeltaTime_ImplicitCast;      // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GA_EMTTorsion_Base.GA_EMTTorsion_Base_C.OnFinished_2FEB925444A4678C4C83A0BF5B306BD7
// 0x0004 (0x0004 - 0x0000)
struct GA_EMTTorsion_Base_C_OnFinished_2FEB925444A4678C4C83A0BF5B306BD7 final
{
public:
	int32                                         ActionNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GA_EMTTorsion_Base.GA_EMTTorsion_Base_C.OnPerformAction_2FEB925444A4678C4C83A0BF5B306BD7
// 0x0004 (0x0004 - 0x0000)
struct GA_EMTTorsion_Base_C_OnPerformAction_2FEB925444A4678C4C83A0BF5B306BD7 final
{
public:
	int32                                         ActionNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GA_EMTTorsion_Base.GA_EMTTorsion_Base_C.OnRelease_49F8E67A47C5BFF8143942AEA0BD2AEB
// 0x0004 (0x0004 - 0x0000)
struct GA_EMTTorsion_Base_C_OnRelease_49F8E67A47C5BFF8143942AEA0BD2AEB final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GA_EMTTorsion_Base.GA_EMTTorsion_Base_C.ValidData_61E478724007C9FD1EC2C8A603A73633
// 0x0138 (0x0138 - 0x0000)
struct GA_EMTTorsion_Base_C_ValidData_61E478724007C9FD1EC2C8A603A73633 final
{
public:
	struct FUWETargetActor                        HoverTarget;                                       // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};

// Function GA_EMTTorsion_Base.GA_EMTTorsion_Base_C.GetActivateAbilityInfo
// 0x0188 (0x0188 - 0x0000)
struct GA_EMTTorsion_Base_C_GetActivateAbilityInfo final
{
public:
	struct FAbilityInfoData                       ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class USN2EMTTorsionPointComponent*           CallFunc_GetTorsionPointFromHoverTarget_AsSN2EMTTorsion_Point_Component; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTorsionPointFromHoverTarget_bFound;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           CallFunc_GetTorsionPointFromHoverTarget_NotFoundReason; // 0x008C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0098(0x0010)(ReferenceParm)
	struct FAbilityInfoData                       K2Node_MakeStruct_AbilityInfoData;                 // 0x00A8(0x0068)()
	class FText                                   K2Node_Select_Default;                             // 0x0110(0x0010)()
	struct FAbilityInfoData                       K2Node_MakeStruct_AbilityInfoData_1;               // 0x0120(0x0068)()
};

// Function GA_EMTTorsion_Base.GA_EMTTorsion_Base_C.GetTorsionPointFromHoverTarget
// 0x0180 (0x0180 - 0x0000)
struct GA_EMTTorsion_Base_C_GetTorsionPointFromHoverTarget final
{
public:
	class USN2EMTTorsionPointComponent*           AsSN2EMTTorsion_Point_Component;                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bFound;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           NotFoundReason;                                    // 0x000C(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUWETargetActor                        CallFunc_GetHoverInfoFromActorInfo_ReturnValue;    // 0x0020(0x0138)(NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    CallFunc_GetHoverComponentFromActorInfo_ReturnValue; // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class USN2EMTTorsionPointComponent*           K2Node_DynamicCast_AsSN2EMTTorsion_Point_Component; // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

