#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_EMTTorsion_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_EMTTorsion_Base.GA_EMTTorsion_Base_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_EMTTorsion_Base_C : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        TorsionMultiplier;                                 // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IncrementSeconds;                                  // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USN2EMTTorsionPointComponent*           TorsionPoint;                                      // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 PrimaryText;                                       // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           TorsionGameplayCueTag;                             // 0x0568(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	double                                        EMTInteractionDistance;                            // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Cancelled_61E478724007C9FD1EC2C8A603A73633(const struct FUWETargetActor& HoverTarget);
	void ExecuteUbergraph_GA_EMTTorsion_Base(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnDepleted_0D54CDD4427C677C5CE853B10342BC1A();
	void OnFinished_2FEB925444A4678C4C83A0BF5B306BD7(int32 ActionNumber);
	void OnPerformAction_2FEB925444A4678C4C83A0BF5B306BD7(int32 ActionNumber);
	void OnRelease_49F8E67A47C5BFF8143942AEA0BD2AEB(float TimeHeld);
	void OnTargetLost_08A1E7934774A2A3DC39EA8F45BC4C58();
	void ValidData_61E478724007C9FD1EC2C8A603A73633(const struct FUWETargetActor& HoverTarget);

	struct FAbilityInfoData GetActivateAbilityInfo() const;
	void GetTorsionPointFromHoverTarget(class USN2EMTTorsionPointComponent** AsSN2EMTTorsion_Point_Component, bool* bFound, struct FGameplayTag* NotFoundReason) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_EMTTorsion_Base_C">();
	}
	static class UGA_EMTTorsion_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_EMTTorsion_Base_C>();
	}
};

}

