#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Haul_CameraSwitch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Haul_CameraSwitch.GA_Haul_CameraSwitch_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_Haul_CameraSwitch_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HaulCameraActive;                                  // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UWBP_HaulCameraOverlay_C*               CameraWidget;                                      // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        FadeTime;                                          // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateHaulCamera();
	void DeactivateHaulCamera();
	void ExecuteUbergraph_GA_Haul_CameraSwitch(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnFinish_226A34524D3E481693FDEAB97BF67A54();
	void OnFinish_233E5AA346889E5EC46265969790B955();
	void OnFinish_5D150F5043E9A6FE35A06080600FC599();
	void OnFinish_695BFB5A490082115CF2D1B6C96424A1();
	void OnPossessedChanged_A2E781E64FD9E8631373DAB4F547C446(bool bPossessed);
	void OnPress_2441B521488F4F1EF7B72EB015F443A2(float TimeWaited);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Haul_CameraSwitch_C">();
	}
	static class UGA_Haul_CameraSwitch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Haul_CameraSwitch_C>();
	}
};

}

