#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Look

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function GA_Look.GA_Look_C.ExecuteUbergraph_GA_Look
// 0x01A8 (0x01A8 - 0x0000)
struct GA_Look_C_ExecuteUbergraph_GA_Look final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInputActionValue                      K2Node_CustomEvent_Value_2;                        // 0x0008(0x0020)(NoDestructor)
	struct FInputActionValue                      K2Node_CustomEvent_Value_1;                        // 0x0028(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate;     // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value;                          // 0x0058(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_1;   // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      Temp_struct_Variable;                              // 0x0088(0x0020)(NoDestructor)
	class UUWEAbilityTask_WaitInputActionValue*   CallFunc_WaitInputActionValue_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        CallFunc_BreakInputActionValue_X;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakInputActionValue_Y;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakInputActionValue_Z;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionValueType                         CallFunc_BreakInputActionValue_Type;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPossessed;                     // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	TDelegate<void(bool bPossessed)>              K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAbilityTask_OnPossessedChanged*     CallFunc_WaitPossessedChanged_ReturnValue;         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAbilityTask_WaitTagRequirementsFailed* CallFunc_WaitTagRequirementsFailed_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWEMovementSetComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_4;   // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotationSpeedMultiplier_ReturnValue;   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInputActionValue                      K2Node_CustomEvent_Value_3;                        // 0x0160(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_5;   // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddControllerPitchInput_Val_ImplicitCast; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddControllerYawInput_Val_ImplicitCast;   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GA_Look.GA_Look_C.OnActionValue_0E7603B84F16469156125180DA506B56
// 0x0020 (0x0020 - 0x0000)
struct GA_Look_C_OnActionValue_0E7603B84F16469156125180DA506B56 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_Look.GA_Look_C.OnCompleted_0E7603B84F16469156125180DA506B56
// 0x0020 (0x0020 - 0x0000)
struct GA_Look_C_OnCompleted_0E7603B84F16469156125180DA506B56 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_Look.GA_Look_C.OnOngoing_0E7603B84F16469156125180DA506B56
// 0x0020 (0x0020 - 0x0000)
struct GA_Look_C_OnOngoing_0E7603B84F16469156125180DA506B56 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_Look.GA_Look_C.OnPossessedChanged_D93873174C6ECBCF70F34D82879501B3
// 0x0001 (0x0001 - 0x0000)
struct GA_Look_C_OnPossessedChanged_D93873174C6ECBCF70F34D82879501B3 final
{
public:
	bool                                          bPossessed;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GA_Look.GA_Look_C.OnStarted_0E7603B84F16469156125180DA506B56
// 0x0020 (0x0020 - 0x0000)
struct GA_Look_C_OnStarted_0E7603B84F16469156125180DA506B56 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

}

