#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_OxygenPlantBreathing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_OxygenPlantBreathing.GA_OxygenPlantBreathing_C
// 0x0028 (0x0560 - 0x0538)
class UGA_OxygenPlantBreathing_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        BreathingDuration;                                 // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_OxygenPlant_Parent_C*               OxygenPlant;                                       // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BubbleEjectTime;                                   // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASN2OxygenBubble*                       SpawnedBubble;                                     // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SpawnOxygen();
	void PreSpawnBubbleActor();
	void OnFinish_D818F5584E31DC0DB53380895EC30CB2();
	void OnFinish_66D216554A4D93C5099B1D912992127C();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void ExecuteUbergraph_GA_OxygenPlantBreathing(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_OxygenPlantBreathing_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_OxygenPlantBreathing_C")
	}
	static class UGA_OxygenPlantBreathing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_OxygenPlantBreathing_C>();
	}
};
DUMPER7_ASSERTS_UGA_OxygenPlantBreathing_C;

SDK_NAMESPACE_END
