#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_PressurizedLungs_BioAbility

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_PressurizedLungs_BioAbility.GA_PressurizedLungs_BioAbility_C.ExecuteUbergraph_GA_PressurizedLungs_BioAbility
// 0x00C0 (0x00C0 - 0x0000)
struct GA_PressurizedLungs_BioAbility_C_ExecuteUbergraph_GA_PressurizedLungs_BioAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo_1;    // 0x0008(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo;      // 0x0040(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectRemovalInfo             Temp_struct_Variable;                              // 0x0078(0x0028)()
	bool                                          CallFunc_K2_CommitAbilityCost_ReturnValue;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FActiveGameplayEffectHandle            CallFunc_UWEApplyGameplayEffectToOwner_ReturnValue; // 0x00A4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAbilityTask_WaitGameplayEffectRemoved* CallFunc_WaitForGameplayEffectRemoved_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GA_PressurizedLungs_BioAbility.GA_PressurizedLungs_BioAbility_C.InvalidHandle_E4E37BBB47A71230808642B541423E72
// 0x0028 (0x0028 - 0x0000)
struct GA_PressurizedLungs_BioAbility_C_InvalidHandle_E4E37BBB47A71230808642B541423E72 final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function GA_PressurizedLungs_BioAbility.GA_PressurizedLungs_BioAbility_C.OnRemoved_E4E37BBB47A71230808642B541423E72
// 0x0028 (0x0028 - 0x0000)
struct GA_PressurizedLungs_BioAbility_C_OnRemoved_E4E37BBB47A71230808642B541423E72 final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

}

