#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Pickup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Pickup.GA_Pickup_C
// 0x0128 (0x0660 - 0x0538)
class UGA_Pickup_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         MaxPickupDistanceMeters;                           // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 HoverTargetActor;                                  // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0550(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<TSoftClassPtr<class UClass>>           TwoHandedTools;                                    // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ValidData_B8CB9BAF4EE26627EE605AB8AB074256(const struct FUWETargetActor& HoverTarget);
	void PlayForceFeedback();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	bool HasTwoHandedToolEquipped();
	void ExecuteUbergraph_GA_Pickup(int32 EntryPoint);
	void Cancelled_B8CB9BAF4EE26627EE605AB8AB074256(const struct FUWETargetActor& HoverTarget);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Pickup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Pickup_C")
	}
	static class UGA_Pickup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Pickup_C>();
	}
};
DUMPER7_ASSERTS_UGA_Pickup_C;

SDK_NAMESPACE_END
