#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_SurvivalMultiTool_Cut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SurvivalMultiTool_Cut.GA_SurvivalMultiTool_Cut_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_SurvivalMultiTool_Cut_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Hover_Target_Actor;                                // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0548(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          TargetWasAlive;                                    // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWECuttableData*                       CuttableData;                                      // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Flee_Stimulus_Effect;                              // 0x0658(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PendingBreak;                                      // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEItemType*                           SurvivalMultiToolItemType;                         // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Cancelled_8D7DBD474CCC6E499D9C7AA58D4F3908(const struct FUWETargetActor& HoverTarget);
	void CreatureStimulus();
	void DamageTarget(class AActor* Actor, double* NewHealth);
	void DestroyTarget(class AActor* Actor);
	void ExecuteUbergraph_GA_SurvivalMultiTool_Cut(int32 EntryPoint);
	void GiveResource(class AActor* Actor);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnCancelled_28B46B5844581014EC4B3AB09FF9EEE9();
	void OnCompleted_28B46B5844581014EC4B3AB09FF9EEE9();
	void OnCompleted_D8558D344912706C07CD58879ED388E4();
	void OnCompleted_FCD3D2764712B24614DD26A8E954EE2D();
	void OnFailed_28B46B5844581014EC4B3AB09FF9EEE9();
	void PlayHitEffect(class AActor* Actor);
	void ReplaceDummyPlant();
	void SetCuttableData();
	void ValidData_8D7DBD474CCC6E499D9C7AA58D4F3908(const struct FUWETargetActor& HoverTarget);

	void GetResourceSpawnLocation(struct FVector* Location) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SurvivalMultiTool_Cut_C">();
	}
	static class UGA_SurvivalMultiTool_Cut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SurvivalMultiTool_Cut_C>();
	}
};

}

