#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Swim

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UWEVolumeTracker_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function GA_Swim.GA_Swim_C.OnStarted_E80D0FBA4F9088F096AF5194CF267811
// 0x0020 (0x0020 - 0x0000)
struct GA_Swim_C_OnStarted_E80D0FBA4F9088F096AF5194CF267811 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_GA_Swim_C_OnStarted_E80D0FBA4F9088F096AF5194CF267811;

// Function GA_Swim.GA_Swim_C.OnStarted_E7B4EFF4450EE32D27781F951D040059
// 0x0020 (0x0020 - 0x0000)
struct GA_Swim_C_OnStarted_E7B4EFF4450EE32D27781F951D040059 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_GA_Swim_C_OnStarted_E7B4EFF4450EE32D27781F951D040059;

// Function GA_Swim.GA_Swim_C.OnPossessedChanged_5941A07F4CAFBFE93D3FB6A28E3DCBA9
// 0x0001 (0x0001 - 0x0000)
struct GA_Swim_C_OnPossessedChanged_5941A07F4CAFBFE93D3FB6A28E3DCBA9 final
{
public:
	bool                                          bPossessed;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Swim_C_OnPossessedChanged_5941A07F4CAFBFE93D3FB6A28E3DCBA9;

// Function GA_Swim.GA_Swim_C.OnOngoing_E80D0FBA4F9088F096AF5194CF267811
// 0x0020 (0x0020 - 0x0000)
struct GA_Swim_C_OnOngoing_E80D0FBA4F9088F096AF5194CF267811 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_GA_Swim_C_OnOngoing_E80D0FBA4F9088F096AF5194CF267811;

// Function GA_Swim.GA_Swim_C.OnOngoing_E7B4EFF4450EE32D27781F951D040059
// 0x0020 (0x0020 - 0x0000)
struct GA_Swim_C_OnOngoing_E7B4EFF4450EE32D27781F951D040059 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_GA_Swim_C_OnOngoing_E7B4EFF4450EE32D27781F951D040059;

// Function GA_Swim.GA_Swim_C.OnCompleted_E80D0FBA4F9088F096AF5194CF267811
// 0x0020 (0x0020 - 0x0000)
struct GA_Swim_C_OnCompleted_E80D0FBA4F9088F096AF5194CF267811 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_GA_Swim_C_OnCompleted_E80D0FBA4F9088F096AF5194CF267811;

// Function GA_Swim.GA_Swim_C.OnCompleted_E7B4EFF4450EE32D27781F951D040059
// 0x0020 (0x0020 - 0x0000)
struct GA_Swim_C_OnCompleted_E7B4EFF4450EE32D27781F951D040059 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_GA_Swim_C_OnCompleted_E7B4EFF4450EE32D27781F951D040059;

// Function GA_Swim.GA_Swim_C.OnActionValue_E80D0FBA4F9088F096AF5194CF267811
// 0x0020 (0x0020 - 0x0000)
struct GA_Swim_C_OnActionValue_E80D0FBA4F9088F096AF5194CF267811 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_GA_Swim_C_OnActionValue_E80D0FBA4F9088F096AF5194CF267811;

// Function GA_Swim.GA_Swim_C.OnActionValue_E7B4EFF4450EE32D27781F951D040059
// 0x0020 (0x0020 - 0x0000)
struct GA_Swim_C_OnActionValue_E7B4EFF4450EE32D27781F951D040059 final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_GA_Swim_C_OnActionValue_E7B4EFF4450EE32D27781F951D040059;

// Function GA_Swim.GA_Swim_C.ExecuteUbergraph_GA_Swim
// 0x03F8 (0x03F8 - 0x0000)
struct GA_Swim_C_ExecuteUbergraph_GA_Swim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASN2BaseCharacter*                      CallFunc_GetCharacterFromAbilityActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value_5;                        // 0x0010(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate;     // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value_4;                        // 0x0040(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_1;   // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      Temp_struct_Variable;                              // 0x0070(0x0020)(NoDestructor)
	class UUWEAbilityTask_WaitInputActionValue*   CallFunc_WaitInputActionValue_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakInputActionValue_X;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakInputActionValue_Y;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakInputActionValue_Z;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionValueType                         CallFunc_BreakInputActionValue_Type;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_2;   // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value_3;                        // 0x0100(0x0020)(NoDestructor)
	struct FInputActionValue                      K2Node_CustomEvent_Value_2;                        // 0x0120(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_3;   // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value_1;                        // 0x0150(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_4;   // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value;                          // 0x0180(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_5;   // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      Temp_struct_Variable_1;                            // 0x01B0(0x0020)(NoDestructor)
	class UUWEAbilityTask_WaitInputActionValue*   CallFunc_WaitInputActionValue_ReturnValue_1;       // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakInputActionValue_X_1;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakInputActionValue_Y_1;                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakInputActionValue_Z_1;                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionValueType                         CallFunc_BreakInputActionValue_Type_1;             // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bPossessed)>              K2Node_CreateDelegate_OutputDelegate_6;            // 0x01FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPossessed;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUWEAbilityTask_OnPossessedChanged*     CallFunc_WaitPossessedChanged_ReturnValue;         // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x023C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUWEAbilityTask_WaitTagRequirementsFailed* CallFunc_WaitTagRequirementsFailed_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_8;   // 0x025C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASN2PlayerController*                   CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_1;         // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue;                // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value_6;                        // 0x0310(0x0020)(NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_9;   // 0x0360(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDepth_Depth;                           // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B[0x5];                                      // 0x037B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDepth_Depth_1;                         // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C2[0x6];                                      // 0x03C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_CustomEvent_Value_7;                        // 0x03C8(0x0020)(NoDestructor)
	class ASN2BaseCharacter*                      CallFunc_GetCharacterFromAbilityActorInfo_ReturnValue_1; // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Swim_C_ExecuteUbergraph_GA_Swim;

// Function GA_Swim.GA_Swim_C.GetDepth
// 0x0100 (0x0100 - 0x0000)
struct GA_Swim_C_GetDepth final
{
public:
	double                                        Depth;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUWECharacterMovementComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceToWaterline_ReturnValue;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVolumeQueryResult                     CallFunc_QueryVolumes_Result;                      // 0x0060(0x0070)()
	TArray<TScriptInterface<class ITrackedVolume>> CallFunc_GetVolumeQueryResultVolumes_ReturnValue; // 0x00D0(0x0010)(ReferenceParm)
	float                                         CallFunc_GetDepth_ReturnValue;                     // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_Depth_ImplicitCast;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_Depth_ImplicitCast_1;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Swim_C_GetDepth;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
