#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Scan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Scan.GA_Scan_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_Scan_C : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 ScanActor;                                         // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEScannedActorsComponent*             ScannerToolComponent;                              // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_Scanner_C*                          ScannerTool;                                       // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   TemporaryComponentTag;                             // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ScanningGC;                                        // 0x0560(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Cancelled_A9BD8E4A48BB0F0AC224AEA7B80F4C16(const struct FUWETargetActor& HoverTarget);
	void ExecuteUbergraph_GA_Scan(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnCancelled_D22E6C2C4F34F79DF063E88A2D0679BA();
	void OnCompleted_06081C844D9452F92C4EDEAEF71D82C8();
	void OnCompleted_4D4C56EE4856436F5212A1B9EC406E3E();
	void OnCompleted_CCC8B0904527A2B56CDA759C9062494B();
	void OnCompleted_D22E6C2C4F34F79DF063E88A2D0679BA();
	void OnCompleted_E694113C4DA4AB7165E93BA9DE582FB4();
	void OnDepleted_5B0699EA46D0943CA2666EA12AC1A032();
	void OnFinish_52A65C49467972EA11C0D9B31E14FD6D();
	void OnFinish_7C21581242351E99FF6C17AC0747F945();
	void OnFinish_AAF4ACA14795BF090B6A38A814261075();
	void OnRelease_39C9C5084D86D6E78BD93A9EAD3217E7(float TimeHeld);
	void OnTagRequirementsFailed_BCBF30264651745FFD839DA38E4320EF();
	void OnTargetLost_28823A2F4F52C304AD2BA59A633197FA();
	void ValidData_A9BD8E4A48BB0F0AC224AEA7B80F4C16(const struct FUWETargetActor& HoverTarget);

	void Get_Sticky_Interaction_Values(double* MaxRange, double* MaxAngle) const;
	struct FAbilityInfoData GetActivateAbilityInfo() const;
	void IsHoverTargetScannableByMe(bool* Scannable, struct FGameplayTag* Reason) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Scan_C">();
	}
	static class UGA_Scan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Scan_C>();
	}
};

}

