#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_SonicResonator_AxumProjectile

#include "Basic.hpp"

#include "GA_SonicResonator_Blast_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SonicResonator_AxumProjectile.GA_SonicResonator_AxumProjectile_C
// 0x0000 (0x344A3000 - 0x344A3000)
class UGA_SonicResonator_AxumProjectile_C final : public UGA_SonicResonator_Blast_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_SonicResonator_AxumProjectile_C; // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Charged;                                           // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAbilityTask_WaitDelay*                 BaseChargeUpTask;                                  // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_SonicBubbleProjectile_C*            SpawnedProjectile;                                 // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Desired_Location;                                  // 0x05D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Fired;                                             // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyBlastSoundStimulus();
	void ApplyBlastStimulus();
	void BlastSonicBubble();
	void Cancelled_132CCCAD4A432E39BCC52BBAC3487E08(const struct FTransform& AimTransform);
	void DidNotSpawn_FB20E8F34DC273FBED3CE1BB708F4E28(class AActor* SpawnedActor);
	void ExecuteUbergraph_GA_SonicResonator_AxumProjectile(int32 EntryPoint);
	void GetBubbleData(class AActor** InstigatorAvatar, class AUWEBaseItem** FiringToolActor, float* BubbleSpeed, struct FVector* LaunchDirection, float* BubbleRange, float* BubbleSizeScalar, float* BubblePopRadius, struct FVector* DesiredLocation, struct FRotator* DesiredRotation, struct FVector* DesiredScale);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnCompleted_06EEB6A047582C11FF2DC190B27030BB();
	void OnFinish_7B011AA847E7F4565B353FBE0453FABD();
	void OnFireResonator();
	void OnSync_74FB743A4F8B2F0760ED4283A325F1D1();
	void Success_FB20E8F34DC273FBED3CE1BB708F4E28(class AActor* SpawnedActor);
	void TrySpawnProjectile();
	void UpdatePosition();
	void ValidData_132CCCAD4A432E39BCC52BBAC3487E08(const struct FTransform& AimTransform);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SonicResonator_AxumProjectile_C">();
	}
	static class UGA_SonicResonator_AxumProjectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SonicResonator_AxumProjectile_C>();
	}
};

}

