#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Squeeze

#include "Basic.hpp"

#include "UWEInterfaces_structs.hpp"


namespace SDK::Params
{

// Function GA_Squeeze.GA_Squeeze_C.ExecuteUbergraph_GA_Squeeze
// 0x0008 (0x0008 - 0x0000)
struct GA_Squeeze_C_ExecuteUbergraph_GA_Squeeze final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCost_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GA_Squeeze.GA_Squeeze_C.GetActivateAbilityInfo
// 0x00F8 (0x00F8 - 0x0000)
struct GA_Squeeze_C_GetActivateAbilityInfo final
{
public:
	struct FAbilityInfoData                       ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm)
	class FText                                   Text;                                              // 0x0068(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	const class UUWEItemType*                     CallFunc_GetTypeDataForSourceObject_ReturnValue;   // 0x0088(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAbilityInfoData                       K2Node_MakeStruct_AbilityInfoData;                 // 0x0090(0x0068)()
};

// Function GA_Squeeze.GA_Squeeze_C.GetValueSign
// 0x0030 (0x0030 - 0x0000)
struct GA_Squeeze_C_GetValueSign final
{
public:
	double                                        Number;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0020(0x0010)()
};

}

