#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_TadpoleWalk

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UWEInterfaces_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UWEVehicle_structs.hpp"


namespace SDK::Params
{

// Function GA_TadpoleWalk.GA_TadpoleWalk_C.ExecuteUbergraph_GA_TadpoleWalk
// 0x0288 (0x0288 - 0x0000)
struct GA_TadpoleWalk_C_ExecuteUbergraph_GA_TadpoleWalk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInputActionValue                      K2Node_CustomEvent_Value_2;                        // 0x0008(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate;     // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value_1;                        // 0x0038(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_1;   // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value;                          // 0x0068(0x0020)(NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_2;   // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      Temp_struct_Variable;                              // 0x0098(0x0020)(NoDestructor)
	class UUWEAbilityTask_WaitInputActionValue*   CallFunc_WaitInputActionValue_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        CallFunc_BreakInputActionValue_X;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakInputActionValue_Y;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakInputActionValue_Z;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionValueType                         CallFunc_BreakInputActionValue_Type;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bPossessed)>              K2Node_CreateDelegate_OutputDelegate_3;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPossessed;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAbilityTask_OnPossessedChanged*     CallFunc_WaitPossessedChanged_ReturnValue;         // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TDelegate<void(EUWEVehicleMovementType NewMovementType)> K2Node_CreateDelegate_OutputDelegate_4; // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x014C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAbilityTask_WaitTagRequirementsFailed* CallFunc_WaitTagRequirementsFailed_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ASN2PlayerController*                   CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_Value_3;                        // 0x0188(0x0020)(NoDestructor)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FInputActionValue& Value)> K2Node_CreateDelegate_OutputDelegate_6;   // 0x01E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASN2Tadpole*                            K2Node_DynamicCast_AsSN2Tadpole;                   // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUWEVehicleMovementType                       K2Node_CustomEvent_NewMovementType;                // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GA_TadpoleWalk.GA_TadpoleWalk_C.OnActionValue_F7BE841544089157CCF33B918DDFE40B
// 0x0020 (0x0020 - 0x0000)
struct GA_TadpoleWalk_C_OnActionValue_F7BE841544089157CCF33B918DDFE40B final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_TadpoleWalk.GA_TadpoleWalk_C.OnCompleted_F7BE841544089157CCF33B918DDFE40B
// 0x0020 (0x0020 - 0x0000)
struct GA_TadpoleWalk_C_OnCompleted_F7BE841544089157CCF33B918DDFE40B final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_TadpoleWalk.GA_TadpoleWalk_C.OnMovementTypeChanged_Event
// 0x0001 (0x0001 - 0x0000)
struct GA_TadpoleWalk_C_OnMovementTypeChanged_Event final
{
public:
	EUWEVehicleMovementType                       NewMovementType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GA_TadpoleWalk.GA_TadpoleWalk_C.OnOngoing_F7BE841544089157CCF33B918DDFE40B
// 0x0020 (0x0020 - 0x0000)
struct GA_TadpoleWalk_C_OnOngoing_F7BE841544089157CCF33B918DDFE40B final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_TadpoleWalk.GA_TadpoleWalk_C.OnPossessedChanged_619C91D3409B6A0B81E47FB327ED2315
// 0x0001 (0x0001 - 0x0000)
struct GA_TadpoleWalk_C_OnPossessedChanged_619C91D3409B6A0B81E47FB327ED2315 final
{
public:
	bool                                          bPossessed;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GA_TadpoleWalk.GA_TadpoleWalk_C.OnStarted_F7BE841544089157CCF33B918DDFE40B
// 0x0020 (0x0020 - 0x0000)
struct GA_TadpoleWalk_C_OnStarted_F7BE841544089157CCF33B918DDFE40B final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function GA_TadpoleWalk.GA_TadpoleWalk_C.GetActivateAbilityInfo
// 0x00E8 (0x00E8 - 0x0000)
struct GA_TadpoleWalk_C_GetActivateAbilityInfo final
{
public:
	struct FAbilityInfoData                       ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm)
	struct FAbilityInfoData                       K2Node_MakeStruct_AbilityInfoData;                 // 0x0068(0x0068)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASN2Tadpole*                            K2Node_DynamicCast_AsSN2Tadpole;                   // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

