#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_TemperatureAbsorption

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TemperatureAbsorption.GA_TemperatureAbsorption_C
// 0x344A2B00 (0x344A3038 - 0x0538)
class alignas(0x344A3038) UGA_TemperatureAbsorption_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            CurrentTemperatureEffect;                          // 0x0540(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          GaveHeatWarning;                                   // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEDialogueNode*                       NotAdapatedHeatWarning;                            // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEStoryGoal*                          DiscoveredHeatAdaptation_StoryGoal;                // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_TemperatureAbsorption(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnFinish_4F2D34654F7D4BDCDDA977A3ECC9B93C();
	void UpdateHeatProviders();
	void UpdateHeatWarnings();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TemperatureAbsorption_C">();
	}
	static class UGA_TemperatureAbsorption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TemperatureAbsorption_C>();
	}
};

}

