#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_TadpolePhotovoltaicCharger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TadpolePhotovoltaicCharger.GA_TadpolePhotovoltaicCharger_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_TadpolePhotovoltaicCharger_C final : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        SunlightTraceDistance;                             // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              GameplayEffectSpecHandle;                          // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         BaseEnergyGeneration;                              // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           Timer;                                             // 0x0560(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	float CalculatePowerGenerationScale();
	void CheckBlocked(bool* IsBlocked);
	void CheckBlockTimerEvent();
	void ExecuteUbergraph_GA_TadpolePhotovoltaicCharger(int32 EntryPoint);
	void GetTimeOfDayFraction(double* TOD);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TadpolePhotovoltaicCharger_C">();
	}
	static class UGA_TadpolePhotovoltaicCharger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TadpolePhotovoltaicCharger_C>();
	}
};

}

