#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_ThrowTool

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UWEAbilitySystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ThrowTool.GA_ThrowTool_C
// 0x344A2AC8 (0x344A3000 - 0x0538)
class alignas(0x344A3000) UGA_ThrowTool_C : public UUWEGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        DefaultThrowForceScalar;                           // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotToReEquip;                                     // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             Aim_Transform;                                     // 0x0550(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUWEBaseItem*                           DroppedItem;                                       // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUWEItemType*                           DroppedItemType;                                   // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotationAdjustment;                                // 0x05C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           ThrowGameplayCue;                                  // 0x05D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BaseUnderwaterThrowForce;                          // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BaseAirThrowForce;                                 // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ThrowCalled;                                       // 0x05F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddImpulse(class AUWEBaseItem* DroppedActor, const struct FVector& Direction);
	void Cancelled_F8D9B725419E339E3F45D3AC896D36BB(const struct FTransform& AimTransform);
	void ExecuteUbergraph_GA_ThrowTool(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnCompleted_1B80D0B84603FF20DE26CCA9F4E8D4FE();
	void OnFinish_A17ACE8A4EE5A743B35C93B55FA0BA83();
	void OnTasksDeactivated_7D046D424709C6C5B48E769E424D00BD();
	void Throw();
	void ValidData_F8D9B725419E339E3F45D3AC896D36BB(const struct FTransform& AimTransform);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_ThrowTool_C">();
	}
	static class UGA_ThrowTool_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ThrowTool_C>();
	}
};

}

