#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GameSettings

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GameSettings.GameSetting.GetDisplayNameVisibility
// 0x0001 (0x0001 - 0x0000)
struct GameSetting_GetDisplayNameVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSetting.GetDescriptionRichText
// 0x0010 (0x0010 - 0x0000)
struct GameSetting_GetDescriptionRichText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSetting.GetDevName
// 0x0008 (0x0008 - 0x0000)
struct GameSetting_GetDevName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSetting.GetDisplayName
// 0x0010 (0x0010 - 0x0000)
struct GameSetting_GetDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSetting.GetDynamicDetails
// 0x0010 (0x0010 - 0x0000)
struct GameSetting_GetDynamicDetails final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSetting.GetTags
// 0x0020 (0x0020 - 0x0000)
struct GameSetting_GetTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSetting.GetWarningRichText
// 0x0010 (0x0010 - 0x0000)
struct GameSetting_GetWarningRichText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingValueDiscrete.GetDiscreteOptionDefaultIndex
// 0x0004 (0x0004 - 0x0000)
struct GameSettingValueDiscrete_GetDiscreteOptionDefaultIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingValueDiscrete.GetDiscreteOptionIndex
// 0x0004 (0x0004 - 0x0000)
struct GameSettingValueDiscrete_GetDiscreteOptionIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingValueDiscrete.GetDiscreteOptions
// 0x0010 (0x0010 - 0x0000)
struct GameSettingValueDiscrete_GetDiscreteOptions final
{
public:
	TArray<class FText>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingDetailExtension.OnSettingAssigned
// 0x0008 (0x0008 - 0x0000)
struct GameSettingDetailExtension_OnSettingAssigned final
{
public:
	class UGameSetting*                           InSetting;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingDetailExtension.OnSettingValueChanged
// 0x0008 (0x0008 - 0x0000)
struct GameSettingDetailExtension_OnSettingValueChanged final
{
public:
	class UGameSetting*                           InSetting;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingListEntryBase.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct GameSettingListEntryBase_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingListEntrySetting_Scalar.HandleSliderValueChanged
// 0x0004 (0x0004 - 0x0000)
struct GameSettingListEntrySetting_Scalar_HandleSliderValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingListEntrySetting_Scalar.OnDefaultValueChanged
// 0x0004 (0x0004 - 0x0000)
struct GameSettingListEntrySetting_Scalar_OnDefaultValueChanged final
{
public:
	float                                         DefaultValue;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingListEntrySetting_Scalar.OnValueChanged
// 0x0004 (0x0004 - 0x0000)
struct GameSettingListEntrySetting_Scalar_OnValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingListEntrySetting_Action.OnSettingAssigned
// 0x0010 (0x0010 - 0x0000)
struct GameSettingListEntrySetting_Action_OnSettingAssigned final
{
public:
	class FText                                   ActionText;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingListEntrySetting_Navigation.OnSettingAssigned
// 0x0010 (0x0010 - 0x0000)
struct GameSettingListEntrySetting_Navigation_OnSettingAssigned final
{
public:
	class FText                                   ActionText;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingScreen.AttemptToPopNavigation
// 0x0001 (0x0001 - 0x0000)
struct GameSettingScreen_AttemptToPopNavigation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingScreen.GetSettingCollection
// 0x0018 (0x0018 - 0x0000)
struct GameSettingScreen_GetSettingCollection final
{
public:
	class FName                                   SettingDevName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasAnySettings;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UGameSettingCollection*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingScreen.NavigateToSetting
// 0x0008 (0x0008 - 0x0000)
struct GameSettingScreen_NavigateToSetting final
{
public:
	class FName                                   SettingDevName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingScreen.NavigateToSettings
// 0x0010 (0x0010 - 0x0000)
struct GameSettingScreen_NavigateToSettings final
{
public:
	TArray<class FName>                           SettingDevNames;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingScreen.OnSettingsDirtyStateChanged
// 0x0001 (0x0001 - 0x0000)
struct GameSettingScreen_OnSettingsDirtyStateChanged final
{
public:
	bool                                          bSettingsDirty;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingScreen.HaveSettingsBeenChanged
// 0x0001 (0x0001 - 0x0000)
struct GameSettingScreen_HaveSettingsBeenChanged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameSettingActionInterface.ExecuteActionForSetting
// 0x0018 (0x0018 - 0x0000)
struct GameSettingActionInterface_ExecuteActionForSetting final
{
public:
	struct FGameplayTag                           ActionTag;                                         // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameSetting*                           InSetting;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function GameSettings.GameSettingRotator.BP_OnDefaultOptionSpecified
// 0x0004 (0x0004 - 0x0000)
struct GameSettingRotator_BP_OnDefaultOptionSpecified final
{
public:
	int32                                         DefaultOptionIndex;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameSettings.GameResponsivePanel.AddChildToGameResponsivePanel
// 0x0010 (0x0010 - 0x0000)
struct GameResponsivePanel_AddChildToGameResponsivePanel final
{
public:
	class UWidget*                                Content;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameResponsivePanelSlot*               ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

