#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GameplayCameras

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "StateTreeModule_classes.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class GameplayCameras.BlueprintCameraEvaluationDataFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintCameraEvaluationDataFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BlendCameraEvaluationData(const struct FBlueprintCameraEvaluationDataRef& FromCameraData, const struct FBlueprintCameraEvaluationDataRef& ToCameraData, float Factor);
	static struct FBlueprintCameraPose GetCameraPose(const struct FBlueprintCameraEvaluationDataRef& CameraData);
	static struct FBlueprintCameraEvaluationDataRef MakeCameraEvaluationData();
	static void SetCameraPose(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FBlueprintCameraPose& CameraPose);
	static void SetDefaultCameraRigParameters(const struct FBlueprintCameraEvaluationDataRef& CameraData, const class UCameraRigAsset* CameraRig);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintCameraEvaluationDataFunctionLibrary">();
	}
	static class UBlueprintCameraEvaluationDataFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCameraEvaluationDataFunctionLibrary>();
	}
};

// Class GameplayCameras.BlueprintCameraVariableTableFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintCameraVariableTableFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetBooleanCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UBooleanCameraVariable* Variable);
	static double GetDoubleCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UDoubleCameraVariable* Variable);
	static float GetFloatCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UFloatCameraVariable* Variable);
	static int32 GetInteger32CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UInteger32CameraVariable* Variable);
	static struct FRotator GetRotatorCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class URotator3dCameraVariable* Variable);
	static struct FTransform GetTransformCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UTransform3dCameraVariable* Variable);
	static struct FVector2D GetVector2CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UVector2dCameraVariable* Variable);
	static struct FVector GetVector3CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UVector3dCameraVariable* Variable);
	static struct FVector4 GetVector4CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UVector4dCameraVariable* Variable);
	static void SetBooleanCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UBooleanCameraVariable* Variable, bool Value);
	static void SetDoubleCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UDoubleCameraVariable* Variable, double Value);
	static void SetFloatCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UFloatCameraVariable* Variable, float Value);
	static void SetInteger32CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UInteger32CameraVariable* Variable, int32 Value);
	static void SetRotatorCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class URotator3dCameraVariable* Variable, const struct FRotator& Value);
	static void SetTransformCameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UTransform3dCameraVariable* Variable, const struct FTransform& Value);
	static void SetVector2CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UVector2dCameraVariable* Variable, const struct FVector2D& Value);
	static void SetVector3CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UVector3dCameraVariable* Variable, const struct FVector& Value);
	static void SetVector4CameraVariable(const struct FBlueprintCameraEvaluationDataRef& CameraData, class UVector4dCameraVariable* Variable, const struct FVector4& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintCameraVariableTableFunctionLibrary">();
	}
	static class UBlueprintCameraVariableTableFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCameraVariableTableFunctionLibrary>();
	}
};

// Class GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintCameraContextDataTableFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* GetClassData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID);
	static uint8 GetEnumData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, const class UEnum* EnumType);
	static class FName GetNameData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID);
	static class UObject* GetObjectData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID);
	static class FString GetStringData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID);
	static struct FInstancedStruct GetStructData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, const class UScriptStruct* DataStructType);
	static bool SetClassData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, class UClass* Data);
	static bool SetEnumData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, const class UEnum* EnumType, uint8 Data);
	static bool SetNameData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, const class FName& Data);
	static bool SetObjectData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, class UObject* Data);
	static bool SetStringData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, const class FString& Data);
	static bool SetStructData(const struct FBlueprintCameraEvaluationDataRef& CameraData, const struct FCameraContextDataID& DataID, const struct FInstancedStruct& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintCameraContextDataTableFunctionLibrary">();
	}
	static class UBlueprintCameraContextDataTableFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCameraContextDataTableFunctionLibrary>();
	}
};

// Class GameplayCameras.HasCameraBuildStatus
// 0x0000 (0x0000 - 0x0000)
class IHasCameraBuildStatus final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HasCameraBuildStatus">();
	}
	static class IHasCameraBuildStatus* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHasCameraBuildStatus>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class GameplayCameras.CameraNode
// 0x0010 (0x0038 - 0x0028)
class UCameraNode : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bIsEnabled;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraNode">();
	}
	static class UCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraNode>();
	}
};

// Class GameplayCameras.CombinedCameraRigsCameraNode
// 0x0010 (0x0048 - 0x0038)
class UCombinedCameraRigsCameraNode final : public UCameraNode
{
public:
	TArray<struct FCameraRigAssetReference>       CameraRigReferences;                               // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CombinedCameraRigsCameraNode">();
	}
	static class UCombinedCameraRigsCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombinedCameraRigsCameraNode>();
	}
};

// Class GameplayCameras.Input1DCameraNode
// 0x0000 (0x0038 - 0x0038)
class UInput1DCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Input1DCameraNode">();
	}
	static class UInput1DCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInput1DCameraNode>();
	}
};

// Class GameplayCameras.CameraRigInput1DSlot
// 0x0050 (0x0088 - 0x0038)
class UCameraRigInput1DSlot final : public UInput1DCameraNode
{
public:
	struct FCameraRigInputSlotParameters          InputSlotParameters;                               // 0x0038(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FCameraParameterClamping               clamp;                                             // 0x0040(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameterNormalization          Normalize;                                         // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EBuiltInDoubleCameraVariable                  BuiltInVariable;                                   // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FDoubleCameraVariableReference         CustomVariable;                                    // 0x0070(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      TransientVariableID;                               // 0x0080(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCameraVariableID                      VariableID;                                        // 0x0084(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigInput1DSlot">();
	}
	static class UCameraRigInput1DSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigInput1DSlot>();
	}
};

// Class GameplayCameras.Input2DCameraNode
// 0x0000 (0x0038 - 0x0038)
class UInput2DCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Input2DCameraNode">();
	}
	static class UInput2DCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInput2DCameraNode>();
	}
};

// Class GameplayCameras.CameraRigInput2DSlot
// 0x0078 (0x00B0 - 0x0038)
class UCameraRigInput2DSlot : public UInput2DCameraNode
{
public:
	struct FCameraRigInputSlotParameters          InputSlotParameters;                               // 0x0038(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FCameraParameterClamping               ClampX;                                            // 0x0040(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameterClamping               ClampY;                                            // 0x0058(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameterNormalization          NormalizeX;                                        // 0x0070(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameterNormalization          NormalizeY;                                        // 0x0080(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EBuiltInVector2dCameraVariable                BuiltInVariable;                                   // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector2dCameraVariableReference       CustomVariable;                                    // 0x0098(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      TransientVariableID;                               // 0x00A8(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCameraVariableID                      VariableID;                                        // 0x00AC(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigInput2DSlot">();
	}
	static class UCameraRigInput2DSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigInput2DSlot>();
	}
};

// Class GameplayCameras.CameraRigInstanceFunctions
// 0x0000 (0x0028 - 0x0028)
class UCameraRigInstanceFunctions final : public UBlueprintFunctionLibrary
{
public:
	static bool IsValid(const struct FCameraRigInstanceID& InstanceId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigInstanceFunctions">();
	}
	static class UCameraRigInstanceFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigInstanceFunctions>();
	}
};

// Class GameplayCameras.ShakeCameraNode
// 0x0000 (0x0038 - 0x0038)
class UShakeCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ShakeCameraNode">();
	}
	static class UShakeCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShakeCameraNode>();
	}
};

// Class GameplayCameras.CompositeShakeCameraNode
// 0x0010 (0x0048 - 0x0038)
class UCompositeShakeCameraNode final : public UShakeCameraNode
{
public:
	TArray<class UShakeCameraNode*>               Shakes;                                            // 0x0038(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompositeShakeCameraNode">();
	}
	static class UCompositeShakeCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompositeShakeCameraNode>();
	}
};

// Class GameplayCameras.EnvelopeShakeCameraNode
// 0x0038 (0x0070 - 0x0038)
class UEnvelopeShakeCameraNode final : public UShakeCameraNode
{
public:
	struct FFloatCameraParameter                  EaseInTime;                                        // 0x0038(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  EaseOutTime;                                       // 0x0048(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  TotalTime;                                         // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class UShakeCameraNode*                       Shake;                                             // 0x0068(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvelopeShakeCameraNode">();
	}
	static class UEnvelopeShakeCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvelopeShakeCameraNode>();
	}
};

// Class GameplayCameras.GameplayCameraParameterSetterComponent
// 0x0140 (0x0200 - 0x00C0)
class UGameplayCameraParameterSetterComponent final : public UActorComponent
{
public:
	struct FCameraRigAssetReference               CameraRigReference;                                // 0x00C0(0x0120)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x01E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x01E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraVariableSetterBlendType                BlendType;                                         // 0x01E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E9[0x17];                                     // 0x01E9(0x0017)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnActorBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnActorEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void StartParameterSetters();
	void StopParameterSetters(bool bImmediately);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCameraParameterSetterComponent">();
	}
	static class UGameplayCameraParameterSetterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCameraParameterSetterComponent>();
	}
};

// Class GameplayCameras.GameplayCamerasPlayerCameraManager
// 0x0908 (0x30E0 - 0x27D8)
class AGameplayCamerasPlayerCameraManager final : public APlayerCameraManager
{
public:
	uint8                                         Pad_27D8[0x18];                                    // 0x27D8(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	EGameplayCamerasViewRotationMode              ViewRotationMode;                                  // 0x27F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideViewRotationMode;                         // 0x27F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27F5[0x3];                                     // 0x27F5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class APlayerCameraManager*                   OriginalCameraManager;                             // 0x27F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2800[0x8E0];                                   // 0x2800(0x08E0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void ReleasePlayerController();
	struct FCameraRigInstanceID StartGlobalCameraModifierRig(const class UCameraRigAsset* CameraRig, int32 OrderKey);
	struct FCameraRigInstanceID StartVisualCameraModifierRig(const class UCameraRigAsset* CameraRig, int32 OrderKey);
	void StealPlayerController(class APlayerController* PlayerController);
	void StopCameraModifierRig(const struct FCameraRigInstanceID& InstanceId, bool bImmediately);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCamerasPlayerCameraManager">();
	}
	static class AGameplayCamerasPlayerCameraManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayCamerasPlayerCameraManager>();
	}
};

// Class GameplayCameras.BlendCameraNode
// 0x0000 (0x0038 - 0x0038)
class UBlendCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendCameraNode">();
	}
	static class UBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendCameraNode>();
	}
};

// Class GameplayCameras.SimpleBlendCameraNode
// 0x0000 (0x0038 - 0x0038)
class USimpleBlendCameraNode : public UBlendCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleBlendCameraNode">();
	}
	static class USimpleBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleBlendCameraNode>();
	}
};

// Class GameplayCameras.ViewTargetTransitionParamsBlendCameraNode
// 0x0010 (0x0048 - 0x0038)
class UViewTargetTransitionParamsBlendCameraNode final : public USimpleBlendCameraNode
{
public:
	struct FViewTargetTransitionParams            TransitionParams;                                  // 0x0038(0x0010)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViewTargetTransitionParamsBlendCameraNode">();
	}
	static class UViewTargetTransitionParamsBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViewTargetTransitionParamsBlendCameraNode>();
	}
};

// Class GameplayCameras.UpdateTrackerCameraNode
// 0x0040 (0x0078 - 0x0038)
class UUpdateTrackerCameraNode final : public UCameraNode
{
public:
	struct FDoubleCameraParameter                 DoubleParameter;                                   // 0x0038(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector3dCameraParameter               VectorParameter;                                   // 0x0050(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UpdateTrackerCameraNode">();
	}
	static class UUpdateTrackerCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUpdateTrackerCameraNode>();
	}
};

// Class GameplayCameras.AssetReferenceCameraNode
// 0x0000 (0x0000 - 0x0000)
class IAssetReferenceCameraNode final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetReferenceCameraNode">();
	}
	static class IAssetReferenceCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAssetReferenceCameraNode>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class GameplayCameras.CustomCameraNodeParameterProvider
// 0x0000 (0x0000 - 0x0000)
class ICustomCameraNodeParameterProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomCameraNodeParameterProvider">();
	}
	static class ICustomCameraNodeParameterProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICustomCameraNodeParameterProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class GameplayCameras.GameplayCameraSystemHost
// 0x0000 (0x0000 - 0x0000)
class IGameplayCameraSystemHost final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCameraSystemHost">();
	}
	static class IGameplayCameraSystemHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameplayCameraSystemHost>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class GameplayCameras.InputAxisBinding2DCameraNode
// 0x0050 (0x0100 - 0x00B0)
class UInputAxisBinding2DCameraNode final : public UCameraRigInput2DSlot
{
public:
	TArray<class UInputAction*>                   AxisActions;                                       // 0x00B0(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FBooleanCameraParameter                RevertAxisX;                                       // 0x00C0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBooleanCameraParameter                RevertAxisY;                                       // 0x00D0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2dCameraParameter               Multiplier;                                        // 0x00E0(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputAxisBinding2DCameraNode">();
	}
	static class UInputAxisBinding2DCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputAxisBinding2DCameraNode>();
	}
};

// Class GameplayCameras.ObjectTreeGraphObject
// 0x0000 (0x0000 - 0x0000)
class IObjectTreeGraphObject final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectTreeGraphObject">();
	}
	static class IObjectTreeGraphObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IObjectTreeGraphObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class GameplayCameras.ObjectTreeGraphRootObject
// 0x0000 (0x0000 - 0x0000)
class IObjectTreeGraphRootObject final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectTreeGraphRootObject">();
	}
	static class IObjectTreeGraphRootObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IObjectTreeGraphRootObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class GameplayCameras.PerlinNoiseLocationShakeCameraNode
// 0x0048 (0x0080 - 0x0038)
class UPerlinNoiseLocationShakeCameraNode final : public UShakeCameraNode
{
public:
	struct FFloatCameraParameter                  AmplitudeMultiplier;                               // 0x0038(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  FrequencyMultiplier;                               // 0x0048(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FInteger32CameraParameter              Octaves;                                           // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseData                       X;                                                 // 0x0068(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseData                       Y;                                                 // 0x0070(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseData                       Z;                                                 // 0x0078(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PerlinNoiseLocationShakeCameraNode">();
	}
	static class UPerlinNoiseLocationShakeCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerlinNoiseLocationShakeCameraNode>();
	}
};

// Class GameplayCameras.PerlinNoiseRotationShakeCameraNode
// 0x0048 (0x0080 - 0x0038)
class UPerlinNoiseRotationShakeCameraNode final : public UShakeCameraNode
{
public:
	struct FFloatCameraParameter                  AmplitudeMultiplier;                               // 0x0038(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  FrequencyMultiplier;                               // 0x0048(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FInteger32CameraParameter              Octaves;                                           // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseData                       Yaw;                                               // 0x0068(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseData                       Pitch;                                             // 0x0070(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseData                       Roll;                                              // 0x0078(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PerlinNoiseRotationShakeCameraNode">();
	}
	static class UPerlinNoiseRotationShakeCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerlinNoiseRotationShakeCameraNode>();
	}
};

// Class GameplayCameras.BaseCameraObject
// 0x0080 (0x00A8 - 0x0028)
class UBaseCameraObject : public UObject
{
public:
	struct FCameraObjectInterface                 Interface;                                         // 0x0028(0x0030)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FCameraObjectAllocationInfo            AllocationInfo;                                    // 0x0060(0x0028)(NativeAccessSpecifierPublic)
	struct FInstancedPropertyBag                  DefaultParameters;                                 // 0x0088(0x0010)(NativeAccessSpecifierPrivate)
	TArray<struct FCameraObjectInterfaceParameterDefinition> ParameterDefinitions;                   // 0x0098(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseCameraObject">();
	}
	static class UBaseCameraObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCameraObject>();
	}
};

// Class GameplayCameras.BlendStackCameraNode
// 0x0008 (0x0040 - 0x0038)
class UBlendStackCameraNode final : public UCameraNode
{
public:
	ECameraBlendStackType                         BlendStackType;                                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraRigLayer                               Layer;                                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendStackCameraNode">();
	}
	static class UBlendStackCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackCameraNode>();
	}
};

// Class GameplayCameras.BlendStackRootCameraNode
// 0x0010 (0x0048 - 0x0038)
class UBlendStackRootCameraNode final : public UCameraNode
{
public:
	class UBlendCameraNode*                       Blend;                                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraNode*                            RootNode;                                          // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendStackRootCameraNode">();
	}
	static class UBlendStackRootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackRootCameraNode>();
	}
};

// Class GameplayCameras.CameraAsset
// 0x00B0 (0x00D8 - 0x0028)
class UCameraAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	class UCameraDirector*                        CameraDirector;                                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UCameraRigTransition*>           EnterTransitions;                                  // 0x0050(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UCameraRigTransition*>           ExitTransitions;                                   // 0x0060(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	ECameraBuildStatus                            BuildStatus;                                       // 0x0070(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FInstancedPropertyBag                  DefaultParameters;                                 // 0x0078(0x0010)(NativeAccessSpecifierPrivate)
	TArray<struct FCameraObjectInterfaceParameterDefinition> ParameterDefinitions;                   // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UCameraRigAsset*>                ParameterOwners;                                   // 0x0098(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FCameraAssetAllocationInfo             AllocationInfo;                                    // 0x00A8(0x0020)(NativeAccessSpecifierPrivate)
	TArray<class UCameraRigAsset*>                CameraRigs;                                        // 0x00C8(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraAsset">();
	}
	static class UCameraAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraAsset>();
	}
};

// Class GameplayCameras.CameraDirector
// 0x0018 (0x0040 - 0x0028)
class UCameraDirector : public UObject
{
public:
	struct FCameraRigProxyRedirectTable           CameraRigProxyRedirectTable;                       // 0x0028(0x0010)(Edit, NativeAccessSpecifierPublic)
	class UCameraRigProxyTable*                   CameraRigProxyTable;                               // 0x0038(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraDirector">();
	}
	static class UCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraDirector>();
	}
};

// Class GameplayCameras.CameraObjectInterfaceParameterBase
// 0x0038 (0x0060 - 0x0028)
class UCameraObjectInterfaceParameterBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 InterfaceParameterName;                            // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraNode*                            Target;                                            // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetPropertyName;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraObjectInterfaceParameterBase">();
	}
	static class UCameraObjectInterfaceParameterBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraObjectInterfaceParameterBase>();
	}
};

// Class GameplayCameras.CameraObjectInterfaceBlendableParameter
// 0x0020 (0x0080 - 0x0060)
class UCameraObjectInterfaceBlendableParameter final : public UCameraObjectInterfaceParameterBase
{
public:
	ECameraVariableType                           ParameterType;                                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UScriptStruct*                          BlendableStructType;                               // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPreBlended;                                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FCameraVariableID                      PrivateVariableID;                                 // 0x0074(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraVariableAsset*                   PrivateVariable;                                   // 0x0078(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraObjectInterfaceBlendableParameter">();
	}
	static class UCameraObjectInterfaceBlendableParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraObjectInterfaceBlendableParameter>();
	}
};

// Class GameplayCameras.CameraObjectInterfaceDataParameter
// 0x0018 (0x0078 - 0x0060)
class UCameraObjectInterfaceDataParameter final : public UCameraObjectInterfaceParameterBase
{
public:
	ECameraContextDataType                        DataType;                                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraContextDataContainerType               DataContainerType;                                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                DataTypeObject;                                    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   PrivateDataID;                                     // 0x0070(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraObjectInterfaceDataParameter">();
	}
	static class UCameraObjectInterfaceDataParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraObjectInterfaceDataParameter>();
	}
};

// Class GameplayCameras.CameraRigAsset
// 0x0080 (0x0128 - 0x00A8)
class UCameraRigAsset final : public UBaseCameraObject
{
public:
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	class UCameraNode*                            RootNode;                                          // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x00D0(0x0020)(Edit, NativeAccessSpecifierPublic)
	TArray<class UCameraRigTransition*>           EnterTransitions;                                  // 0x00F0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UCameraRigTransition*>           ExitTransitions;                                   // 0x0100(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	ECameraRigInitialOrientation                  InitialOrientation;                                // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraBuildStatus                            BuildStatus;                                       // 0x0114(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGuid                                  Guid;                                              // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigAsset">();
	}
	static class UCameraRigAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigAsset>();
	}
};

// Class GameplayCameras.CameraRigProxyAsset
// 0x0010 (0x0038 - 0x0028)
class UCameraRigProxyAsset final : public UObject
{
public:
	struct FGuid                                  Guid;                                              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigProxyAsset">();
	}
	static class UCameraRigProxyAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigProxyAsset>();
	}
};

// Class GameplayCameras.CameraRigProxyTable
// 0x0010 (0x0038 - 0x0028)
class UCameraRigProxyTable final : public UObject
{
public:
	TArray<struct FCameraRigProxyRedirectTableEntry> Entries;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigProxyTable">();
	}
	static class UCameraRigProxyTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigProxyTable>();
	}
};

// Class GameplayCameras.CameraRigTransitionCondition
// 0x0008 (0x0030 - 0x0028)
class UCameraRigTransitionCondition : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigTransitionCondition">();
	}
	static class UCameraRigTransitionCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigTransitionCondition>();
	}
};

// Class GameplayCameras.CameraRigTransition
// 0x0028 (0x0050 - 0x0028)
class UCameraRigTransition final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UCameraRigTransitionCondition*>  Conditions;                                        // 0x0030(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class UBlendCameraNode*                       Blend;                                             // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraRigInitialOrientation                  InitialOrientation;                                // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideInitialOrientation;                       // 0x004C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowCameraRigMerging;                            // 0x004D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigTransition">();
	}
	static class UCameraRigTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigTransition>();
	}
};

// Class GameplayCameras.CameraShakeAsset
// 0x0048 (0x00F0 - 0x00A8)
class UCameraShakeAsset final : public UBaseCameraObject
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	class UShakeCameraNode*                       RootNode;                                          // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USimpleFixedTimeBlendCameraNode*        BlendIn;                                           // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USimpleFixedTimeBlendCameraNode*        BlendOut;                                          // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSingleInstance;                                 // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraBuildStatus                            BuildStatus;                                       // 0x00D9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGuid                                  Guid;                                              // 0x00DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraShakeAsset">();
	}
	static class UCameraShakeAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraShakeAsset>();
	}
};

// Class GameplayCameras.CameraValueInterpolator
// 0x0000 (0x0028 - 0x0028)
class UCameraValueInterpolator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraValueInterpolator">();
	}
	static class UCameraValueInterpolator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraValueInterpolator>();
	}
};

// Class GameplayCameras.PopValueInterpolator
// 0x0000 (0x0028 - 0x0028)
class UPopValueInterpolator final : public UCameraValueInterpolator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PopValueInterpolator">();
	}
	static class UPopValueInterpolator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPopValueInterpolator>();
	}
};

// Class GameplayCameras.CameraVariableAsset
// 0x0018 (0x0040 - 0x0028)
class UCameraVariableAsset : public UObject
{
public:
	bool                                          bAutoReset;                                        // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPrivate;                                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInput;                                          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGuid                                  Guid;                                              // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraVariableAsset">();
	}
	static class UCameraVariableAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraVariableAsset>();
	}
};

// Class GameplayCameras.BooleanCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UBooleanCameraVariable final : public UCameraVariableAsset
{
public:
	bool                                          bDefaultValue;                                     // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BooleanCameraVariable">();
	}
	static class UBooleanCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBooleanCameraVariable>();
	}
};

// Class GameplayCameras.Integer32CameraVariable
// 0x0008 (0x0048 - 0x0040)
class UInteger32CameraVariable final : public UCameraVariableAsset
{
public:
	int32                                         DefaultValue;                                      // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Integer32CameraVariable">();
	}
	static class UInteger32CameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteger32CameraVariable>();
	}
};

// Class GameplayCameras.FloatCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UFloatCameraVariable final : public UCameraVariableAsset
{
public:
	float                                         DefaultValue;                                      // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FloatCameraVariable">();
	}
	static class UFloatCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloatCameraVariable>();
	}
};

// Class GameplayCameras.DoubleCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UDoubleCameraVariable final : public UCameraVariableAsset
{
public:
	double                                        DefaultValue;                                      // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DoubleCameraVariable">();
	}
	static class UDoubleCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDoubleCameraVariable>();
	}
};

// Class GameplayCameras.Vector2fCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UVector2fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector2f                              DefaultValue;                                      // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector2fCameraVariable">();
	}
	static class UVector2fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector2fCameraVariable>();
	}
};

// Class GameplayCameras.Vector2dCameraVariable
// 0x0010 (0x0050 - 0x0040)
class UVector2dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector2D                              DefaultValue;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector2dCameraVariable">();
	}
	static class UVector2dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector2dCameraVariable>();
	}
};

// Class GameplayCameras.Vector3fCameraVariable
// 0x0010 (0x0050 - 0x0040)
class UVector3fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector3f                              DefaultValue;                                      // 0x0040(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector3fCameraVariable">();
	}
	static class UVector3fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector3fCameraVariable>();
	}
};

// Class GameplayCameras.Vector3dCameraVariable
// 0x0018 (0x0058 - 0x0040)
class UVector3dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector3d                              DefaultValue;                                      // 0x0040(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector3dCameraVariable">();
	}
	static class UVector3dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector3dCameraVariable>();
	}
};

// Class GameplayCameras.Vector4fCameraVariable
// 0x0010 (0x0050 - 0x0040)
class UVector4fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector4f                              DefaultValue;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector4fCameraVariable">();
	}
	static class UVector4fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector4fCameraVariable>();
	}
};

// Class GameplayCameras.Vector4dCameraVariable
// 0x0020 (0x0060 - 0x0040)
class UVector4dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector4d                              DefaultValue;                                      // 0x0040(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector4dCameraVariable">();
	}
	static class UVector4dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector4dCameraVariable>();
	}
};

// Class GameplayCameras.Rotator3fCameraVariable
// 0x0010 (0x0050 - 0x0040)
class URotator3fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FRotator3f                             DefaultValue;                                      // 0x0040(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Rotator3fCameraVariable">();
	}
	static class URotator3fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<URotator3fCameraVariable>();
	}
};

// Class GameplayCameras.Rotator3dCameraVariable
// 0x0018 (0x0058 - 0x0040)
class URotator3dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FRotator3d                             DefaultValue;                                      // 0x0040(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Rotator3dCameraVariable">();
	}
	static class URotator3dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<URotator3dCameraVariable>();
	}
};

// Class GameplayCameras.Transform3fCameraVariable
// 0x0030 (0x0070 - 0x0040)
class UTransform3fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FTransform3f                           DefaultValue;                                      // 0x0040(0x0030)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Transform3fCameraVariable">();
	}
	static class UTransform3fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransform3fCameraVariable>();
	}
};

// Class GameplayCameras.Transform3dCameraVariable
// 0x0060 (0x00A0 - 0x0040)
class UTransform3dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FTransform3d                           DefaultValue;                                      // 0x0040(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Transform3dCameraVariable">();
	}
	static class UTransform3dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransform3dCameraVariable>();
	}
};

// Class GameplayCameras.CameraVariableCollection
// 0x0010 (0x0038 - 0x0028)
class UCameraVariableCollection final : public UObject
{
public:
	TArray<class UCameraVariableAsset*>           Variables;                                         // 0x0028(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraVariableCollection">();
	}
	static class UCameraVariableCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraVariableCollection>();
	}
};

// Class GameplayCameras.RootCameraNode
// 0x0000 (0x0038 - 0x0038)
class URootCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RootCameraNode">();
	}
	static class URootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootCameraNode>();
	}
};

// Class GameplayCameras.DefaultRootCameraNode
