#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GC_Player_InVoid

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "UWEGameplayCues_structs.hpp"


namespace SDK::Params
{

// Function GC_Player_InVoid.GC_Player_InVoid_C.ExecuteUbergraph_GC_Player_InVoid
// 0x0578 (0x0578 - 0x0000)
struct GC_Player_InVoid_C_ExecuteUbergraph_GC_Player_InVoid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FUWEGameplayCueNotify_SpawnResult      K2Node_Event_SpawnResults;                         // 0x00E8(0x00F0)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_2;                             // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x01E0(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FUWEGameplayCueNotify_SpawnResult      K2Node_Event_SpawnResults_2;                       // 0x02B8(0x00F0)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x03B0(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FUWEGameplayCueNotify_SpawnResult      K2Node_Event_SpawnResults_1;                       // 0x0488(0x00F0)(ConstParm, ContainsInstancedReference)
};

// Function GC_Player_InVoid.GC_Player_InVoid_C.OnApplication
// 0x01D0 (0x01D0 - 0x0000)
struct GC_Player_InVoid_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FUWEGameplayCueNotify_SpawnResult      SpawnResults;                                      // 0x00E0(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};

// Function GC_Player_InVoid.GC_Player_InVoid_C.OnRecurring
// 0x01D0 (0x01D0 - 0x0000)
struct GC_Player_InVoid_C_OnRecurring final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FUWEGameplayCueNotify_SpawnResult      SpawnResults;                                      // 0x00E0(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};

// Function GC_Player_InVoid.GC_Player_InVoid_C.OnRemoval
// 0x01D0 (0x01D0 - 0x0000)
struct GC_Player_InVoid_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FUWEGameplayCueNotify_SpawnResult      SpawnResults;                                      // 0x00E0(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};

}

