#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GPP

#include "Basic.hpp"

#include "GPP_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GPP.AccelByteGameTelemetrySaveData_NoNameEncryption
// 0x0020 (0x0048 - 0x0028)
class UAccelByteGameTelemetrySaveData_NoNameEncryption final : public USaveGame
{
public:
	TArray<struct FAccelByteModelsTelemetrySaveData_NoNameEncryption> OfflineData;                   // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class FString                                 SlotName;                                          // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccelByteGameTelemetrySaveData_NoNameEncryption">();
	}
	static class UAccelByteGameTelemetrySaveData_NoNameEncryption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccelByteGameTelemetrySaveData_NoNameEncryption>();
	}
};

// Class GPP.AccelByteGameTelemetryOfflineSave_NoNameEncryption
// 0x0020 (0x0048 - 0x0028)
class UAccelByteGameTelemetryOfflineSave_NoNameEncryption final : public USaveGame
{
public:
	int32                                         IncrementId;                                       // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FAccelByteModelsGameTelemetrySaveSlot_NoNameEncryption> Slots;                     // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	class UAccelByteGameTelemetrySaveData_NoNameEncryption* LastSlot;                                // 0x0040(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccelByteGameTelemetryOfflineSave_NoNameEncryption">();
	}
	static class UAccelByteGameTelemetryOfflineSave_NoNameEncryption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccelByteGameTelemetryOfflineSave_NoNameEncryption>();
	}
};

// Class GPP.GPPGuestUserIdInfo
// 0x0010 (0x0038 - 0x0028)
class UGPPGuestUserIdInfo final : public USaveGame
{
public:
	class FString                                 ID;                                                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GPPGuestUserIdInfo">();
	}
	static class UGPPGuestUserIdInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPPGuestUserIdInfo>();
	}
};

// Class GPP.GPPLastLoggedInfo_NoNameEncryption
// 0x0048 (0x0070 - 0x0028)
class UGPPLastLoggedInfo_NoNameEncryption final : public USaveGame
{
public:
	struct FGPPLastLoggedInfoModel_NoNameEncryption Model;                                           // 0x0028(0x0048)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GPPLastLoggedInfo_NoNameEncryption">();
	}
	static class UGPPLastLoggedInfo_NoNameEncryption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPPLastLoggedInfo_NoNameEncryption>();
	}
};

// Class GPP.LastAppVersionInfoModel_NoNameEncryption
// 0x0010 (0x0038 - 0x0028)
class ULastAppVersionInfoModel_NoNameEncryption final : public USaveGame
{
public:
	class FString                                 LatestVersion;                                     // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LastAppVersionInfoModel_NoNameEncryption">();
	}
	static class ULastAppVersionInfoModel_NoNameEncryption* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULastAppVersionInfoModel_NoNameEncryption>();
	}
};

}

