#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: HairStrandsDeformer

#include "Basic.hpp"

#include "HairStrandsDeformer_structs.hpp"
#include "OptimusCore_classes.hpp"
#include "ComputeFramework_classes.hpp"


namespace SDK
{

// Class HairStrandsDeformer.OptimusGroomAttributeReadDataInterface
// 0x0020 (0x0048 - 0x0028)
class UOptimusGroomAttributeReadDataInterface final : public UOptimusComputeDataInterface
{
public:
	class FName                                   GroomAttributeName;                                // 0x0028(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EOptimusGroomExecDomain                       GroomAttributeGroup;                               // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EOptimusGroomAttributeTypes                   GroomAttributeType;                                // 0x0031(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_32[0x16];                                      // 0x0032(0x0016)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomAttributeReadDataInterface">();
	}
	static class UOptimusGroomAttributeReadDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomAttributeReadDataInterface>();
	}
};

// Class HairStrandsDeformer.OptimusGroomAttributeReadDataProvider
// 0x0018 (0x0040 - 0x0028)
class UOptimusGroomAttributeReadDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroomAttributeName;                                // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOptimusGroomExecDomain                       GroomAttributeGroup;                               // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOptimusGroomAttributeTypes                   GroomAttributeType;                                // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomAttributeReadDataProvider">();
	}
	static class UOptimusGroomAttributeReadDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomAttributeReadDataProvider>();
	}
};

// Class HairStrandsDeformer.OptimusGroomExecDataInterface
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomExecDataInterface final : public UOptimusComputeDataInterface
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	EOptimusGroomExecDomain                       Domain;                                            // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomExecDataInterface">();
	}
	static class UOptimusGroomExecDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomExecDataInterface>();
	}
};

// Class HairStrandsDeformer.OptimusGroomExecDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomExecDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOptimusGroomExecDomain                       Domain;                                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomExecDataProvider">();
	}
	static class UOptimusGroomExecDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomExecDataProvider>();
	}
};

// Class HairStrandsDeformer.OptimusGroomAssetComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomAssetComponentSource final : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomAssetComponentSource">();
	}
	static class UOptimusGroomAssetComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomAssetComponentSource>();
	}
};

// Class HairStrandsDeformer.OptimusGroomSolverComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomSolverComponentSource final : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomSolverComponentSource">();
	}
	static class UOptimusGroomSolverComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomSolverComponentSource>();
	}
};

// Class HairStrandsDeformer.OptimusGroomGuidesReadDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomGuidesReadDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomGuidesReadDataInterface">();
	}
	static class UOptimusGroomGuidesReadDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomGuidesReadDataInterface>();
	}
};

// Class HairStrandsDeformer.OptimusGroomGuidesReadDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusGroomGuidesReadDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomGuidesReadDataProvider">();
	}
	static class UOptimusGroomGuidesReadDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomGuidesReadDataProvider>();
	}
};

// Class HairStrandsDeformer.OptimusGroomGuidesWriteDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomGuidesWriteDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomGuidesWriteDataInterface">();
	}
	static class UOptimusGroomGuidesWriteDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomGuidesWriteDataInterface>();
	}
};

// Class HairStrandsDeformer.OptimusGroomGuidesWriteDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomGuidesWriteDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomGuidesWriteDataProvider">();
	}
	static class UOptimusGroomGuidesWriteDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomGuidesWriteDataProvider>();
	}
};

// Class HairStrandsDeformer.OptimusGroomMeshesReadDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomMeshesReadDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomMeshesReadDataInterface">();
	}
	static class UOptimusGroomMeshesReadDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomMeshesReadDataInterface>();
	}
};

// Class HairStrandsDeformer.OptimusGroomMeshesReadDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusGroomMeshesReadDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomMeshesReadDataProvider">();
	}
	static class UOptimusGroomMeshesReadDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomMeshesReadDataProvider>();
	}
};

// Class HairStrandsDeformer.OptimusGroomSolverReadDataInterface
// 0x0008 (0x0030 - 0x0028)
class UOptimusGroomSolverReadDataInterface final : public UOptimusComputeDataInterface
{
public:
	class FName                                   ResetSimulationTrigger;                            // 0x0028(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomSolverReadDataInterface">();
	}
	static class UOptimusGroomSolverReadDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomSolverReadDataInterface>();
	}
};

// Class HairStrandsDeformer.OptimusGroomSolverReadDataProvider
// 0x0028 (0x0050 - 0x0028)
class UOptimusGroomSolverReadDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UGroomSolverComponent*                  SolverComponent;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOptimusDeformerInstance*               DeformerInstance;                                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomSolverReadDataProvider">();
	}
	static class UOptimusGroomSolverReadDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomSolverReadDataProvider>();
	}
};

// Class HairStrandsDeformer.OptimusGroomStrandsReadDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomStrandsReadDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomStrandsReadDataInterface">();
	}
	static class UOptimusGroomStrandsReadDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomStrandsReadDataInterface>();
	}
};

// Class HairStrandsDeformer.OptimusGroomStrandsReadDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusGroomStrandsReadDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomStrandsReadDataProvider">();
	}
	static class UOptimusGroomStrandsReadDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomStrandsReadDataProvider>();
	}
};

// Class HairStrandsDeformer.OptimusGroomStrandsWriteDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomStrandsWriteDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomStrandsWriteDataInterface">();
	}
	static class UOptimusGroomStrandsWriteDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomStrandsWriteDataInterface>();
	}
};

// Class HairStrandsDeformer.OptimusGroomStrandsWriteDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomStrandsWriteDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomStrandsWriteDataProvider">();
	}
	static class UOptimusGroomStrandsWriteDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomStrandsWriteDataProvider>();
	}
};

}

