#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: IrisCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "IrisCore_structs.hpp"


namespace SDK
{

// Class IrisCore.NetObjectFilterConfig
// 0x0000 (0x0028 - 0x0028)
class UNetObjectFilterConfig : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectFilterConfig">();
	}
	static class UNetObjectFilterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectFilterConfig>();
	}
};

// Class IrisCore.AlwaysRelevantNetObjectFilterConfig
// 0x0000 (0x0028 - 0x0028)
class UAlwaysRelevantNetObjectFilterConfig final : public UNetObjectFilterConfig
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlwaysRelevantNetObjectFilterConfig">();
	}
	static class UAlwaysRelevantNetObjectFilterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlwaysRelevantNetObjectFilterConfig>();
	}
};

// Class IrisCore.NetObjectFilter
// 0x0038 (0x0060 - 0x0028)
class UNetObjectFilter : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectFilter">();
	}
	static class UNetObjectFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectFilter>();
	}
};

// Class IrisCore.AlwaysRelevantNetObjectFilter
// 0x0000 (0x0060 - 0x0060)
class UAlwaysRelevantNetObjectFilter final : public UNetObjectFilter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlwaysRelevantNetObjectFilter">();
	}
	static class UAlwaysRelevantNetObjectFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlwaysRelevantNetObjectFilter>();
	}
};

// Class IrisCore.DataStream
// 0x0028 (0x0050 - 0x0028)
class UDataStream : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataStream">();
	}
	static class UDataStream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataStream>();
	}
};

// Class IrisCore.ChunkedDataStream
// 0x0018 (0x0068 - 0x0050)
class UChunkedDataStream final : public UDataStream
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class UIrisObjectReferencePackageMap*         PackageMap;                                        // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChunkedDataStream">();
	}
	static class UChunkedDataStream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChunkedDataStream>();
	}
};

// Class IrisCore.DataStreamDefinitions
// 0x0018 (0x0040 - 0x0028)
class UDataStreamDefinitions final : public UObject
{
public:
	TArray<struct FDataStreamDefinition>          DataStreamDefinitions;                             // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataStreamDefinitions">();
	}
	static class UDataStreamDefinitions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataStreamDefinitions>();
	}
};

// Class IrisCore.DataStreamManager
// 0x0008 (0x0058 - 0x0050)
class UDataStreamManager final : public UDataStream
{
public:
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataStreamManager">();
	}
	static class UDataStreamManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataStreamManager>();
	}
};

// Class IrisCore.NetObjectPrioritizerConfig
// 0x0000 (0x0028 - 0x0028)
class UNetObjectPrioritizerConfig : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectPrioritizerConfig">();
	}
	static class UNetObjectPrioritizerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectPrioritizerConfig>();
	}
};

// Class IrisCore.FieldOfViewNetObjectPrioritizerConfig
// 0x0030 (0x0058 - 0x0028)
class UFieldOfViewNetObjectPrioritizerConfig final : public UNetObjectPrioritizerConfig
{
public:
	float                                         InnerSphereRadius;                                 // 0x0028(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerSpherePriority;                               // 0x002C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterSphereRadius;                                 // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterSpherePriority;                               // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConeFieldOfViewDegrees;                            // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerConeLength;                                   // 0x003C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConeLength;                                        // 0x0040(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinConePriority;                                   // 0x0044(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxConePriority;                                   // 0x0048(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineOfSightWidth;                                  // 0x004C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineOfSightPriority;                               // 0x0050(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutsidePriority;                                   // 0x0054(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FieldOfViewNetObjectPrioritizerConfig">();
	}
	static class UFieldOfViewNetObjectPrioritizerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldOfViewNetObjectPrioritizerConfig>();
	}
};

// Class IrisCore.NetObjectPrioritizer
// 0x0000 (0x0028 - 0x0028)
class UNetObjectPrioritizer : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectPrioritizer">();
	}
	static class UNetObjectPrioritizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectPrioritizer>();
	}
};

// Class IrisCore.LocationBasedNetObjectPrioritizer
// 0x0038 (0x0060 - 0x0028)
class ULocationBasedNetObjectPrioritizer : public UNetObjectPrioritizer
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LocationBasedNetObjectPrioritizer">();
	}
	static class ULocationBasedNetObjectPrioritizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocationBasedNetObjectPrioritizer>();
	}
};

// Class IrisCore.FieldOfViewNetObjectPrioritizer
// 0x0008 (0x0068 - 0x0060)
class UFieldOfViewNetObjectPrioritizer final : public ULocationBasedNetObjectPrioritizer
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FieldOfViewNetObjectPrioritizer">();
	}
	static class UFieldOfViewNetObjectPrioritizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldOfViewNetObjectPrioritizer>();
	}
};

// Class IrisCore.FilterOutNetObjectFilterConfig
// 0x0000 (0x0028 - 0x0028)
class UFilterOutNetObjectFilterConfig final : public UNetObjectFilterConfig
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FilterOutNetObjectFilterConfig">();
	}
	static class UFilterOutNetObjectFilterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFilterOutNetObjectFilterConfig>();
	}
};

// Class IrisCore.FilterOutNetObjectFilter
// 0x0000 (0x0060 - 0x0060)
class UFilterOutNetObjectFilter final : public UNetObjectFilter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FilterOutNetObjectFilter">();
	}
	static class UFilterOutNetObjectFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFilterOutNetObjectFilter>();
	}
};

// Class IrisCore.IrisObjectReferencePackageMap
// 0x0020 (0x0100 - 0x00E0)
class UIrisObjectReferencePackageMap final : public UPackageMap
{
public:
	uint8                                         Pad_E0[0x20];                                      // 0x00E0(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IrisObjectReferencePackageMap">();
	}
	static class UIrisObjectReferencePackageMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisObjectReferencePackageMap>();
	}
};

// Class IrisCore.NetBlobHandler
// 0x0010 (0x0038 - 0x0028)
class UNetBlobHandler : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetBlobHandler">();
	}
	static class UNetBlobHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetBlobHandler>();
	}
};

// Class IrisCore.NetBlobHandlerDefinitions
// 0x0010 (0x0038 - 0x0028)
class UNetBlobHandlerDefinitions final : public UObject
{
public:
	TArray<struct FNetBlobHandlerDefinition>      NetBlobHandlerDefinitions;                         // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetBlobHandlerDefinitions">();
	}
	static class UNetBlobHandlerDefinitions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetBlobHandlerDefinitions>();
	}
};

// Class IrisCore.NetObjectBlobHandler
// 0x0000 (0x0038 - 0x0038)
class UNetObjectBlobHandler final : public UNetBlobHandler
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectBlobHandler">();
	}
	static class UNetObjectBlobHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectBlobHandler>();
	}
};

// Class IrisCore.NetObjectConnectionFilterConfig
// 0x0008 (0x0030 - 0x0028)
class UNetObjectConnectionFilterConfig final : public UNetObjectFilterConfig
{
public:
	uint16                                        MaxObjectCount;                                    // 0x0028(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectConnectionFilterConfig">();
	}
	static class UNetObjectConnectionFilterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectConnectionFilterConfig>();
	}
};

// Class IrisCore.NetObjectConnectionFilter
// 0x0048 (0x00A8 - 0x0060)
class UNetObjectConnectionFilter final : public UNetObjectFilter
{
public:
	uint8                                         Pad_60[0x48];                                      // 0x0060(0x0048)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectConnectionFilter">();
	}
	static class UNetObjectConnectionFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectConnectionFilter>();
	}
};

// Class IrisCore.NetObjectCountLimiterConfig
// 0x0018 (0x0040 - 0x0028)
class UNetObjectCountLimiterConfig : public UNetObjectPrioritizerConfig
{
public:
	ENetObjectCountLimiterMode                    Mode;                                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MaxObjectCount;                                    // 0x002C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OwningConnectionPriority;                          // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableOwnedObjectsFastLane;                       // 0x0038(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectCountLimiterConfig">();
	}
	static class UNetObjectCountLimiterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectCountLimiterConfig>();
	}
};

// Class IrisCore.NetObjectCountLimiter
// 0x0068 (0x0090 - 0x0028)
class UNetObjectCountLimiter final : public UNetObjectPrioritizer
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectCountLimiter">();
	}
	static class UNetObjectCountLimiter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectCountLimiter>();
	}
};

// Class IrisCore.NetObjectFactory
// 0x0010 (0x0038 - 0x0028)
class UNetObjectFactory : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectFactory">();
	}
	static class UNetObjectFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectFactory>();
	}
};

// Class IrisCore.NetObjectFilterDefinitions
// 0x0010 (0x0038 - 0x0028)
class UNetObjectFilterDefinitions final : public UObject
{
public:
	TArray<struct FNetObjectFilterDefinition>     NetObjectFilterDefinitions;                        // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectFilterDefinitions">();
	}
	static class UNetObjectFilterDefinitions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectFilterDefinitions>();
	}
};

// Class IrisCore.NetObjectGridFilterConfig
// 0x0028 (0x0050 - 0x0028)
class UNetObjectGridFilterConfig final : public UNetObjectFilterConfig
{
public:
	uint32                                        ViewPosRelevancyFrameCount;                        // 0x0028(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        DefaultFrameCountBeforeCulling;                    // 0x002C(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         CellSizeX;                                         // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CellSizeY;                                         // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultCullDistance;                               // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseExactCullDistance;                             // 0x003C(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FNetObjectGridFilterProfile>    FilterProfiles;                                    // 0x0040(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectGridFilterConfig">();
	}
	static class UNetObjectGridFilterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectGridFilterConfig>();
	}
};

// Class IrisCore.NetObjectGridFilter
// 0x0128 (0x0188 - 0x0060)
class UNetObjectGridFilter : public UNetObjectFilter
{
public:
	uint8                                         Pad_60[0x128];                                     // 0x0060(0x0128)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectGridFilter">();
	}
	static class UNetObjectGridFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectGridFilter>();
	}
};

// Class IrisCore.NetObjectGridWorldLocFilter
// 0x0008 (0x0190 - 0x0188)
class UNetObjectGridWorldLocFilter final : public UNetObjectGridFilter
{
public:
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectGridWorldLocFilter">();
	}
	static class UNetObjectGridWorldLocFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectGridWorldLocFilter>();
	}
};

// Class IrisCore.NetObjectPrioritizerDefinitions
// 0x0010 (0x0038 - 0x0028)
class UNetObjectPrioritizerDefinitions final : public UObject
{
public:
	TArray<struct FNetObjectPrioritizerDefinition> NetObjectPrioritizerDefinitions;                  // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectPrioritizerDefinitions">();
	}
	static class UNetObjectPrioritizerDefinitions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectPrioritizerDefinitions>();
	}
};

// Class IrisCore.NetRPCHandler
// 0x0008 (0x0040 - 0x0038)
class UNetRPCHandler final : public UNetBlobHandler
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetRPCHandler">();
	}
	static class UNetRPCHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetRPCHandler>();
	}
};

// Class IrisCore.NetTokenDataStream
// 0x0050 (0x00A0 - 0x0050)
class UNetTokenDataStream final : public UDataStream
{
public:
	uint8                                         Pad_50[0x50];                                      // 0x0050(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetTokenDataStream">();
	}
	static class UNetTokenDataStream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetTokenDataStream>();
	}
};

// Class IrisCore.NetTokenTypeIdConfig
// 0x0010 (0x0038 - 0x0028)
class UNetTokenTypeIdConfig final : public UObject
{
public:
	TArray<struct FNetTokenStoreTypeIdPair>       ReservedTypeIds;                                   // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetTokenTypeIdConfig">();
	}
	static class UNetTokenTypeIdConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetTokenTypeIdConfig>();
	}
};

// Class IrisCore.NopNetObjectFilterConfig
// 0x0000 (0x0028 - 0x0028)
class UNopNetObjectFilterConfig final : public UNetObjectFilterConfig
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NopNetObjectFilterConfig">();
	}
	static class UNopNetObjectFilterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNopNetObjectFilterConfig>();
	}
};

// Class IrisCore.NopNetObjectFilter
// 0x0000 (0x0060 - 0x0060)
class UNopNetObjectFilter final : public UNetObjectFilter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NopNetObjectFilter">();
	}
	static class UNopNetObjectFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNopNetObjectFilter>();
	}
};

// Class IrisCore.ReplicationBridge
// 0x0140 (0x0168 - 0x0028)
class UReplicationBridge : public UObject
{
public:
	uint8                                         Pad_28[0x140];                                     // 0x0028(0x0140)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReplicationBridge">();
	}
	static class UReplicationBridge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplicationBridge>();
	}
};

// Class IrisCore.ObjectReplicationBridge
// 0x04D8 (0x0640 - 0x0168)
class UObjectReplicationBridge : public UReplicationBridge
{
public:
	uint8                                         Pad_168[0x418];                                    // 0x0168(0x0418)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UNetObjectFactory*>              NetObjectFactories;                                // 0x0580(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_590[0xB0];                                     // 0x0590(0x00B0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectReplicationBridge">();
	}
	static class UObjectReplicationBridge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectReplicationBridge>();
	}
};

// Class IrisCore.ObjectReplicationBridgeConfig
// 0x0088 (0x00B0 - 0x0028)
class UObjectReplicationBridgeConfig final : public UObject
{
public:
	TArray<struct FObjectReplicationBridgePollConfig> PollConfigs;                                   // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FObjectReplicationBridgeFilterConfig> FilterConfigs;                               // 0x0038(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FObjectReplicationBridgePrioritizerConfig> PrioritizerConfigs;                     // 0x0048(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FObjectReplicationBridgeDeltaCompressionConfig> DeltaCompressionConfigs;           // 0x0058(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FObjectReplicatedBridgeCriticalClassConfig> CriticalClassConfigs;                  // 0x0068(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	bool                                          bAllClassesCritical;                               // 0x0078(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FObjectReplicationBridgeTypeStatsConfig> TypeStatsConfigs;                         // 0x0080(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class FName                                   DefaultSpatialFilterName;                          // 0x0090(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   RequiredNetDriverChannelClassName;                 // 0x0098(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                           CriticalActorClasses;                              // 0x00A0(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectReplicationBridgeConfig">();
	}
	static class UObjectReplicationBridgeConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectReplicationBridgeConfig>();
	}
};

// Class IrisCore.SequentialPartialNetBlobHandlerConfig
// 0x0008 (0x0030 - 0x0028)
class USequentialPartialNetBlobHandlerConfig : public UObject
{
public:
	uint32                                        MaxPartBitCount;                                   // 0x0028(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        MaxPartCount;                                      // 0x002C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequentialPartialNetBlobHandlerConfig">();
	}
	static class USequentialPartialNetBlobHandlerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequentialPartialNetBlobHandlerConfig>();
	}
};

// Class IrisCore.PartialNetObjectAttachmentHandlerConfig
// 0x0010 (0x0040 - 0x0030)
class UPartialNetObjectAttachmentHandlerConfig final : public USequentialPartialNetBlobHandlerConfig
{
public:
	uint32                                        BitCountSplitThreshold;                            // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        ClientUnreliableBitCountSplitThreshold;            // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        ServerUnreliableBitCountSplitThreshold;            // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PartialNetObjectAttachmentHandlerConfig">();
	}
	static class UPartialNetObjectAttachmentHandlerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartialNetObjectAttachmentHandlerConfig>();
	}
};

// Class IrisCore.SequentialPartialNetBlobHandler
// 0x0010 (0x0048 - 0x0038)
class USequentialPartialNetBlobHandler : public UNetBlobHandler
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequentialPartialNetBlobHandler">();
	}
	static class USequentialPartialNetBlobHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequentialPartialNetBlobHandler>();
	}
};

// Class IrisCore.PartialNetObjectAttachmentHandler
// 0x0108 (0x0150 - 0x0048)
class UPartialNetObjectAttachmentHandler final : public USequentialPartialNetBlobHandler
{
public:
	uint8                                         Pad_48[0x108];                                     // 0x0048(0x0108)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PartialNetObjectAttachmentHandler">();
	}
	static class UPartialNetObjectAttachmentHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartialNetObjectAttachmentHandler>();
	}
};

// Class IrisCore.ReplicationDataStream
// 0x0010 (0x0060 - 0x0050)
class UReplicationDataStream final : public UDataStream
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReplicationDataStream">();
	}
	static class UReplicationDataStream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplicationDataStream>();
	}
};

// Class IrisCore.ReplicationFilteringConfig
// 0x0018 (0x0040 - 0x0028)
class UReplicationFilteringConfig final : public UObject
{
public:
	bool                                          bEnableObjectScopeHysteresis;                      // 0x0028(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         DefaultHysteresisFrameCount;                       // 0x0029(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         HysteresisUpdateConnectionThrottling;              // 0x002A(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FObjectScopeHysteresisProfile>  HysteresisProfiles;                                // 0x0030(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReplicationFilteringConfig">();
	}
	static class UReplicationFilteringConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplicationFilteringConfig>();
	}
};

// Class IrisCore.ReplicationSystem
// 0x0030 (0x0058 - 0x0028)
class UReplicationSystem final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class UReplicationBridge*                     ReplicationBridge;                                 // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReplicationSystem">();
	}
	static class UReplicationSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplicationSystem>();
	}
};

// Class IrisCore.SphereNetObjectPrioritizerConfig
// 0x0018 (0x0040 - 0x0028)
class USphereNetObjectPrioritizerConfig : public UNetObjectPrioritizerConfig
{
public:
	float                                         InnerRadius;                                       // 0x0028(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterRadius;                                       // 0x002C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerPriority;                                     // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterPriority;                                     // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutsidePriority;                                   // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SphereNetObjectPrioritizerConfig">();
	}
	static class USphereNetObjectPrioritizerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<USphereNetObjectPrioritizerConfig>();
	}
};

// Class IrisCore.SphereNetObjectPrioritizer
// 0x0008 (0x0068 - 0x0060)
class USphereNetObjectPrioritizer : public ULocationBasedNetObjectPrioritizer
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SphereNetObjectPrioritizer">();
	}
	static class USphereNetObjectPrioritizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USphereNetObjectPrioritizer>();
	}
};

// Class IrisCore.SphereWithOwnerBoostNetObjectPrioritizerConfig
// 0x0008 (0x0048 - 0x0040)
class USphereWithOwnerBoostNetObjectPrioritizerConfig final : public USphereNetObjectPrioritizerConfig
{
public:
	float                                         OwnerPriorityBoost;                                // 0x0040(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SphereWithOwnerBoostNetObjectPrioritizerConfig">();
	}
	static class USphereWithOwnerBoostNetObjectPrioritizerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<USphereWithOwnerBoostNetObjectPrioritizerConfig>();
	}
};

// Class IrisCore.SphereWithOwnerBoostNetObjectPrioritizer
// 0x0038 (0x00A0 - 0x0068)
class USphereWithOwnerBoostNetObjectPrioritizer final : public USphereNetObjectPrioritizer
{
public:
	uint8                                         Pad_68[0x38];                                      // 0x0068(0x0038)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SphereWithOwnerBoostNetObjectPrioritizer">();
	}
	static class USphereWithOwnerBoostNetObjectPrioritizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USphereWithOwnerBoostNetObjectPrioritizer>();
	}
};

// Class IrisCore.ReplicationStateDescriptorConfig
// 0x0028 (0x0050 - 0x0028)
class UReplicationStateDescriptorConfig final : public UObject
{
public:
	TArray<struct FSupportsStructNetSerializerConfig> SupportsStructNetSerializerList;               // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FReplicationStateDescriptorClassPushModelConfig> EnsureFullyPushModelClassNames;   // 0x0038(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	bool                                          bEnsureAllClassesAreFullyPushModel;                // 0x0048(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReplicationStateDescriptorConfig">();
	}
	static class UReplicationStateDescriptorConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplicationStateDescriptorConfig>();
	}
};

// Class IrisCore.WorldLocationsConfig
// 0x0038 (0x0060 - 0x0028)
class UWorldLocationsConfig final : public UObject
{
public:
	struct FVector                                MinPos;                                            // 0x0028(0x0018)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MaxPos;                                            // 0x0040(0x0018)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxNetCullDistance;                                // 0x0058(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldLocationsConfig">();
	}
	static class UWorldLocationsConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldLocationsConfig>();
	}
};

}

