#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LS_BlightRemediation_ShallowsNodeB

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function LS_BlightRemediation_ShallowsNodeB.LS_BlightRemediation_ShallowsNodeB_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_BlightRemediation_ShallowsNodeB_DirectorBP_0
// 0x0008 (0x0008 - 0x0000)
struct LS_BlightRemediation_ShallowsNodeB_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_BlightRemediation_ShallowsNodeB_DirectorBP_0 final
{
public:
	class ABP_BlightZone_C*                       BP_BlightZone;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LS_BlightRemediation_ShallowsNodeB_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_BlightRemediation_ShallowsNodeB_DirectorBP_0;

// Function LS_BlightRemediation_ShallowsNodeB.LS_BlightRemediation_ShallowsNodeB_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_BlightRemediation_ShallowsNodeB_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct LS_BlightRemediation_ShallowsNodeB_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_BlightRemediation_ShallowsNodeB_DirectorBP final
{
public:
	class ABP_BlightNode_C*                       BP_BlightNode_CG_B;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LS_BlightRemediation_ShallowsNodeB_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_BlightRemediation_ShallowsNodeB_DirectorBP;

// Function LS_BlightRemediation_ShallowsNodeB.LS_BlightRemediation_ShallowsNodeB_DirectorBP_C.ExecuteUbergraph_LS_BlightRemediation_ShallowsNodeB_DirectorBP
// 0x0018 (0x0018 - 0x0000)
struct LS_BlightRemediation_ShallowsNodeB_DirectorBP_C_ExecuteUbergraph_LS_BlightRemediation_ShallowsNodeB_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BlightZone_C*                       K2Node_CustomEvent_BP_BlightZone;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BlightNode_C*                       K2Node_CustomEvent_BP_BlightNode_CG_B;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LS_BlightRemediation_ShallowsNodeB_DirectorBP_C_ExecuteUbergraph_LS_BlightRemediation_ShallowsNodeB_DirectorBP;

// Function LS_BlightRemediation_ShallowsNodeB.LS_BlightRemediation_ShallowsNodeB_DirectorBP_C.BP_BlightZone_Event
// 0x0008 (0x0008 - 0x0000)
struct LS_BlightRemediation_ShallowsNodeB_DirectorBP_C_BP_BlightZone_Event final
{
public:
	class ABP_BlightZone_C*                       BP_BlightZone;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LS_BlightRemediation_ShallowsNodeB_DirectorBP_C_BP_BlightZone_Event;

// Function LS_BlightRemediation_ShallowsNodeB.LS_BlightRemediation_ShallowsNodeB_DirectorBP_C.BlightNode_RemediateMesh
// 0x0008 (0x0008 - 0x0000)
struct LS_BlightRemediation_ShallowsNodeB_DirectorBP_C_BlightNode_RemediateMesh final
{
public:
	class ABP_BlightNode_C*                       BP_BlightNode_CG_B;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LS_BlightRemediation_ShallowsNodeB_DirectorBP_C_BlightNode_RemediateMesh;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
