#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LS_ObservatoryAxumMessage

#include "Basic.hpp"


namespace SDK::Params
{

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.ExecuteUbergraph_LS_ObservatoryAxumMessage_DirectorBP
// 0x0048 (0x0048 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_ExecuteUbergraph_LS_ObservatoryAxumMessage_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class ASN2PlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Hologram_AxumFinale_Button_C*       K2Node_CustomEvent_BP_Hologram_AxumFinale_Button_2; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_HologramNum_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class ABP_Hologram_AxumFinale_Button_C*       K2Node_CustomEvent_BP_Hologram_AxumFinale_Button_1; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_HologramNum;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class ABP_Hologram_AxumFinale_Button_C*       K2Node_CustomEvent_BP_Hologram_AxumFinale_Button;  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASN2PlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStoryGoalUnlocked_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.FadeIn_Hologram
// 0x0010 (0x0010 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_FadeIn_Hologram final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         HologramNum;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.FadeOut_Hologram
// 0x0010 (0x0010 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_FadeOut_Hologram final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         HologramNum;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.PowerOff
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_PowerOff final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_0
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_0 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_1
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_1 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_10
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_10 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_11
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_11 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_12
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_12 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_13
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_13 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_2
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_2 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_3
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_3 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_4
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_4 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_5
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_5 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_6
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_6 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_7
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_7 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_8
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_8 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_9
// 0x0008 (0x0008 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_ObservatoryAxumMessage_DirectorBP_9 final
{
public:
	class ABP_Hologram_AxumFinale_Button_C*       BP_Hologram_AxumFinale_Button;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_ObservatoryAxumMessage.LS_ObservatoryAxumMessage_DirectorBP_C.TryPlayAxumDialogue
// 0x0018 (0x0018 - 0x0000)
struct LS_ObservatoryAxumMessage_DirectorBP_C_TryPlayAxumDialogue final
{
public:
	class UUWEDialogueNode*                       Dialogue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASN2PlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayDialogueForPlayer_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStoryGoalUnlocked_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayDialogueForPlayer_ReturnValue_1;      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

