#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LS_PowerPlantActivate

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function LS_PowerPlantActivate.LS_PowerPlantActivate_DirectorBP_C.BP_PowerPlantActivate_Event
// 0x0008 (0x0008 - 0x0000)
struct LS_PowerPlantActivate_DirectorBP_C_BP_PowerPlantActivate_Event final
{
public:
	class ABP_PowerPlantActivate_C*               BP_PowerPlantActivate;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_PowerPlantActivate.LS_PowerPlantActivate_DirectorBP_C.BP_PowerPlantActivate_Event_0
// 0x0008 (0x0008 - 0x0000)
struct LS_PowerPlantActivate_DirectorBP_C_BP_PowerPlantActivate_Event_0 final
{
public:
	class ABP_PowerPlantActivate_C*               BP_PowerPlantActivate;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_PowerPlantActivate.LS_PowerPlantActivate_DirectorBP_C.ExecuteUbergraph_LS_PowerPlantActivate_DirectorBP
// 0x0020 (0x0020 - 0x0000)
struct LS_PowerPlantActivate_DirectorBP_C_ExecuteUbergraph_LS_PowerPlantActivate_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_PowerPlantActivate_C*               K2Node_CustomEvent_BP_PowerPlantActivate_1;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PowerPlantActivate_C*               K2Node_CustomEvent_BP_PowerPlantActivate;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_PowerPlantActivate.LS_PowerPlantActivate_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_PowerPlantActivate_DirectorBP_0
// 0x0008 (0x0008 - 0x0000)
struct LS_PowerPlantActivate_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_PowerPlantActivate_DirectorBP_0 final
{
public:
	class ABP_PowerPlantActivate_C*               BP_PowerPlantActivate;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function LS_PowerPlantActivate.LS_PowerPlantActivate_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_PowerPlantActivate_DirectorBP_1
// 0x0008 (0x0008 - 0x0000)
struct LS_PowerPlantActivate_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_PowerPlantActivate_DirectorBP_1 final
{
public:
	class ABP_PowerPlantActivate_C*               BP_PowerPlantActivate;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

