#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MercunaMover

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "MercunaMover_structs.hpp"
#include "Mercuna_classes.hpp"


namespace SDK
{

// Class MercunaMover.MercunaMoverMovementModeProducer
// 0x0010 (0x0038 - 0x0028)
class UMercunaMoverMovementModeProducer : public UObject
{
public:
	class UMoverComponent*                        MoverComponent;                                    // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMercunaNavigationComponent*            NavigationComponent;                               // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MercunaMoverMovementModeProducer">();
	}
	static class UMercunaMoverMovementModeProducer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMercunaMoverMovementModeProducer>();
	}
};

// Class MercunaMover.MerMoverComponentAdapter
// 0x0238 (0x0260 - 0x0028)
class UMerMoverComponentAdapter final : public UMercunaMovementAdapter
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	class UMoverComponent*                        MoverComponent;                                    // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMercunaNavigationComponent*            NavigationComponent;                               // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMercunaMoverMovementModeProducer*      CurrentMoverProducer;                              // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMercunaMoverMovementModeProducer*> Producers;                                      // 0x0058(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FMerMoverMovementModeProducerIndexMap  MovementModeProducerIndexMap;                      // 0x0068(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FMerMoverComponentAdapterMovementModeProducerMap MovementModeMapping;                     // 0x00B8(0x0050)(Deprecated, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_108[0x158];                                    // 0x0108(0x0158)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnMovementModeChanged(const class FName& PreviousMovementModeName, const class FName& NewMovementModeName);
	void OnPreSimTick(const struct FMoverTimeStep& TimeStep, const struct FMoverInputCmdContext& InputCmd);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MerMoverComponentAdapter">();
	}
	static class UMerMoverComponentAdapter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMerMoverComponentAdapter>();
	}
};

// Class MercunaMover.MerMoverDefaultMovementSetProducerFlying
// 0x0010 (0x0048 - 0x0038)
class UMerMoverDefaultMovementSetProducerFlying final : public UMercunaMoverMovementModeProducer
{
public:
	bool                                          bUseAccelerationForPaths;                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonLegacyMovementSettings*          MovementSettings;                                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MerMoverDefaultMovementSetProducerFlying">();
	}
	static class UMerMoverDefaultMovementSetProducerFlying* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMerMoverDefaultMovementSetProducerFlying>();
	}
};

// Class MercunaMover.MerMoverDefaultMovementSetProducerWalking
// 0x0028 (0x0060 - 0x0038)
class UMerMoverDefaultMovementSetProducerWalking final : public UMercunaMoverMovementModeProducer
{
public:
	bool                                          bUseAccelerationForPaths;                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonLegacyMovementSettings*          MovementSettings;                                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MerMoverDefaultMovementSetProducerWalking">();
	}
	static class UMerMoverDefaultMovementSetProducerWalking* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMerMoverDefaultMovementSetProducerWalking>();
	}
};

}

