#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MeshBlend

#include "Basic.hpp"

#include "MeshBlend_structs.hpp"


namespace SDK::Params
{

// Function MeshBlend.MeshBlendActivatorSubsystem.GetInstance
// 0x0010 (0x0010 - 0x0000)
struct MeshBlendActivatorSubsystem_GetInstance final
{
public:
	const class UWorld*                           World;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshBlendActivatorSubsystem*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MeshBlend.MeshBlendActivatorSubsystem.RefreshActor
// 0x0010 (0x0010 - 0x0000)
struct MeshBlendActivatorSubsystem_RefreshActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSoftReset;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function MeshBlend.MeshBlendBPLibrary.ClearBlendOptionFromActor
// 0x0008 (0x0008 - 0x0000)
struct MeshBlendBPLibrary_ClearBlendOptionFromActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MeshBlend.MeshBlendBPLibrary.ClearBlendUserDataFromMesh
// 0x0008 (0x0008 - 0x0000)
struct MeshBlendBPLibrary_ClearBlendUserDataFromMesh final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MeshBlend.MeshBlendBPLibrary.DisableBlendOnActor
// 0x0008 (0x0008 - 0x0000)
struct MeshBlendBPLibrary_DisableBlendOnActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MeshBlend.MeshBlendBPLibrary.RefreshBlendOnActor
// 0x0010 (0x0010 - 0x0000)
struct MeshBlendBPLibrary_RefreshBlendOnActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSoftReset;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function MeshBlend.MeshBlendBPLibrary.SetBlendOptionOnActor
// 0x0010 (0x0010 - 0x0000)
struct MeshBlendBPLibrary_SetBlendOptionOnActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAutoBlendOption                              NewBlendOption;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function MeshBlend.MeshBlendBPLibrary.SetBlendUserDataOnMesh
// 0x0010 (0x0010 - 0x0000)
struct MeshBlendBPLibrary_SetBlendUserDataOnMesh final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAutoBlendOption                              NewBlendOption;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

