#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ModelingComponents

#include "Basic.hpp"

#include "InteractiveToolsFramework_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "ModelingComponents_structs.hpp"
#include "GeometryFramework_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class ModelingComponents.InteractiveToolActivity
// 0x0000 (0x0030 - 0x0030)
class UInteractiveToolActivity : public UInteractionMechanic
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractiveToolActivity">();
	}
	static class UInteractiveToolActivity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractiveToolActivity>();
	}
};

// Class ModelingComponents.TriangleSetComponent
// 0x0108 (0x0680 - 0x0578)
class UTriangleSetComponent final : public UMeshComponent
{
public:
	struct FBoxSphereBounds                       Bounds;                                            // 0x0578(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bBoundsDirty;                                      // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B1[0xCF];                                     // 0x05B1(0x00CF)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TriangleSetComponent">();
	}
	static class UTriangleSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTriangleSetComponent>();
	}
};

// Class ModelingComponents.DynamicMeshProvider
// 0x0000 (0x0000 - 0x0000)
class IDynamicMeshProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicMeshProvider">();
	}
	static class IDynamicMeshProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDynamicMeshProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ModelingComponents.ToolActivityHost
// 0x0000 (0x0000 - 0x0000)
class IToolActivityHost final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolActivityHost">();
	}
	static class IToolActivityHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<IToolActivityHost>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ModelingComponents.PreviewGeometry
// 0x00F8 (0x0120 - 0x0028)
class UPreviewGeometry : public UObject
{
public:
	class APreviewGeometryActor*                  ParentActor;                                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class UTriangleSetComponent*> TriangleSets;                                  // 0x0030(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FString, class ULineSetComponent*> LineSets;                                          // 0x0080(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FString, class UPointSetComponent*> PointSets;                                        // 0x00D0(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	class ULineSetComponent* AddLineSet(const class FString& LineSetIdentifier);
	class UPointSetComponent* AddPointSet(const class FString& PointSetIdentifier);
	class UTriangleSetComponent* AddTriangleSet(const class FString& TriangleSetIdentifier);
	void CreateInWorld(class UWorld* World, const struct FTransform& WithTransform);
	void Disconnect();
	class ULineSetComponent* FindLineSet(const class FString& LineSetIdentifier);
	class UPointSetComponent* FindPointSet(const class FString& PointSetIdentifier);
	class UTriangleSetComponent* FindTriangleSet(const class FString& TriangleSetIdentifier);
	void RemoveAllLineSets(bool bDestroy);
	void RemoveAllPointSets(bool bDestroy);
	void RemoveAllTriangleSets(bool bDestroy);
	bool RemoveLineSet(const class FString& LineSetIdentifier, bool bDestroy);
	bool RemovePointSet(const class FString& PointSetIdentifier, bool bDestroy);
	bool RemoveTriangleSet(const class FString& TriangleSetIdentifier, bool bDestroy);
	void SetAllLineSetsMaterial(class UMaterialInterface* Material);
	void SetAllPointSetsMaterial(class UMaterialInterface* Material);
	bool SetLineSetMaterial(const class FString& LineSetIdentifier, class UMaterialInterface* NewMaterial);
	bool SetLineSetVisibility(const class FString& LineSetIdentifier, bool bVisible);
	bool SetPointSetMaterial(const class FString& PointSetIdentifier, class UMaterialInterface* NewMaterial);
	bool SetPointSetVisibility(const class FString& PointSetIdentifier, bool bVisible);

	class APreviewGeometryActor* GetActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PreviewGeometry">();
	}
	static class UPreviewGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPreviewGeometry>();
	}
};

// Class ModelingComponents.DynamicMeshCommitter
// 0x0000 (0x0000 - 0x0000)
class IDynamicMeshCommitter final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicMeshCommitter">();
	}
	static class IDynamicMeshCommitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDynamicMeshCommitter>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ModelingComponents.MeshTopologySelectionMechanic
// 0x0AB0 (0x0AE0 - 0x0030)
class UMeshTopologySelectionMechanic : public UInteractionMechanic
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Size After Last Property [ Dumper-8 ])
	class UMeshTopologySelectionMechanicProperties* Properties;                                      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x50];                                      // 0x0080(0x0050)(Fixing Size After Last Property [ Dumper-8 ])
	class UMouseHoverBehavior*                    HoverBehavior;                                     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USingleClickOrDragInputBehavior*        ClickOrDragBehavior;                               // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URectangleMarqueeMechanic*              MarqueeMechanic;                                   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMarqueeSelectionUpdateType                   MarqueeSelectionUpdateType;                        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC[0x5B4];                                     // 0x00EC(0x05B4)(Fixing Size After Last Property [ Dumper-8 ])
	class APreviewGeometryActor*                  PreviewGeometryActor;                              // 0x06A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTriangleSetComponent*                  DrawnTriangleSetComponent;                         // 0x06A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6B0[0x50];                                     // 0x06B0(0x0050)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     HighlightedFaceMaterial;                           // 0x0700(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_708[0x3D8];                                    // 0x0708(0x03D8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshTopologySelectionMechanic">();
	}
	static class UMeshTopologySelectionMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshTopologySelectionMechanic>();
	}
};

// Class ModelingComponents.BoundarySelectionMechanic
// 0x0000 (0x0AE0 - 0x0AE0)
class UBoundarySelectionMechanic final : public UMeshTopologySelectionMechanic
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoundarySelectionMechanic">();
	}
	static class UBoundarySelectionMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoundarySelectionMechanic>();
	}
};

// Class ModelingComponents.PersistentDynamicMeshSource
// 0x0000 (0x0000 - 0x0000)
class IPersistentDynamicMeshSource final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PersistentDynamicMeshSource">();
	}
	static class IPersistentDynamicMeshSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPersistentDynamicMeshSource>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ModelingComponents.GeometrySelectionVisualizationProperties
// 0x0060 (0x0108 - 0x00A8)
class UGeometrySelectionVisualizationProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bEnableShowTriangleROIBorder;                      // 0x00A8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableShowEdgeSelectionVertices;                  // 0x00A9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometrySelectionElementType                 SelectionElementType;                              // 0x00AA(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometrySelectionTopologyType                SelectionTopologyType;                             // 0x00AB(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowSelection;                                    // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowTriangleROIBorder;                            // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowHidden;                                       // 0x00AE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowEdgeSelectionVertices;                        // 0x00AF(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineThickness;                                     // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PointSize;                                         // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthBias;                                         // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 FaceColor;                                         // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 LineColor;                                         // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 PointColor;                                        // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 TriangleROIBorderColor;                            // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     TriangleMaterial;                                  // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     LineMaterial;                                      // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     PointMaterial;                                     // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     TriangleMaterialShowingHidden;                     // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     LineMaterialShowingHidden;                         // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     PointMaterialShowingHidden;                        // 0x00F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeometrySelectionVisualizationProperties">();
	}
	static class UGeometrySelectionVisualizationProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometrySelectionVisualizationProperties>();
	}
};

// Class ModelingComponents.MeshSculptLayersManager
// 0x0000 (0x0000 - 0x0000)
class IMeshSculptLayersManager final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshSculptLayersManager">();
	}
	static class IMeshSculptLayersManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMeshSculptLayersManager>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ModelingComponents.MeshTopologySelectionMechanicProperties
// 0x0018 (0x00C0 - 0x00A8)
class UMeshTopologySelectionMechanicProperties : public UInteractiveToolPropertySet
{
public:
	bool                                          bSelectVertices;                                   // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdges;                                      // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectFaces;                                      // 0x00AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdgeLoops;                                  // 0x00AB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdgeRings;                                  // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitBackFaces;                                     // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMarquee;                                    // 0x00AE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMarqueeIgnoreOcclusion;                           // 0x00AF(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreferProjectedElement;                           // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectDownRay;                                    // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreOcclusion;                                  // 0x00B2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B3[0xD];                                       // 0x00B3(0x000D)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void InvertSelection();
	void SelectAll();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshTopologySelectionMechanicProperties">();
	}
	static class UMeshTopologySelectionMechanicProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshTopologySelectionMechanicProperties>();
	}
};

// Class ModelingComponents.ModelingToolExternalDynamicMeshUpdateAPI
// 0x0000 (0x0000 - 0x0000)
class IModelingToolExternalDynamicMeshUpdateAPI final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModelingToolExternalDynamicMeshUpdateAPI">();
	}
	static class IModelingToolExternalDynamicMeshUpdateAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModelingToolExternalDynamicMeshUpdateAPI>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ModelingComponents.GeometrySelectionEditCommandArguments
// 0x0028 (0x0058 - 0x0030)
class UGeometrySelectionEditCommandArguments final : public UInteractiveCommandArguments
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeometrySelectionEditCommandArguments">();
	}
	static class UGeometrySelectionEditCommandArguments* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometrySelectionEditCommandArguments>();
	}
};

// Class ModelingComponents.GeometrySelectionEditCommandResult
// 0x0078 (0x00A0 - 0x0028)
class UGeometrySelectionEditCommandResult final : public UInteractiveCommandResult
{
public:
	uint8                                         Pad_28[0x78];                                      // 0x0028(0x0078)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeometrySelectionEditCommandResult">();
	}
	static class UGeometrySelectionEditCommandResult* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometrySelectionEditCommandResult>();
	}
};

// Class ModelingComponents.GeometrySelectionEditCommand
// 0x0000 (0x0028 - 0x0028)
class UGeometrySelectionEditCommand : public UInteractiveCommand
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeometrySelectionEditCommand">();
	}
	static class UGeometrySelectionEditCommand* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometrySelectionEditCommand>();
	}
};

// Class ModelingComponents.ToolHostCustomizationAPI
// 0x0000 (0x0000 - 0x0000)
class IToolHostCustomizationAPI final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolHostCustomizationAPI">();
	}
	static class IToolHostCustomizationAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<IToolHostCustomizationAPI>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ModelingComponents.VoxelProperties
// 0x0018 (0x00C0 - 0x00A8)
class UVoxelProperties final : public UInteractiveToolPropertySet
{
public:
	int32                                         VoxelCount;                                        // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSimplify;                                     // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveInternalSurfaces;                           // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        SimplifyMaxErrorFactor;                            // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CubeRootMinComponentVolume;                        // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelProperties">();
	}
	static class UVoxelProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelProperties>();
	}
};

// Class ModelingComponents.MultiSelectionMeshEditingToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UMultiSelectionMeshEditingToolBuilder : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MultiSelectionMeshEditingToolBuilder">();
	}
	static class UMultiSelectionMeshEditingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiSelectionMeshEditingToolBuilder>();
	}
};

// Class ModelingComponents.BaseCreateFromSelectedToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UBaseCreateFromSelectedToolBuilder : public UMultiSelectionMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseCreateFromSelectedToolBuilder">();
	}
	static class UBaseCreateFromSelectedToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedToolBuilder>();
	}
};

// Class ModelingComponents.OnAcceptHandleSourcesPropertiesBase
// 0x0000 (0x00A8 - 0x00A8)
class UOnAcceptHandleSourcesPropertiesBase : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnAcceptHandleSourcesPropertiesBase">();
	}
	static class UOnAcceptHandleSourcesPropertiesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnAcceptHandleSourcesPropertiesBase>();
	}
};

// Class ModelingComponents.OnAcceptHandleSourcesProperties
// 0x0008 (0x00B0 - 0x00A8)
class UOnAcceptHandleSourcesProperties : public UOnAcceptHandleSourcesPropertiesBase
{
public:
	EHandleSourcesMethod                          HandleInputs;                                      // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnAcceptHandleSourcesProperties">();
	}
	static class UOnAcceptHandleSourcesProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnAcceptHandleSourcesProperties>();
	}
};

// Class ModelingComponents.BaseCreateFromSelectedHandleSourceProperties
// 0x0028 (0x00D8 - 0x00B0)
class UBaseCreateFromSelectedHandleSourceProperties final : public UOnAcceptHandleSourcesProperties
{
public:
	EBaseCreateFromSelectedTargetType             OutputWriteTo;                                     // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 OutputNewName;                                     // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputExistingName;                                // 0x00C8(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseCreateFromSelectedHandleSourceProperties">();
	}
	static class UBaseCreateFromSelectedHandleSourceProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedHandleSourceProperties>();
	}
};

// Class ModelingComponents.BaseCreateFromSelectedCollisionProperties
// 0x0008 (0x00B0 - 0x00A8)
class UBaseCreateFromSelectedCollisionProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bTransferCollision;                                // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseCreateFromSelectedCollisionProperties">();
	}
	static class UBaseCreateFromSelectedCollisionProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedCollisionProperties>();
	}
};

// Class ModelingComponents.TransformInputsToolProperties
// 0x0008 (0x00B0 - 0x00A8)
class UTransformInputsToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bShowTransformGizmo;                               // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TransformInputsToolProperties">();
	}
	static class UTransformInputsToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransformInputsToolProperties>();
	}
};

// Class ModelingComponents.MultiSelectionMeshEditingTool
// 0x0008 (0x00B8 - 0x00B0)
class UMultiSelectionMeshEditingTool : public UMultiSelectionTool
{
public:
	TWeakObjectPtr<class UWorld>                  TargetWorld;                                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MultiSelectionMeshEditingTool">();
	}
	static class UMultiSelectionMeshEditingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiSelectionMeshEditingTool>();
	}
};

// Class ModelingComponents.BaseCreateFromSelectedTool
// 0x0050 (0x0108 - 0x00B8)
class UBaseCreateFromSelectedTool : public UMultiSelectionMeshEditingTool
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UTransformInputsToolProperties*         TransformProperties;                               // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCreateMeshObjectTypeProperties*        OutputTypeProperties;                              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBaseCreateFromSelectedHandleSourceProperties* HandleSourcesProperties;                    // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBaseCreateFromSelectedCollisionProperties* CollisionProperties;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshOpPreviewWithBackgroundCompute*    Preview;                                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UTransformProxy*>                TransformProxies;                                  // 0x00E8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UCombinedTransformGizmo*>        TransformGizmos;                                   // 0x00F8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseCreateFromSelectedTool">();
	}
	static class UBaseCreateFromSelectedTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedTool>();
	}
};

// Class ModelingComponents.SingleTargetWithSelectionToolBuilder
// 0x0000 (0x0028 - 0x0028)
class USingleTargetWithSelectionToolBuilder : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SingleTargetWithSelectionToolBuilder">();
	}
	static class USingleTargetWithSelectionToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleTargetWithSelectionToolBuilder>();
	}
};

// Class ModelingComponents.BaseMeshProcessingToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UBaseMeshProcessingToolBuilder : public USingleTargetWithSelectionToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseMeshProcessingToolBuilder">();
	}
	static class UBaseMeshProcessingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMeshProcessingToolBuilder>();
	}
};

// Class ModelingComponents.SingleTargetWithSelectionTool
// 0x0078 (0x0120 - 0x00A8)
class USingleTargetWithSelectionTool : public USingleSelectionTool
{
public:
	TWeakObjectPtr<class UWorld>                  TargetWorld;                                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x60];                                      // 0x00B0(0x0060)(Fixing Size After Last Property [ Dumper-8 ])
	class UGeometrySelectionVisualizationProperties* GeometrySelectionVizProperties;                 // 0x0110(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewGeometry*                       GeometrySelectionViz;                              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SingleTargetWithSelectionTool">();
	}
	static class USingleTargetWithSelectionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleTargetWithSelectionTool>();
	}
};

// Class ModelingComponents.BaseMeshProcessingTool
// 0x0340 (0x0460 - 0x0120)
class UBaseMeshProcessingTool : public USingleTargetWithSelectionTool
{
public:
	uint8                                         Pad_120[0x18];                                     // 0x0120(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	class UMeshOpPreviewWithBackgroundCompute*    Preview;                                           // 0x0138(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_140[0x320];                                    // 0x0140(0x0320)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseMeshProcessingTool">();
	}
	static class UBaseMeshProcessingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMeshProcessingTool>();
	}
};

// Class ModelingComponents.BaseVoxelTool
// 0x0018 (0x0120 - 0x0108)
class UBaseVoxelTool : public UBaseCreateFromSelectedTool
{
public:
	class UVoxelProperties*                       VoxProperties;                                     // 0x0108(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseVoxelTool">();
	}
	static class UBaseVoxelTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseVoxelTool>();
	}
};

// Class ModelingComponents.MeshSurfacePointMeshEditingToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UMeshSurfacePointMeshEditingToolBuilder : public UMeshSurfacePointToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshSurfacePointMeshEditingToolBuilder">();
	}
	static class UMeshSurfacePointMeshEditingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshSurfacePointMeshEditingToolBuilder>();
	}
};

// Class ModelingComponents.MultiTargetWithSelectionToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UMultiTargetWithSelectionToolBuilder : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MultiTargetWithSelectionToolBuilder">();
	}
	static class UMultiTargetWithSelectionToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiTargetWithSelectionToolBuilder>();
	}
};

// Class ModelingComponents.MultiTargetWithSelectionTool
// 0x0038 (0x00E8 - 0x00B0)
class UMultiTargetWithSelectionTool : public UMultiSelectionTool
{
public:
	TWeakObjectPtr<class UWorld>                  TargetWorld;                                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x20];                                      // 0x00B8(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	class UGeometrySelectionVisualizationProperties* GeometrySelectionVizProperties;                 // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewGeometry*                       GeometrySelectionViz;                              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MultiTargetWithSelectionTool">();
	}
	static class UMultiTargetWithSelectionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiTargetWithSelectionTool>();
	}
};

// Class ModelingComponents.SingleSelectionMeshEditingToolBuilder
// 0x0000 (0x0028 - 0x0028)
class USingleSelectionMeshEditingToolBuilder : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SingleSelectionMeshEditingToolBuilder">();
	}
	static class USingleSelectionMeshEditingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleSelectionMeshEditingToolBuilder>();
	}
};

// Class ModelingComponents.SingleSelectionMeshEditingTool
// 0x0008 (0x00B0 - 0x00A8)
class USingleSelectionMeshEditingTool : public USingleSelectionTool
{
public:
	TWeakObjectPtr<class UWorld>                  TargetWorld;                                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SingleSelectionMeshEditingTool">();
	}
	static class USingleSelectionMeshEditingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleSelectionMeshEditingTool>();
	}
};

// Class ModelingComponents.DynamicMeshReplacementChangeTarget
// 0x0030 (0x0058 - 0x0028)
class UDynamicMeshReplacementChangeTarget final : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicMeshReplacementChangeTarget">();
	}
	static class UDynamicMeshReplacementChangeTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicMeshReplacementChangeTarget>();
	}
};

// Class ModelingComponents.OctreeDynamicMeshComponent
// 0x0100 (0x0700 - 0x0600)
class UOctreeDynamicMeshComponent final : public UBaseDynamicMeshComponent
{
public:
	uint8                                         Pad_600[0x40];                                     // 0x0600(0x0040)(Fixing Size After Last Property [ Dumper-8 ])
	class UDynamicMesh*                           MeshObject;                                        // 0x0640(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_648[0xB8];                                     // 0x0648(0x00B8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetDynamicMesh(class UDynamicMesh* NewMesh);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OctreeDynamicMeshComponent">();
	}
	static class UOctreeDynamicMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOctreeDynamicMeshComponent>();
	}
};

// Class ModelingComponents.LineSetComponent
// 0x0088 (0x0600 - 0x0578)
class ULineSetComponent final : public UMeshComponent
{
public:
	class UMaterialInterface*                     LineMaterial;                                      // 0x0578(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBoxSphereBounds                       Bounds;                                            // 0x0580(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bBoundsDirty;                                      // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B9[0x47];                                     // 0x05B9(0x0047)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	int32 AddLines(const TArray<struct FVector>& InStart, const TArray<struct FVector>& InEnd, const struct FColor& InColor, const float InThickness, const float InDepthBias);
	void Clear();
	void SetLineMaterial(class UMaterialInterface* InLineMaterial);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LineSetComponent">();
	}
	static class ULineSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULineSetComponent>();
	}
};

// Class ModelingComponents.MeshElementsVisualizerProperties
// 0x0030 (0x00D8 - 0x00A8)
class UMeshElementsVisualizerProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bVisible;                                          // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWireframe;                                    // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowBorders;                                      // 0x00AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowUVSeams;                                      // 0x00AB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowNormalSeams;                                  // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowTangentSeams;                                 // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowColorSeams;                                   // 0x00AE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AF[0x1];                                       // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ThicknessScale;                                    // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 WireframeColor;                                    // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 BoundaryEdgeColor;                                 // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 UVSeamColor;                                       // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 NormalSeamColor;                                   // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 TangentSeamColor;                                  // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 ColorSeamColor;                                    // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthBias;                                         // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAdjustDepthBiasUsingMeshSize;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshElementsVisualizerProperties">();
	}
	static class UMeshElementsVisualizerProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshElementsVisualizerProperties>();
	}
};

// Class ModelingComponents.MeshElementsVisualizer
// 0x0028 (0x0148 - 0x0120)
class UMeshElementsVisualizer final : public UPreviewGeometry
{
public:
	class UMeshElementsVisualizerProperties*      Settings;                                          // 0x0120(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshWireframeComponent*                WireframeComponent;                                // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_130[0x18];                                     // 0x0130(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshElementsVisualizer">();
	}
	static class UMeshElementsVisualizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshElementsVisualizer>();
	}
};

// Class ModelingComponents.MeshWireframeComponent
// 0x00A8 (0x0620 - 0x0578)
class UMeshWireframeComponent final : public UMeshComponent
{
public:
	float                                         LineDepthBias;                                     // 0x0578(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineDepthBiasSizeScale;                            // 0x057C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThicknessScale;                                    // 0x0580(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableWireframe;                                  // 0x0584(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_585[0x3];                                      // 0x0585(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FColor                                 WireframeColor;                                    // 0x0588(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WireframeThickness;                                // 0x058C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableBoundaryEdges;                              // 0x0590(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FColor                                 BoundaryEdgeColor;                                 // 0x0594(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoundaryEdgeThickness;                             // 0x0598(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableUVSeams;                                    // 0x059C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59D[0x3];                                      // 0x059D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FColor                                 UVSeamColor;                                       // 0x05A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UVSeamThickness;                                   // 0x05A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNormalSeams;                                // 0x05A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A9[0x3];                                      // 0x05A9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FColor                                 NormalSeamColor;                                   // 0x05AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalSeamThickness;                               // 0x05B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTangentSeams;                               // 0x05B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B5[0x3];                                      // 0x05B5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FColor                                 TangentSeamColor;                                  // 0x05B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TangentSeamThickness;                              // 0x05BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableColorSeams;                                 // 0x05C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C1[0x3];                                      // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FColor                                 ColorSeamColor;                                    // 0x05C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ColorSeamThickness;                                // 0x05C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     LineMaterial;                                      // 0x05D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBoxSphereBounds                       LocalBounds;                                       // 0x05D8(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_610[0x10];                                     // 0x0610(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshWireframeComponent">();
	}
	static class UMeshWireframeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshWireframeComponent>();
	}
};

// Class ModelingComponents.PointSetComponent
// 0x0088 (0x0600 - 0x0578)
class UPointSetComponent final : public UMeshComponent
{
public:
	class UMaterialInterface*                     PointMaterial;                                     // 0x0578(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBoxSphereBounds                       Bounds;                                            // 0x0580(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bBoundsDirty;                                      // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B9[0x47];                                     // 0x05B9(0x0047)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	int32 AddPoints(const TArray<struct FVector>& Positions, const struct FColor& InColor, const float InSize, const float InDepthBias);
	void Clear();
	void SetPointMaterial(class UMaterialInterface* InPointMaterial);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PointSetComponent">();
	}
	static class UPointSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPointSetComponent>();
	}
};

// Class ModelingComponents.PreviewMesh
// 0x0108 (0x0130 - 0x0028)
class UPreviewMesh : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bBuildSpatialDataStructure;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-8 ])
	class UDynamicMeshComponent*                  DynamicMeshComponent;                              // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0xD8];                                      // 0x0058(0x00D8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PreviewMesh">();
	}
	static class UPreviewMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPreviewMesh>();
	}
};

// Class ModelingComponents.PolyEditPreviewMesh
// 0x0340 (0x0470 - 0x0130)
class UPolyEditPreviewMesh final : public UPreviewMesh
{
public:
	uint8                                         Pad_130[0x340];                                    // 0x0130(0x0340)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PolyEditPreviewMesh">();
	}
	static class UPolyEditPreviewMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPolyEditPreviewMesh>();
	}
};

// Class ModelingComponents.PreviewGeometryActor
// 0x0000 (0x02B8 - 0x02B8)
class APreviewGeometryActor final : public AInternalToolFrameworkActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PreviewGeometryActor">();
	}
	static class APreviewGeometryActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APreviewGeometryActor>();
	}
};

// Class ModelingComponents.UVLayoutPreviewProperties
// 0x0028 (0x00D0 - 0x00A8)
class UUVLayoutPreviewProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bEnabled;                                          // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	EUVLayoutPreviewSide                          Side;                                              // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector2D                              Offset;                                            // 0x00B8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWireframe;                                    // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVLayoutPreviewProperties">();
	}
	static class UUVLayoutPreviewProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVLayoutPreviewProperties>();
	}
};

// Class ModelingComponents.UVLayoutPreview
// 0x0148 (0x0170 - 0x0028)
class UUVLayoutPreview final : public UObject
{
public:
	class UUVLayoutPreviewProperties*             Settings;                                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshElementsVisualizer*                MeshElementsVisualizer;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
