#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MovieSceneTracks

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieSceneTracks_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Constraints_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// Class MovieSceneTracks.MovieSceneTransformOriginInstantiatorSystem
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneTransformOriginInstantiatorSystem final : public UMovieSceneEntitySystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTransformOriginInstantiatorSystem">();
	}
	static class UMovieSceneTransformOriginInstantiatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTransformOriginInstantiatorSystem>();
	}
};

// Class MovieSceneTracks.MovieSceneTransformOrigin
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneTransformOrigin final
{
public:
	struct FTransform BP_GetTransformOrigin() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTransformOrigin">();
	}
	static class IMovieSceneTransformOrigin* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneTransformOrigin>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class MovieSceneTracks.MovieSceneCommonAnimationTrack
// 0x0098 (0x01A8 - 0x0110)
#pragma pack(push, 0x1)
class alignas(0x08) UMovieSceneCommonAnimationTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             AnimationSections;                                 // 0x0110(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FMovieSceneSkeletalAnimRootMotionTrackParams RootMotionParams;                            // 0x0120(0x0080)(NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bBlendFirstChildOfRoot;                            // 0x01A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCommonAnimationTrack">();
	}
	static class UMovieSceneCommonAnimationTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCommonAnimationTrack>();
	}
};
#pragma pack(pop)

// Class MovieSceneTracks.MovieScenePropertyInstantiatorSystem
// 0x01A0 (0x01E0 - 0x0040)
class UMovieScenePropertyInstantiatorSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	uint8                                         Pad_40[0x1A0];                                     // 0x0040(0x01A0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePropertyInstantiatorSystem">();
	}
	static class UMovieScenePropertyInstantiatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScenePropertyInstantiatorSystem>();
	}
};

// Class MovieSceneTracks.MovieSceneConsoleVariableTrackInterface
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneConsoleVariableTrackInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneConsoleVariableTrackInterface">();
	}
	static class IMovieSceneConsoleVariableTrackInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneConsoleVariableTrackInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class MovieSceneTracks.MovieSceneDecomposerTestObject
// 0x0008 (0x0030 - 0x0028)
class UMovieSceneDecomposerTestObject final : public UObject
{
public:
	float                                         FloatProperty;                                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneDecomposerTestObject">();
	}
	static class UMovieSceneDecomposerTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDecomposerTestObject>();
	}
};

// Class MovieSceneTracks.MovieSceneVisibilitySystem
// 0x0010 (0x0050 - 0x0040)
class UMovieSceneVisibilitySystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneVisibilitySystem">();
	}
	static class UMovieSceneVisibilitySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneVisibilitySystem>();
	}
};

// Class MovieSceneTracks.MovieSceneDirectorBlueprintCondition
// 0x0030 (0x0090 - 0x0060)
class UMovieSceneDirectorBlueprintCondition final : public UMovieSceneCondition
{
public:
	struct FMovieSceneDirectorBlueprintConditionData DirectorBlueprintConditionData;                 // 0x0060(0x0028)(Edit, NativeAccessSpecifierPublic)
	EMovieSceneConditionScope                     Scope;                                             // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMovieSceneConditionCheckFrequency            CheckFrequency;                                    // 0x0089(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneDirectorBlueprintCondition">();
	}
	static class UMovieSceneDirectorBlueprintCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDirectorBlueprintCondition>();
	}
};

// Class MovieSceneTracks.MovieSceneFadeTrackTestLibrary
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneFadeTrackTestLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float GetManualFadeAmount(class APlayerCameraManager* PlayerCameraManager);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneFadeTrackTestLibrary">();
	}
	static class UMovieSceneFadeTrackTestLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneFadeTrackTestLibrary>();
	}
};

// Class MovieSceneTracks.MovieScene3DConstraintTrack
// 0x0010 (0x0120 - 0x0110)
class UMovieScene3DConstraintTrack : public UMovieSceneTrack
{
public:
	TArray<class UMovieSceneSection*>             ConstraintSections;                                // 0x0110(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DConstraintTrack">();
	}
	static class UMovieScene3DConstraintTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DConstraintTrack>();
	}
};

// Class MovieSceneTracks.MovieScene3DAttachTrack
// 0x0000 (0x0120 - 0x0120)
class UMovieScene3DAttachTrack final : public UMovieScene3DConstraintTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DAttachTrack">();
	}
	static class UMovieScene3DAttachTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DAttachTrack>();
	}
};

// Class MovieSceneTracks.MovieScenePartialEvaluationTestObject
// 0x0020 (0x0048 - 0x0028)
class UMovieScenePartialEvaluationTestObject final : public UObject
{
public:
	float                                         FloatProperty;                                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                VectorProperty;                                    // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePartialEvaluationTestObject">();
	}
	static class UMovieScenePartialEvaluationTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScenePartialEvaluationTestObject>();
	}
};

// Class MovieSceneTracks.MovieScenePlatformCondition
// 0x0010 (0x0070 - 0x0060)
class UMovieScenePlatformCondition final : public UMovieSceneCondition
{
public:
	TArray<class FName>                           ValidPlatforms;                                    // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePlatformCondition">();
	}
	static class UMovieScenePlatformCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScenePlatformCondition>();
	}
};

// Class MovieSceneTracks.MovieSceneHierarchicalEasingFinalizationSystem
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneHierarchicalEasingFinalizationSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneHierarchicalEasingFinalizationSystem">();
	}
	static class UMovieSceneHierarchicalEasingFinalizationSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneHierarchicalEasingFinalizationSystem>();
	}
};

// Class MovieSceneTracks.MovieSceneReplaceableActorBinding
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneReplaceableActorBinding final : public UMovieSceneReplaceableBindingBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneReplaceableActorBinding">();
	}
	static class UMovieSceneReplaceableActorBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneReplaceableActorBinding>();
	}
};

// Class MovieSceneTracks.MovieSceneReplaceableActorBinding_BPBase
// 0x0010 (0x0038 - 0x0028)
class UMovieSceneReplaceableActorBinding_BPBase final : public UMovieSceneReplaceableBindingBase
{
public:
	int32                                         CustomBindingPriority;                             // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UMovieSceneSpawnableBindingBase> PreviewSpawnableType;                         // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BP_InitReplaceableBinding(class UObject* SourceObject, class UMovieScene* OwnerMovieScene);

	struct FMovieSceneBindingResolveResult BP_ResolveRuntimeBinding(const struct FMovieSceneBindingResolveContext& ResolveContext) const;
	bool BP_SupportsBindingCreationFromObject(const class UObject* SourceObject) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneReplaceableActorBinding_BPBase">();
	}
	static class UMovieSceneReplaceableActorBinding_BPBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneReplaceableActorBinding_BPBase>();
	}
};

// Class MovieSceneTracks.MovieScenePropertySystem
// 0x0018 (0x0058 - 0x0040)
class UMovieScenePropertySystem : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UMovieScenePropertyInstantiatorSystem*  InstantiatorSystem;                                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePropertySystem">();
	}
	static class UMovieScenePropertySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScenePropertySystem>();
	}
};

// Class MovieSceneTracks.MovieSceneFloatVectorPropertySystem
// 0x0000 (0x0058 - 0x0058)
class UMovieSceneFloatVectorPropertySystem final : public UMovieScenePropertySystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneFloatVectorPropertySystem">();
	}
	static class UMovieSceneFloatVectorPropertySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneFloatVectorPropertySystem>();
	}
};

// Class MovieSceneTracks.MovieSceneReplaceableDirectorBlueprintBinding
// 0x0030 (0x0058 - 0x0028)
class UMovieSceneReplaceableDirectorBlueprintBinding final : public UMovieSceneReplaceableBindingBase
{
public:
	struct FMovieSceneDynamicBinding              DynamicBinding;                                    // 0x0028(0x0028)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UMovieSceneSpawnableBindingBase> PreviewSpawnableType;                         // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneReplaceableDirectorBlueprintBinding">();
	}
	static class UMovieSceneReplaceableDirectorBlueprintBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneReplaceableDirectorBlueprintBinding>();
	}
};

// Class MovieSceneTracks.MovieSceneSectionsToKey
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneSectionsToKey final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSectionsToKey">();
	}
	static class IMovieSceneSectionsToKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneSectionsToKey>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class MovieSceneTracks.MovieSceneRotatorPropertySystem
// 0x0000 (0x0058 - 0x0058)
class UMovieSceneRotatorPropertySystem final : public UMovieScenePropertySystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneRotatorPropertySystem">();
	}
	static class UMovieSceneRotatorPropertySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneRotatorPropertySystem>();
	}
};

// Class MovieSceneTracks.MovieSceneRotatorSection
// 0x0350 (0x0458 - 0x0108)
class UMovieSceneRotatorSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMovieSceneDoubleChannel               Rotation[0x3];                                     // 0x0110(0x0118)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneRotatorSection">();
	}
	static class UMovieSceneRotatorSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneRotatorSection>();
	}
};

// Class MovieSceneTracks.MovieSceneCameraShakeSourceShakeTrack
// 0x0010 (0x0120 - 0x0110)
class UMovieSceneCameraShakeSourceShakeTrack final : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             CameraShakeSections;                               // 0x0110(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCameraShakeSourceShakeTrack">();
	}
	static class UMovieSceneCameraShakeSourceShakeTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCameraShakeSourceShakeTrack>();
	}
};

// Class MovieSceneTracks.MovieScenePropertyTrack
// 0x0030 (0x0140 - 0x0110)
class UMovieScenePropertyTrack : public UMovieSceneNameableTrack
{
public:
	class UMovieSceneSection*                     SectionToKey;                                      // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMovieScenePropertyBinding             PropertyBinding;                                   // 0x0118(0x0014)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0130(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePropertyTrack">();
	}
	static class UMovieScenePropertyTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScenePropertyTrack>();
	}
};

// Class MovieSceneTracks.MovieSceneRotatorTrack
// 0x0000 (0x0140 - 0x0140)
class UMovieSceneRotatorTrack final : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneRotatorTrack">();
	}
	static class UMovieSceneRotatorTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneRotatorTrack>();
	}
};

// Class MovieSceneTracks.MovieScene3DTransformTrack
// 0x0010 (0x0150 - 0x0140)
class UMovieScene3DTransformTrack final : public UMovieScenePropertyTrack
{
public:
	uint8                                         Pad_140[0x8];                                      // 0x0140(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UMovieSceneBlenderSystem>   BlenderSystemClass;                                // 0x0148(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DTransformTrack">();
	}
	static class UMovieScene3DTransformTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DTransformTrack>();
	}
};

// Class MovieSceneTracks.MovieSceneScalabilityCondition
// 0x0008 (0x0068 - 0x0060)
class UMovieSceneScalabilityCondition final : public UMovieSceneCondition
{
public:
	EMovieSceneScalabilityConditionGroup          Group;                                             // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieSceneScalabilityConditionOperator       Operator;                                          // 0x0061(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieSceneScalabilityConditionLevel          Level;                                             // 0x0062(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScalabilityCondition">();
	}
	static class UMovieSceneScalabilityCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScalabilityCondition>();
	}
};

// Class MovieSceneTracks.MovieSceneSpawnableActorBindingBase
// 0x0010 (0x0040 - 0x0030)
class UMovieSceneSpawnableActorBindingBase : public UMovieSceneSpawnableBindingBase
{
public:
	bool                                          bNetAddressableName;                               // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   LevelName;                                         // 0x0034(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSpawnableActorBindingBase">();
	}
	static class UMovieSceneSpawnableActorBindingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSpawnableActorBindingBase>();
	}
};

// Class MovieSceneTracks.MovieSceneCameraCutTrackInstance
// 0x0028 (0x0078 - 0x0050)
class UMovieSceneCameraCutTrackInstance final : public UMovieSceneTrackInstance
{
public:
	uint8                                         Pad_50[0x28];                                      // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCameraCutTrackInstance">();
	}
	static class UMovieSceneCameraCutTrackInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCameraCutTrackInstance>();
	}
};

// Class MovieSceneTracks.MovieSceneSpawnableActorBinding
// 0x0008 (0x0048 - 0x0040)
class UMovieSceneSpawnableActorBinding : public UMovieSceneSpawnableActorBindingBase
{
public:
	class AActor*                                 ActorTemplate;                                     // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSpawnableActorBinding">();
	}
	static class UMovieSceneSpawnableActorBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSpawnableActorBinding>();
	}
};

// Class MovieSceneTracks.MovieSceneSpawnableDirectorBlueprintBinding
// 0x0028 (0x0058 - 0x0030)
class UMovieSceneSpawnableDirectorBlueprintBinding final : public UMovieSceneSpawnableBindingBase
{
public:
	struct FMovieSceneDynamicBinding              DynamicBinding;                                    // 0x0030(0x0028)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSpawnableDirectorBlueprintBinding">();
	}
	static class UMovieSceneSpawnableDirectorBlueprintBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSpawnableDirectorBlueprintBinding>();
	}
};

// Class MovieSceneTracks.MovieSceneTestSequence
// 0x0028 (0x0090 - 0x0068)
class UMovieSceneTestSequence final : public UMovieSceneSequence
{
public:
	class UMovieScene*                            MovieScene;                                        // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        BoundObjects;                                      // 0x0070(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          BindingGuids;                                      // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTestSequence">();
	}
	static class UMovieSceneTestSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTestSequence>();
	}
};

// Class MovieSceneTracks.MovieSceneDoublePerlinNoiseChannelContainer
// 0x0068 (0x00C0 - 0x0058)
class UMovieSceneDoublePerlinNoiseChannelContainer final : public UMovieSceneChannelOverrideContainer
{
public:
	struct FMovieSceneDoublePerlinNoiseChannel    PerlinNoiseChannel;                                // 0x0058(0x0068)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneDoublePerlinNoiseChannelContainer">();
	}
	static class UMovieSceneDoublePerlinNoiseChannelContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDoublePerlinNoiseChannelContainer>();
	}
};

// Class MovieSceneTracks.MovieSceneDoubleTrack
// 0x0000 (0x0140 - 0x0140)
class UMovieSceneDoubleTrack final : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneDoubleTrack">();
	}
	static class UMovieSceneDoubleTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDoubleTrack>();
	}
};

// Class MovieSceneTracks.MovieSceneFloatPerlinNoiseChannelContainer
// 0x0068 (0x00C0 - 0x0058)
class UMovieSceneFloatPerlinNoiseChannelContainer final : public UMovieSceneChannelOverrideContainer
{
public:
	struct FMovieSceneFloatPerlinNoiseChannel     PerlinNoiseChannel;                                // 0x0058(0x0068)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneFloatPerlinNoiseChannelContainer">();
	}
	static class UMovieSceneFloatPerlinNoiseChannelContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneFloatPerlinNoiseChannelContainer>();
	}
};

// Class MovieSceneTracks.MovieSceneInterrogatedPropertyInstantiatorSystem
// 0x01C0 (0x0200 - 0x0040)
class UMovieSceneInterrogatedPropertyInstantiatorSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	uint8                                         Pad_40[0x1C0];                                     // 0x0040(0x01C0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneInterrogatedPropertyInstantiatorSystem">();
	}
	static class UMovieSceneInterrogatedPropertyInstantiatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneInterrogatedPropertyInstantiatorSystem>();
	}
};

// Class MovieSceneTracks.MovieSceneTracksSettings
// 0x0008 (0x0030 - 0x0028)
class UMovieSceneTracksSettings final : public UObject
{
public:
	bool                                          bPreviewCameraCutsInSimulate;                      // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTracksSettings">();
	}
	static class UMovieSceneTracksSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTracksSettings>();
	}
};

// Class MovieSceneTracks.MovieScene3DConstraintSection
// 0x0028 (0x0130 - 0x0108)
class UMovieScene3DConstraintSection : public UMovieSceneSection
{
public:
	struct FGuid                                  ConstraintID;                                      // 0x0108(0x0010)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMovieSceneObjectBindingID             ConstraintBindingID;                               // 0x0118(0x0018)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetConstraintBindingID(const struct FMovieSceneObjectBindingID& InConstraintBindingID);

	const struct FMovieSceneObjectBindingID GetConstraintBindingID() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DConstraintSection">();
	}
	static class UMovieScene3DConstraintSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DConstraintSection>();
	}
};

// Class MovieSceneTracks.MovieScene3DAttachSection
// 0x0020 (0x0150 - 0x0130)
class UMovieScene3DAttachSection final : public UMovieScene3DConstraintSection
{
public:
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   AttachSocketName;                                  // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachComponentName;                               // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AttachmentLocationRule;                            // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AttachmentRotationRule;                            // 0x0149(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AttachmentScaleRule;                               // 0x014A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               DetachmentLocationRule;                            // 0x014B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               DetachmentRotationRule;                            // 0x014C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               DetachmentScaleRule;                               // 0x014D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DAttachSection">();
	}
	static class UMovieScene3DAttachSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DAttachSection>();
	}
};

// Class MovieSceneTracks.MovieScene3DPathSection
// 0x0118 (0x0248 - 0x0130)
class UMovieScene3DPathSection final : public UMovieScene3DConstraintSection
{
public:
	struct FMovieSceneFloatChannel                TimingCurve;                                       // 0x0130(0x0110)(NativeAccessSpecifierPublic)
	EMovieScene3DPathSection_Axis                 FrontAxisEnum;                                     // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieScene3DPathSection_Axis                 UpAxisEnum;                                        // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	uint8                                         bFollow : 1;                                       // 0x0244(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReverse : 1;                                      // 0x0244(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bForceUpright : 1;                                 // 0x0244(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DPathSection">();
	}
	static class UMovieScene3DPathSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DPathSection>();
	}
};

// Class MovieSceneTracks.MovieSceneCVarTrack
// 0x0010 (0x0120 - 0x0110)
class UMovieSceneCVarTrack final : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0110(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCVarTrack">();
	}
	static class UMovieSceneCVarTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCVarTrack>();
	}
};

// Class MovieSceneTracks.MovieScene3DTransformSectionConstraints
// 0x0010 (0x0038 - 0x0028)
class UMovieScene3DTransformSectionConstraints final : public UObject
{
public:
	TArray<struct FConstraintAndActiveChannel>    ConstraintsChannels;                               // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DTransformSectionConstraints">();
	}
	static class UMovieScene3DTransformSectionConstraints* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DTransformSectionConstraints>();
	}
};

// Class MovieSceneTracks.MovieScene3DTransformSection
// 0x0B48 (0x0C50 - 0x0108)
class UMovieScene3DTransformSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_108[0x40];                                     // 0x0108(0x0040)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMovieSceneTransformMask               TransformMask;                                     // 0x0148(0x0004)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMovieSceneDoubleChannel               Translation[0x3];                                  // 0x0150(0x0118)(NativeAccessSpecifierPrivate)
	struct FMovieSceneDoubleChannel               Rotation[0x3];                                     // 0x0498(0x0118)(NativeAccessSpecifierPrivate)
	struct FMovieSceneDoubleChannel               Scale[0x3];                                        // 0x07E0(0x0118)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                ManualWeight;                                      // 0x0B28(0x0110)(NativeAccessSpecifierPrivate)
	class UMovieSceneSectionChannelOverrideRegistry* OverrideRegistry;                               // 0x0C38(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMovieScene3DTransformSectionConstraints* Constraints;                                     // 0x0C40(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseQuaternionInterpolation;                       // 0x0C48(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C49[0x7];                                      // 0x0C49(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene3DTransformSection">();
	}
	static class UMovieScene3DTransformSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene3DTransformSection>();
	}
};

// Class MovieSceneTracks.MovieSceneMaterialTrack
// 0x0018 (0x0128 - 0x0110)
class UMovieSceneMaterialTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0110(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UMovieSceneSection*                     SectionToKey;                                      // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneMaterialTrack">();
	}
	static class UMovieSceneMaterialTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneMaterialTrack>();
	}
};

// Class MovieSceneTracks.MovieSceneActorReferenceSection
// 0x01B0 (0x02B8 - 0x0108)
class UMovieSceneActorReferenceSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneActorReferenceData          ActorReferenceData;                                // 0x0108(0x0120)(NativeAccessSpecifierPrivate)
	struct FIntegralCurve                         ActorGuidIndexCurve;                               // 0x0228(0x0080)(Deprecated, NativeAccessSpecifierPrivate)
	TArray<class FString>                         ActorGuidStrings;                                  // 0x02A8(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneActorReferenceSection">();
	}
	static class UMovieSceneActorReferenceSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneActorReferenceSection>();
	}
};

// Class MovieSceneTracks.MovieSceneAudioSection
// 0x0540 (0x0648 - 0x0108)
class UMovieSceneAudioSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundBase*                             Sound;                                             // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameNumber                           StartFrameOffset;                                  // 0x0120(0x0004)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         StartOffset;                                       // 0x0124(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AudioStartTime;                                    // 0x0128(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AudioDilationFactor;                               // 0x012C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AudioVolume;                                       // 0x0130(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMovieSceneFloatChannel                SoundVolume;                                       // 0x0138(0x0110)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                PitchMultiplier;                                   // 0x0248(0x0110)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneFloatChannel> Inputs_Float;                                  // 0x0358(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneStringChannel> Inputs_String;                                // 0x03A8(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneBoolChannel> Inputs_Bool;                                    // 0x03F8(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneIntegerChannel> Inputs_Int;                                  // 0x0448(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneAudioTriggerChannel> Inputs_Trigger;                         // 0x0498(0x0050)(NativeAccessSpecifierPrivate)
	struct FMovieSceneActorReferenceData          AttachActorData;                                   // 0x04E8(0x0120)(NativeAccessSpecifierPrivate)
	bool                                          bLooping;                                          // 0x0608(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSuppressSubtitles;                                // 0x0609(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bOverrideAttenuation;                              // 0x060A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60B[0x5];                                      // 0x060B(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundAttenuation*                      AttenuationSettings;                               // 0x0610(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const TArray<struct FSubtitleCue>& Subtitles, float CueDuration)> OnQueueSubtitles; // 0x0618(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnAudioFinished;                                   // 0x0628(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const class USoundWave* PlayingSoundWave, const float PlaybackPercent)> OnAudioPlaybackPercent; // 0x0638(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPrivate)

public:
	void SetAttenuationSettings(class USoundAttenuation* InAttenuationSettings);
	void SetLooping(bool bInLooping);
	void SetOverrideAttenuation(bool bInOverrideAttenuation);
	void SetSound(class USoundBase* InSound);
	void SetStartOffset(const struct FFrameNumber& InStartOffset);
	void SetSuppressSubtitles(bool bInSuppressSubtitles);

	class USoundAttenuation* GetAttenuationSettings() const;
	bool GetLooping() const;
	bool GetOverrideAttenuation() const;
	class USoundBase* GetPlaybackSound() const;
	class USoundBase* GetSound() const;
	struct FFrameNumber GetStartOffset() const;
	bool GetSuppressSubtitles() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneAudioSection">();
	}
	static class UMovieSceneAudioSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneAudioSection>();
	}
};

// Class MovieSceneTracks.MovieSceneEulerTransformTrack
// 0x0000 (0x0140 - 0x0140)
class UMovieSceneEulerTransformTrack final : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEulerTransformTrack">();
	}
	static class UMovieSceneEulerTransformTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEulerTransformTrack>();
	}
};

// Class MovieSceneTracks.MovieSceneBaseCacheSection
// 0x0008 (0x0110 - 0x0108)
class UMovieSceneBaseCacheSection : public UMovieSceneSection
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBaseCacheSection">();
	}
	static class UMovieSceneBaseCacheSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBaseCacheSection>();
	}
};

// Class MovieSceneTracks.MovieSceneByteSection
// 0x0118 (0x0220 - 0x0108)
class UMovieSceneByteSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMovieSceneByteChannel                 ByteCurve;                                         // 0x0110(0x0110)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneByteSection">();
	}
	static class UMovieSceneByteSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneByteSection>();
	}
};

// Class MovieSceneTracks.MovieSceneColorTrack
// 0x0008 (0x0148 - 0x0140)
class UMovieSceneColorTrack final : public UMovieScenePropertyTrack
{
public:
	bool                                          bIsSlateColor;                                     // 0x0140(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneColorTrack">();
	}
	static class UMovieSceneColorTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneColorTrack>();
	}
};

// Class MovieSceneTracks.MovieSceneCameraCutSection
// 0x00A8 (0x01B0 - 0x0108)
class UMovieSceneCameraCutSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bLockPreviousCamera;                               // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGuid                                  CameraGuid;                                        // 0x0114(0x0010)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMovieSceneObjectBindingID             CameraBindingID;                                   // 0x0124(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             InitialCameraCutTransform;                         // 0x0140(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasInitialCameraCutTransform;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A1[0xF];                                      // 0x01A1(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetCameraBindingID(const struct FMovieSceneObjectBindingID& InCameraBindingID);

	const struct FMovieSceneObjectBindingID GetCameraBindingID() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCameraCutSection">();
	}
	static class UMovieSceneCameraCutSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCameraCutSection>();
	}
};

// Class MovieSceneTracks.MovieSceneCameraShakeSection
// 0x0058 (0x0160 - 0x0108)
class UMovieSceneCameraShakeSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMovieSceneCameraShakeSectionData      ShakeData;                                         // 0x0110(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraShakeBase>           ShakeClass;                                        // 0x0138(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayScale;                                         // 0x0140(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraShakePlaySpace                         PlaySpace;                                         // 0x0144(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRotator                               UserDefinedPlaySpace;                              // 0x0148(0x0018)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCameraShakeSection">();
	}
	static class UMovieSceneCameraShakeSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCameraShakeSection>();
	}
};

// Class MovieSceneTracks.MovieSceneIntegerTrack
// 0x0000 (0x0140 - 0x0140)
class UMovieSceneIntegerTrack final : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneIntegerTrack">();
	}
	static class UMovieSceneIntegerTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneIntegerTrack>();
	}
};

// Class MovieSceneTracks.MovieSceneCameraShakeSourceShakeSection
// 0x0030 (0x0138 - 0x0108)
class UMovieSceneCameraShakeSourceShakeSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMovieSceneCameraShakeSectionData      ShakeData;                                         // 0x0110(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCameraShakeSourceShakeSection">();
	}
	static class UMovieSceneCameraShakeSourceShakeSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCameraShakeSourceShakeSection>();
	}
};

// Class MovieSceneTracks.MovieSceneCameraShakeSourceTriggerSection
// 0x0100 (0x0208 - 0x0108)
class UMovieSceneCameraShakeSourceTriggerSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMovieSceneCameraShakeSourceTriggerChannel Channel;                                       // 0x0110(0x00F8)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCameraShakeSourceTriggerSection">();
	}
	static class UMovieSceneCameraShakeSourceTriggerSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCameraShakeSourceTriggerSection>();
	}
};

// Class MovieSceneTracks.MovieSceneFloatTrack
// 0x0000 (0x0140 - 0x0140)
class UMovieSceneFloatTrack : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneFloatTrack">();
	}
	static class UMovieSceneFloatTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneFloatTrack>();
	}
};

// Class MovieSceneTracks.MovieSceneSlomoTrack
// 0x0000 (0x0140 - 0x0140)
class UMovieSceneSlomoTrack final : public UMovieSceneFloatTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSlomoTrack">();
	}
	static class UMovieSceneSlomoTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSlomoTrack>();
	}
};

// Class MovieSceneTracks.MovieSceneCinematicShotSection
// 0x0020 (0x0810 - 0x07F0)
class UMovieSceneCinematicShotSection final : public UMovieSceneSubSection
{
public:
	class FString                                 ShotDisplayName;                                   // 0x07F0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                   DisplayName;                                       // 0x0800(0x0010)(Deprecated, NativeAccessSpecifierPrivate)

public:
	void SetShotDisplayName(const class FString& InShotDisplayName);

	class FString GetShotDisplayName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCinematicShotSection">();
	}
	static class UMovieSceneCinematicShotSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCinematicShotSection>();
	}
};

// Class MovieSceneTracks.MovieSceneColorSection
// 0x0448 (0x0550 - 0x0108)
class UMovieSceneColorSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMovieSceneFloatChannel                RedCurve;                                          // 0x0110(0x0110)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                GreenCurve;                                        // 0x0220(0x0110)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                BlueCurve;                                         // 0x0330(0x0110)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                AlphaCurve;                                        // 0x0440(0x0110)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneColorSection">();
	}
	static class UMovieSceneColorSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneColorSection>();
	}
};

// Class MovieSceneTracks.MovieSceneComponentMaterialTrack
// 0x0020 (0x0148 - 0x0128)
class UMovieSceneComponentMaterialTrack final : public UMovieSceneMaterialTrack
{
public:
	uint8                                         Pad_128[0x10];                                     // 0x0128(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	struct FComponentMaterialInfo                 MaterialInfo;                                      // 0x0138(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneComponentMaterialTrack">();
	}
	static class UMovieSceneComponentMaterialTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneComponentMaterialTrack>();
	}
};

// Class MovieSceneTracks.MovieSceneComponentMaterialParameterSection
// 0x0028 (0x0130 - 0x0108)
class UMovieSceneComponentMaterialParameterSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FScalarMaterialParameterInfoAndCurve> ScalarParameterInfosAndCurves;               // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FColorMaterialParameterInfoAndCurves> ColorParameterInfosAndCurves;                // 0x0120(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void AddColorParameterKey(const struct FMaterialParameterInfo& InParameterInfo, const struct FFrameNumber& InTime, const struct FLinearColor& InValue, const class FString& InLayerName, const class FString& InAssetName, const struct FParameterChannelNames& InChannelNames);
	void AddScalarParameterKey(const struct FMaterialParameterInfo& InParameterInfo, const struct FFrameNumber& InTime, float InValue, const class FString& InLayerName, const class FString& InAssetName);
	bool RemoveColorParameter(const struct FMaterialParameterInfo& InParameterInfo);
	bool RemoveScalarParameter(const struct FMaterialParameterInfo& InParameterInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneComponentMaterialParameterSection">();
	}
	static class UMovieSceneComponentMaterialParameterSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneComponentMaterialParameterSection>();
	}
};

// Class MovieSceneTracks.MovieSceneConstrainedSection
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneConstrainedSection final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneConstrainedSection">();
	}
	static class IMovieSceneConstrainedSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneConstrainedSection>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class MovieSceneTracks.MovieSceneParameterSection
// 0x0068 (0x0170 - 0x0108)
class UMovieSceneParameterSection : public UMovieSceneSection
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FBoolParameterNameAndCurve>     BoolParameterNamesAndCurves;                       // 0x0110(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FScalarParameterNameAndCurve>   ScalarParameterNamesAndCurves;                     // 0x0120(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVector2DParameterNameAndCurves> Vector2DParameterNamesAndCurves;                  // 0x0130(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVectorParameterNameAndCurves>  VectorParameterNamesAndCurves;                     // 0x0140(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FColorParameterNameAndCurves>   ColorParameterNamesAndCurves;                      // 0x0150(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FTransformParameterNameAndCurves> TransformParameterNamesAndCurves;                // 0x0160(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void AddBoolParameterKey(class FName InParameterName, const struct FFrameNumber& InTime, bool InValue);
	void AddColorParameterKey(class FName InParameterName, const struct FFrameNumber& InTime, const struct FLinearColor& InValue);
	void AddScalarParameterKey(class FName InParameterName, const struct FFrameNumber& InTime, float InValue);
	void AddTransformParameterKey(class FName InParameterName, const struct FFrameNumber& InTime, const struct FTransform& InValue);
