#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NiagaraSimCaching

#include "Basic.hpp"

#include "NiagaraSimCaching_structs.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class NiagaraSimCaching.MovieSceneNiagaraCacheSection
// 0x0090 (0x01A0 - 0x0110)
class UMovieSceneNiagaraCacheSection final : public UMovieSceneBaseCacheSection
{
public:
	struct FMovieSceneNiagaraCacheParams          Params_0;                                          // 0x0110(0x0088)(Edit, NativeAccessSpecifierPublic)
	bool                                          bCacheOutOfDate;                                   // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraCacheSection">();
	}
	static class UMovieSceneNiagaraCacheSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraCacheSection>();
	}
};

// Class NiagaraSimCaching.MovieSceneNiagaraCacheTrack
// 0x0030 (0x0140 - 0x0110)
class UMovieSceneNiagaraCacheTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bIsRecording;                                      // 0x0120(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UMovieSceneSection*>             AnimationSections;                                 // 0x0128(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bCacheRecordingEnabled;                            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraCacheTrack">();
	}
	static class UMovieSceneNiagaraCacheTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraCacheTrack>();
	}
};

}

