#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NNEDenoiser

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "NNEDenoiser_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class NNEDenoiser.NNEDenoiserAsset
// 0x0088 (0x00B8 - 0x0030)
class UNNEDenoiserAsset final : public UDataAsset
{
public:
	TSoftObjectPtr<class UNNEModelData>           ModelData;                                         // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              InputMapping;                                      // 0x0058(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              OutputMapping;                                     // 0x0080(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTilingConfig                          TilingConfig;                                      // 0x00A8(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNEDenoiserAsset">();
	}
	static class UNNEDenoiserAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNEDenoiserAsset>();
	}
};

// Class NNEDenoiser.NNEDenoiserTemporalAsset
// 0x0088 (0x00B8 - 0x0030)
class UNNEDenoiserTemporalAsset final : public UDataAsset
{
public:
	TSoftObjectPtr<class UNNEModelData>           ModelData;                                         // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              InputMapping;                                      // 0x0058(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              OutputMapping;                                     // 0x0080(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTilingConfig                          TilingConfig;                                      // 0x00A8(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNEDenoiserTemporalAsset">();
	}
	static class UNNEDenoiserTemporalAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNEDenoiserTemporalAsset>();
	}
};

// Class NNEDenoiser.NNEDenoiserSettings
// 0x0068 (0x00A0 - 0x0038)
class UNNEDenoiserSettings final : public UDeveloperSettingsBackedByCVars
{
public:
	TSoftObjectPtr<class UNNEDenoiserAsset>       DenoiserAsset;                                     // 0x0038(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x28];                                      // 0x0060(0x0028)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         MaximumTileSizeOverride;                           // 0x0088(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDenoiserRuntimeType                          RuntimeType;                                       // 0x008C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 RuntimeName;                                       // 0x0090(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNEDenoiserSettings">();
	}
	static class UNNEDenoiserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNEDenoiserSettings>();
	}
};

}

