#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NNERuntimeORT

#include "Basic.hpp"

#include "NNERuntimeORT_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class NNERuntimeORT.NNERuntimeORTSettings
// 0x0020 (0x0058 - 0x0038)
class UNNERuntimeORTSettings final : public UDeveloperSettings
{
public:
	struct FThreadingOptions                      EditorThreadingOptions;                            // 0x0038(0x0010)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FThreadingOptions                      GameThreadingOptions;                              // 0x0048(0x0010)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeORTSettings">();
	}
	static class UNNERuntimeORTSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNERuntimeORTSettings>();
	}
};

// Class NNERuntimeORT.NNERuntimeORTCpu
// 0x0020 (0x0048 - 0x0028)
class UNNERuntimeORTCpu final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeORTCpu">();
	}
	static class UNNERuntimeORTCpu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNERuntimeORTCpu>();
	}
};

// Class NNERuntimeORT.NNERuntimeORTDmlProxy
// 0x0010 (0x0038 - 0x0028)
class UNNERuntimeORTDmlProxy : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeORTDmlProxy">();
	}
	static class UNNERuntimeORTDmlProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNERuntimeORTDmlProxy>();
	}
};

// Class NNERuntimeORT.NNERuntimeORTDml_GPU_RDG_NPU
// 0x0018 (0x0050 - 0x0038)
class UNNERuntimeORTDml_GPU_RDG_NPU final : public UNNERuntimeORTDmlProxy
{
public:
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeORTDml_GPU_RDG_NPU">();
	}
	static class UNNERuntimeORTDml_GPU_RDG_NPU* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNERuntimeORTDml_GPU_RDG_NPU>();
	}
};

// Class NNERuntimeORT.NNERuntimeORTDml_GPU_RDG
// 0x0010 (0x0048 - 0x0038)
class UNNERuntimeORTDml_GPU_RDG final : public UNNERuntimeORTDmlProxy
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeORTDml_GPU_RDG">();
	}
	static class UNNERuntimeORTDml_GPU_RDG* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNERuntimeORTDml_GPU_RDG>();
	}
};

// Class NNERuntimeORT.NNERuntimeORTDml_GPU_NPU
// 0x0010 (0x0048 - 0x0038)
class UNNERuntimeORTDml_GPU_NPU final : public UNNERuntimeORTDmlProxy
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeORTDml_GPU_NPU">();
	}
	static class UNNERuntimeORTDml_GPU_NPU* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNERuntimeORTDml_GPU_NPU>();
	}
};

// Class NNERuntimeORT.NNERuntimeORTDml_RDG_NPU
// 0x0010 (0x0048 - 0x0038)
class UNNERuntimeORTDml_RDG_NPU final : public UNNERuntimeORTDmlProxy
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeORTDml_RDG_NPU">();
	}
	static class UNNERuntimeORTDml_RDG_NPU* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNERuntimeORTDml_RDG_NPU>();
	}
};

// Class NNERuntimeORT.NNERuntimeORTDml_GPU
// 0x0008 (0x0040 - 0x0038)
class UNNERuntimeORTDml_GPU final : public UNNERuntimeORTDmlProxy
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeORTDml_GPU">();
	}
	static class UNNERuntimeORTDml_GPU* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNERuntimeORTDml_GPU>();
	}
};

// Class NNERuntimeORT.NNERuntimeORTDml_RDG
// 0x0008 (0x0040 - 0x0038)
class UNNERuntimeORTDml_RDG final : public UNNERuntimeORTDmlProxy
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeORTDml_RDG">();
	}
	static class UNNERuntimeORTDml_RDG* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNERuntimeORTDml_RDG>();
	}
};

// Class NNERuntimeORT.NNERuntimeORTDml_NPU
// 0x0008 (0x0040 - 0x0038)
class UNNERuntimeORTDml_NPU final : public UNNERuntimeORTDmlProxy
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeORTDml_NPU">();
	}
	static class UNNERuntimeORTDml_NPU* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNERuntimeORTDml_NPU>();
	}
};

}

