#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: oldABP_TwinEels_001

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function oldABP_TwinEels_001.oldABP_TwinEels_001_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct oldABP_TwinEels_001_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function oldABP_TwinEels_001.oldABP_TwinEels_001_C.ExecuteUbergraph_oldABP_TwinEels_001
// 0x0018 (0x0018 - 0x0000)
struct oldABP_TwinEels_001_C_ExecuteUbergraph_oldABP_TwinEels_001 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

