#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: OnlineSubsystemGPP

#include "Basic.hpp"

#include "GPP_structs.hpp"
#include "OnlineSubsystemGPP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function OnlineSubsystemGPP.AccelByteQrImage.GenerateQrTexture2DDynamic
// 0x0038 (0x0038 - 0x0000)
struct AccelByteQrImage_GenerateQrTexture2DDynamic final
{
public:
	int32                                         MaxTexSize;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 Text;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAccelByteQrOptions                    Options;                                           // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UTexture2DDynamic*                      ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.AccelByteQrImage.SetQrLogo
// 0x0008 (0x0008 - 0x0000)
struct AccelByteQrImage_SetQrLogo final
{
public:
	class UTexture2D*                             Logo;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.AccelByteQrImage.SetQrText
// 0x0010 (0x0010 - 0x0000)
struct AccelByteQrImage_SetQrText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPBaseScreen.GetUIMode
// 0x0001 (0x0001 - 0x0000)
struct GPPBaseScreen_GetUIMode final
{
public:
	EGPPUIMode                                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPurchaseLimitButtonItemWidget.OnClickBtnSelect
// 0x0001 (0x0001 - 0x0000)
struct GPPPurchaseLimitButtonItemWidget_OnClickBtnSelect final
{
public:
	bool                                          bInSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPAlertWidget.OnClickBtn_1_ForTwoBtnType
// 0x0001 (0x0001 - 0x0000)
struct GPPAlertWidget_OnClickBtn_1_ForTwoBtnType final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPAlertWidget.OnClickBtn_2_ForTwoBtnType
// 0x0001 (0x0001 - 0x0000)
struct GPPAlertWidget_OnClickBtn_2_ForTwoBtnType final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPAlertWidget.OnClickBtn_Btn_ForOneBtnType
// 0x0001 (0x0001 - 0x0000)
struct GPPAlertWidget_OnClickBtn_Btn_ForOneBtnType final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPBaseBtnWidget.GetEnable
// 0x0001 (0x0001 - 0x0000)
struct GPPBaseBtnWidget_GetEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPCountdownTimer.SetTimeout
// 0x0004 (0x0004 - 0x0000)
struct GPPCountdownTimer_SetTimeout final
{
public:
	float                                         InTimeout;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPCountdownTimer.StartCountdownUntil
// 0x0008 (0x0008 - 0x0000)
struct GPPCountdownTimer_StartCountdownUntil final
{
public:
	struct FDateTime                              InEndTime;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPCountdownTimer.IsPaused
// 0x0001 (0x0001 - 0x0000)
struct GPPCountdownTimer_IsPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPCountdownTimer.IsRunning
// 0x0001 (0x0001 - 0x0000)
struct GPPCountdownTimer_IsRunning final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPMaintenanceWidget.OnClickBtn_Confirm
// 0x0001 (0x0001 - 0x0000)
struct GPPMaintenanceWidget_OnClickBtn_Confirm final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPMaintenanceWidget.OnClickBtn_CopyDeviceId
// 0x0001 (0x0001 - 0x0000)
struct GPPMaintenanceWidget_OnClickBtn_CopyDeviceId final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPMaintenanceWidget.OnClickBtn_ShowDetail
// 0x0001 (0x0001 - 0x0000)
struct GPPMaintenanceWidget_OnClickBtn_ShowDetail final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPHeaderTabWidget.OnClicked_GPPMenuBtnWidget
// 0x0001 (0x0001 - 0x0000)
struct GPPHeaderTabWidget_OnClicked_GPPMenuBtnWidget final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPRepayBtnListWidget.OnClickBtn_RepayBtn
// 0x0008 (0x0008 - 0x0000)
struct GPPRepayBtnListWidget_OnClickBtn_RepayBtn final
{
public:
	class UGPPRepayBtnWidget*                     RepayBtnWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPIdentityGuestStartWidget.OnSelectButton
// 0x0001 (0x0001 - 0x0000)
struct GPPIdentityGuestStartWidget_OnSelectButton final
{
public:
	EGPPSelectButtonType                          pSelectButton;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPIdentitySelectPlatformWidget.GPPLogin
// 0x0018 (0x0018 - 0x0000)
struct GPPIdentitySelectPlatformWidget_GPPLogin final
{
public:
	class FString                                 pLoginType;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function OnlineSubsystemGPP.GPPIdentitySelectPlatformWidget.GPPShowSelectPlatformWidgetBP
// 0x0007 (0x0007 - 0x0000)
struct GPPIdentitySelectPlatformWidget_GPPShowSelectPlatformWidgetBP final
{
public:
	bool                                          pKID;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          pGoogle;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          pFacebook;                                         // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          pApple;                                            // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          pDiscord;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          pGuest;                                            // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPPlatformLoginType                          pLastLogin;                                        // 0x0006(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPIdentitySelectPlatformWidget.OnSelectPlatformComplete
// 0x0001 (0x0001 - 0x0000)
struct GPPIdentitySelectPlatformWidget_OnSelectPlatformComplete final
{
public:
	EGPPlatformLoginType                          InLoginType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPRepayDlgWidget.OnClickedMainBtn
// 0x0001 (0x0001 - 0x0000)
struct GPPRepayDlgWidget_OnClickedMainBtn final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPRepayDlgWidget.OnClickedSubBtn
// 0x0001 (0x0001 - 0x0000)
struct GPPRepayDlgWidget_OnClickedSubBtn final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPRepayDlgWidget.OnClickedSupportBtn
// 0x0001 (0x0001 - 0x0000)
struct GPPRepayDlgWidget_OnClickedSupportBtn final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPLinkKIDByPlatformTokenWidget.OnClickButton_Confirm
// 0x0001 (0x0001 - 0x0000)
struct GPPLinkKIDByPlatformTokenWidget_OnClickButton_Confirm final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPLegalAgreementListItemWidget.OnClick_Btn_Agree
// 0x0001 (0x0001 - 0x0000)
struct GPPLegalAgreementListItemWidget_OnClick_Btn_Agree final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPLegalAgreementListItemWidget.OnClick_Btn_OpenDetailLegalAgreement
// 0x0001 (0x0001 - 0x0000)
struct GPPLegalAgreementListItemWidget_OnClick_Btn_OpenDetailLegalAgreement final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPLegalAgreementListItemMobileWidget.OnClick_Btn_Agree2
// 0x0001 (0x0001 - 0x0000)
struct GPPLegalAgreementListItemMobileWidget_OnClick_Btn_Agree2 final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPLegalAgreementWidget.OnClick_Btn_Start
// 0x0001 (0x0001 - 0x0000)
struct GPPLegalAgreementWidget_OnClick_Btn_Start final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPLegalAgreementMobileWidget.OnClick_Btn_AgreeAllAndStart
// 0x0001 (0x0001 - 0x0000)
struct GPPLegalAgreementMobileWidget_OnClick_Btn_AgreeAllAndStart final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPendingLoginCompleteWidget.OnClickButton_AccountChecker
// 0x0001 (0x0001 - 0x0000)
struct GPPPendingLoginCompleteWidget_OnClickButton_AccountChecker final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPendingLoginCompleteWidget.OnClickButton_Cancel
// 0x0001 (0x0001 - 0x0000)
struct GPPPendingLoginCompleteWidget_OnClickButton_Cancel final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPendingLoginCompleteWidget.OnClickButton_Close
// 0x0001 (0x0001 - 0x0000)
struct GPPPendingLoginCompleteWidget_OnClickButton_Close final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPendingLoginCompleteWidget.OnClickButton_ConnectHandle
// 0x0001 (0x0001 - 0x0000)
struct GPPPendingLoginCompleteWidget_OnClickButton_ConnectHandle final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPendingLoginCompleteWidget.OnClickButton_HeadlessCheckEligibilityChecker
// 0x0001 (0x0001 - 0x0000)
struct GPPPendingLoginCompleteWidget_OnClickButton_HeadlessCheckEligibilityChecker final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPLegalAgreementListItemPCWidget.OnClick_Btn_AgreeBox
// 0x0001 (0x0001 - 0x0000)
struct GPPLegalAgreementListItemPCWidget_OnClick_Btn_AgreeBox final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPLegalAgreementPCWidget.OnClick_Btn_AgreeAll
// 0x0001 (0x0001 - 0x0000)
struct GPPLegalAgreementPCWidget_OnClick_Btn_AgreeAll final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPLegalAgreementPCWidget.OnClick_Btn_AgreeAllAndStart
// 0x0001 (0x0001 - 0x0000)
struct GPPLegalAgreementPCWidget_OnClick_Btn_AgreeAllAndStart final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPLegalAgreementPCWidget.OnClick_Btn_AgreeAllBox
// 0x0001 (0x0001 - 0x0000)
struct GPPLegalAgreementPCWidget_OnClick_Btn_AgreeAllBox final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPLinkKIDByGPGSWidget.OnClickButton_Cancel
// 0x0001 (0x0001 - 0x0000)
struct GPPLinkKIDByGPGSWidget_OnClickButton_Cancel final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPLinkKIDByGPGSWidget.OnClickButton_Confirm
// 0x0001 (0x0001 - 0x0000)
struct GPPLinkKIDByGPGSWidget_OnClickButton_Confirm final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPMaintenanceConsoleWidget.OnClickBtn_Confirm
// 0x0001 (0x0001 - 0x0000)
struct GPPMaintenanceConsoleWidget_OnClickBtn_Confirm final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPMaintenanceConsoleWidget.OnClickBtn_CopyDeviceId
// 0x0001 (0x0001 - 0x0000)
struct GPPMaintenanceConsoleWidget_OnClickBtn_CopyDeviceId final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPMaintenanceConsoleWidget.OnClickBtn_ShowDetail
// 0x0001 (0x0001 - 0x0000)
struct GPPMaintenanceConsoleWidget_OnClickBtn_ShowDetail final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPendingAlertWidget.OnClickButton_ForOneButtonClose
// 0x0001 (0x0001 - 0x0000)
struct GPPPendingAlertWidget_OnClickButton_ForOneButtonClose final
{
public:
	bool                                          bIsSelect;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPendingAlertWidget.OnClickButton_ForTwoButtonLeft
// 0x0001 (0x0001 - 0x0000)
struct GPPPendingAlertWidget_OnClickButton_ForTwoButtonLeft final
{
public:
	bool                                          bIsSelect;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPendingAlertWidget.OnClickButton_ForTwoButtonRight
// 0x0001 (0x0001 - 0x0000)
struct GPPPendingAlertWidget_OnClickButton_ForTwoButtonRight final
{
public:
	bool                                          bIsSelect;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPlatformLoginTypeBtnWidget.OnClickBtn
// 0x0001 (0x0001 - 0x0000)
struct GPPPlatformLoginTypeBtnWidget_OnClickBtn final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPlatformLoginWidget.OnClickBtn_Close
// 0x0001 (0x0001 - 0x0000)
struct GPPPlatformLoginWidget_OnClickBtn_Close final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPlatformLoginWidget.OnClickBtn_CopyDeviceId
// 0x0001 (0x0001 - 0x0000)
struct GPPPlatformLoginWidget_OnClickBtn_CopyDeviceId final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPlatformLoginWidget.OnClickBtn_PlatformButton
// 0x0001 (0x0001 - 0x0000)
struct GPPPlatformLoginWidget_OnClickBtn_PlatformButton final
{
public:
	EGPPlatformLoginType                          LoginType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPPurchaseLimitRadioButtonItemWidget.OnClickBtnSelect
// 0x0001 (0x0001 - 0x0000)
struct GPPPurchaseLimitRadioButtonItemWidget_OnClickBtnSelect final
{
public:
	bool                                          bInSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPRepayBtnWidget.OnClickedRepayBtn
// 0x0001 (0x0001 - 0x0000)
struct GPPRepayBtnWidget_OnClickedRepayBtn final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemGPP.GPPToastMessageWidget.OnClickBtn_Close
// 0x0001 (0x0001 - 0x0000)
struct GPPToastMessageWidget_OnClickBtn_Close final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

