#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PCGGeometryScriptInterop

#include "Basic.hpp"

#include "PCG_structs.hpp"
#include "PCG_classes.hpp"
#include "PCGGeometryScriptInterop_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ModelingOperators_structs.hpp"


namespace SDK
{

// Class PCGGeometryScriptInterop.PCGDynamicMeshBaseSettings
// 0x0000 (0x00C0 - 0x00C0)
class UPCGDynamicMeshBaseSettings : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGDynamicMeshBaseSettings">();
	}
	static class UPCGDynamicMeshBaseSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDynamicMeshBaseSettings>();
	}
};

// Class PCGGeometryScriptInterop.PCGAppendMeshesFromPointsSettings
// 0x0080 (0x0140 - 0x00C0)
class UPCGAppendMeshesFromPointsSettings final : public UPCGDynamicMeshBaseSettings
{
public:
	EPCGAppendMeshesFromPointsMode                Mode;                                              // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class UStaticMesh>             StaticMesh;                                        // 0x00C8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyInputSelector     MeshAttribute;                                     // 0x00F0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExtractMaterials;                                 // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometryScriptLODType                        RequestedLODType;                                  // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RequestedLODIndex;                                 // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSynchronousLoad;                                  // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAppendMeshesFromPointsSettings">();
	}
	static class UPCGAppendMeshesFromPointsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAppendMeshesFromPointsSettings>();
	}
};

// Class PCGGeometryScriptInterop.PCGBooleanOperationSettings
// 0x0018 (0x00D8 - 0x00C0)
class UPCGBooleanOperationSettings final : public UPCGDynamicMeshBaseSettings
{
public:
	EGeometryScriptBooleanOperation               BooleanOperation;                                  // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGeometryScriptMeshBooleanOptions      BooleanOperationOptions;                           // 0x00C4(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EPCGBooleanOperationTagInheritanceMode        TagInheritanceMode;                                // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGBooleanOperationMode                      Mode;                                              // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGBooleanOperationSettings">();
	}
	static class UPCGBooleanOperationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBooleanOperationSettings>();
	}
};

// Class PCGGeometryScriptInterop.PCGCreateEmptyDynamicMeshSettings
// 0x0000 (0x00C0 - 0x00C0)
class UPCGCreateEmptyDynamicMeshSettings final : public UPCGDynamicMeshBaseSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGCreateEmptyDynamicMeshSettings">();
	}
	static class UPCGCreateEmptyDynamicMeshSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCreateEmptyDynamicMeshSettings>();
	}
};

// Class PCGGeometryScriptInterop.PCGDynamicMeshData
// 0x0290 (0x0328 - 0x0098)
class UPCGDynamicMeshData final : public UPCGSpatialData
{
public:
	class UDynamicMesh*                           DynamicMesh;                                       // 0x0098(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x00A0(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x278];                                     // 0x00B0(0x0278)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void K2_Initialize(class UDynamicMesh* InMesh, const TArray<class UMaterialInterface*>& InMaterials, bool bCanTakeOwnership);
	void SetMaterials(const TArray<class UMaterialInterface*>& InMaterials);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGDynamicMeshData">();
	}
	static class UPCGDynamicMeshData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDynamicMeshData>();
	}
};

// Class PCGGeometryScriptInterop.PCGDynamicMeshManagedComponent
// 0x0008 (0x0068 - 0x0060)
class UPCGDynamicMeshManagedComponent final : public UPCGManagedComponent
{
public:
	uint64                                        DataUID;                                           // 0x0060(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGDynamicMeshManagedComponent">();
	}
	static class UPCGDynamicMeshManagedComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDynamicMeshManagedComponent>();
	}
};

// Class PCGGeometryScriptInterop.PCGDynamicMeshTransformSettings
// 0x0060 (0x0120 - 0x00C0)
class UPCGDynamicMeshTransformSettings final : public UPCGDynamicMeshBaseSettings
{
public:
	struct FTransform                             Transform;                                         // 0x00C0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGDynamicMeshTransformSettings">();
	}
	static class UPCGDynamicMeshTransformSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDynamicMeshTransformSettings>();
	}
};

// Class PCGGeometryScriptInterop.PCGGeometryBlueprintElement
// 0x0000 (0x0068 - 0x0068)
class UPCGGeometryBlueprintElement final : public UPCGBlueprintElement
{
public:
	void ProcessDynamicMesh(class UDynamicMesh* InDynMesh, TArray<class FString>* OutTags);

	class UPCGDynamicMeshData* CopyOrStealInputData(const struct FPCGTaggedData& InTaggedData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGGeometryBlueprintElement">();
	}
	static class UPCGGeometryBlueprintElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGGeometryBlueprintElement>();
	}
};

// Class PCGGeometryScriptInterop.PCGGetDynamicMeshDataSettings
// 0x0010 (0x01C0 - 0x01B0)
class UPCGGetDynamicMeshDataSettings final : public UPCGDataFromActorSettings
{
public:
	struct FGeometryScriptCopyMeshFromComponentOptions Options;                                      // 0x01B0(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGGetDynamicMeshDataSettings">();
	}
	static class UPCGGetDynamicMeshDataSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGGetDynamicMeshDataSettings>();
	}
};

// Class PCGGeometryScriptInterop.PCGMergeDynamicMeshesSettings
// 0x0000 (0x00C0 - 0x00C0)
class UPCGMergeDynamicMeshesSettings final : public UPCGDynamicMeshBaseSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGMergeDynamicMeshesSettings">();
	}
	static class UPCGMergeDynamicMeshesSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMergeDynamicMeshesSettings>();
	}
};

// Class PCGGeometryScriptInterop.PCGMeshSamplerSettings
// 0x00F8 (0x01B8 - 0x00C0)
class UPCGMeshSamplerSettings final : public UPCGSettings
{
public:
	bool                                          bExtractMeshFromInput;                             // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class UStaticMesh>             StaticMesh;                                        // 0x00C8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x00F0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGMeshSamplingMethod                        SamplingMethod;                                    // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseColorChannelAsDensity;                         // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	EPCGColorChannel                              ColorChannelAsDensity;                             // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVoxelize;                                         // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         VoxelSize;                                         // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveHiddenTriangles;                            // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometryScriptLODType                        RequestedLODType;                                  // 0x0141(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RequestedLODIndex;                                 // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptMeshPointSamplingOptions SamplingOptions;                                  // 0x0148(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FGeometryScriptNonUniformPointSamplingOptions NonUniformSamplingOptions;                  // 0x0168(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bExtractUVAsAttribute;                             // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   UVAttributeName;                                   // 0x0184(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UVChannel;                                         // 0x018C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputTriangleIds;                                // 0x0190(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   TriangleIdAttributeName;                           // 0x0194(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputMaterialInfo;                               // 0x019C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   MaterialIdAttributeName;                           // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaterialAttributeName;                             // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PointSteepness;                                    // 0x01B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSynchronousLoad;                                  // 0x01B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGMeshSamplerSettings">();
	}
	static class UPCGMeshSamplerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMeshSamplerSettings>();
	}
};

// Class PCGGeometryScriptInterop.PCGPrimitiveCrossSectionSettings
// 0x0088 (0x0148 - 0x00C0)
class UPCGPrimitiveCrossSectionSettings final : public UPCGSettings
{
public:
	struct FVector                                SliceDirection;                                    // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyOutputSelector    ExtrusionVectorAttribute;                          // 0x00D8(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinimumCoplanarVertices;                           // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxMeshVertexCount;                                // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTierMerging;                                // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        TierMergingThreshold;                              // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMinAreaCulling;                             // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        MinAreaCullingThreshold;                           // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveRedundantSections;                          // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGPrimitiveCrossSectionSettings">();
	}
	static class UPCGPrimitiveCrossSectionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGPrimitiveCrossSectionSettings>();
	}
};

// Class PCGGeometryScriptInterop.PCGSaveDynamicMeshToAssetSettings
// 0x00F8 (0x01B8 - 0x00C0)
class UPCGSaveDynamicMeshToAssetSettings final : public UPCGDynamicMeshBaseSettings
{
public:
	struct FPCGAssetExporterParameters            ExportParams;                                      // 0x00C0(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bExportMaterialsFromDynamicMesh;                   // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGeometryScriptCopyMeshToAssetOptions  CopyMeshToAssetOptions;                            // 0x00F8(0x00B8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGeometryScriptMeshWriteLOD            MeshWriteLOD;                                      // 0x01B0(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSaveDynamicMeshToAssetSettings">();
	}
	static class UPCGSaveDynamicMeshToAssetSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSaveDynamicMeshToAssetSettings>();
	}
};

// Class PCGGeometryScriptInterop.PCGSpawnDynamicMeshSettings
// 0x0038 (0x00F8 - 0x00C0)
class UPCGSpawnDynamicMeshSettings final : public UPCGDynamicMeshBaseSettings
{
public:
	TSoftObjectPtr<class AActor>                  TargetActor;                                       // 0x00C0(0x0028)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           PostProcessFunctionNames;                          // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSpawnDynamicMeshSettings">();
	}
	static class UPCGSpawnDynamicMeshSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSpawnDynamicMeshSettings>();
	}
};

// Class PCGGeometryScriptInterop.PCGSplineToMeshSettings
// 0x0038 (0x00F8 - 0x00C0)
class UPCGSplineToMeshSettings final : public UPCGDynamicMeshBaseSettings
{
public:
	double                                        ErrorTolerance;                                    // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFlattenCurveMethod                           FlattenMethod;                                     // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        Thickness;                                         // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlipResult;                                       // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOffsetOpenCurvesMethod                       OpenCurves;                                        // 0x00D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        CurveOffset;                                       // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOffsetClosedCurvesMethod                     OffsetClosedCurves;                                // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOpenCurveEndShapes                           EndShapes;                                         // 0x00E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOffsetJoinMethod                             JoinMethod;                                        // 0x00EA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	double                                        MiterLimit;                                        // 0x00F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSplineToMeshSettings">();
	}
	static class UPCGSplineToMeshSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSplineToMeshSettings>();
	}
};

// Class PCGGeometryScriptInterop.PCGStaticMeshToDynamicMeshSettings
// 0x0050 (0x0110 - 0x00C0)
class UPCGStaticMeshToDynamicMeshSettings final : public UPCGDynamicMeshBaseSettings
{
public:
	TSoftObjectPtr<class UStaticMesh>             StaticMesh;                                        // 0x00C0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExtractMaterials;                                 // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<TSoftObjectPtr<class UMaterialInterface>> OverrideMaterials;                              // 0x00F0(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	EGeometryScriptLODType                        RequestedLODType;                                  // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RequestedLODIndex;                                 // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSynchronousLoad;                                  // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGStaticMeshToDynamicMeshSettings">();
	}
	static class UPCGStaticMeshToDynamicMeshSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGStaticMeshToDynamicMeshSettings>();
	}
};

}

