#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: RigLogicModule

#include "Basic.hpp"

#include "RigLogicModule_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class RigLogicModule.DNAAsset
// 0x0118 (0x0140 - 0x0028)
class UDNAAsset final : public UAssetUserData
{
public:
	class FString                                 DnaFileName;                                       // 0x0028(0x0010)(ZeroConstructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepDNAAfterInitialization;                       // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<class FString, class FString>            MetaData;                                          // 0x0040(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRigLogicConfiguration                 RigLogicConfiguration;                             // 0x0090(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x98];                                      // 0x00A8(0x0098)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DNAAsset">();
	}
	static class UDNAAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDNAAsset>();
	}
};

// Class RigLogicModule.DNAIndexMapping
// 0x0000 (0x0028 - 0x0028)
class UDNAIndexMapping final : public UAssetUserData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DNAIndexMapping">();
	}
	static class UDNAIndexMapping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDNAIndexMapping>();
	}
};

// Class RigLogicModule.SkelMeshDNAUtils
// 0x0000 (0x0028 - 0x0028)
class USkelMeshDNAUtils final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkelMeshDNAUtils">();
	}
	static class USkelMeshDNAUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkelMeshDNAUtils>();
	}
};

}

