#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: TypedElementFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Enum TypedElementFramework.ESCCModification
// NumValues: 0x0005
enum class ESCCModification : uint32
{
	Modified                                 = 0,
	Added                                    = 1,
	Removed                                  = 2,
	Conflicted                               = 3,
	ESCCModification_MAX                     = 4,
};

// ScriptStruct TypedElementFramework.ScriptTypedElementHandle
// 0x0008 (0x0008 - 0x0000)
struct FScriptTypedElementHandle final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.EditorDataStorageColumn
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FEditorDataStorageColumn
{
};
#pragma pack(pop)

// ScriptStruct TypedElementFramework.EditorDataStorageTag
// 0x0001 (0x0001 - 0x0000)
struct FEditorDataStorageTag
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TypedElementUObjectColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementUObjectColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TypedElementUObjectIdColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementUObjectIdColumn final : public FEditorDataStorageColumn
{
public:
	uint32                                        ID;                                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SerialNumber;                                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementExternalObjectColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementExternalObjectColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TypedElementClassDefaultObjectTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementClassDefaultObjectTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementActorTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementActorTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementWorldColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementWorldColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TypedElementPropertyBagPlaceholderTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementPropertyBagPlaceholderTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementLoosePropertyTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementLoosePropertyTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementPropertyBagPlaceholderTypeInfoColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementPropertyBagPlaceholderTypeInfoColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.Test_PingPongPrePhys
// 0x0008 (0x0008 - 0x0000)
struct FTest_PingPongPrePhys final : public FEditorDataStorageColumn
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.Test_PingPongDurPhys
// 0x0008 (0x0008 - 0x0000)
struct FTest_PingPongDurPhys final : public FEditorDataStorageColumn
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.Test_PingPongPostPhys
// 0x0008 (0x0008 - 0x0000)
struct FTest_PingPongPostPhys final : public FEditorDataStorageColumn
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementWidgetConstructor
// 0x0080 (0x0080 - 0x0000)
struct FTypedElementWidgetConstructor
{
public:
	uint8                                         Pad_0[0x80];                                       // 0x0000(0x0080)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.SimpleWidgetConstructor
// 0x0000 (0x0080 - 0x0080)
struct FSimpleWidgetConstructor final : public FTypedElementWidgetConstructor
{
};

// ScriptStruct TypedElementFramework.FolderTag
// 0x0000 (0x0001 - 0x0001)
struct FFolderTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TedsRowHandle
// 0x0008 (0x0008 - 0x0000)
struct FTedsRowHandle final
{
public:
	uint64                                        RowHandle;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TableRowParentColumn
// 0x0008 (0x0008 - 0x0000)
struct FTableRowParentColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.UnresolvedTableRowParentColumn
// 0x0018 (0x0018 - 0x0000)
struct FUnresolvedTableRowParentColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TypedElementIconOverrideColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementIconOverrideColumn final : public FEditorDataStorageColumn
{
public:
	class FName                                   IconName;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementLabelColumn
// 0x0010 (0x0010 - 0x0000)
struct FTypedElementLabelColumn final : public FEditorDataStorageColumn
{
public:
	class FString                                 Label;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementLabelHashColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementLabelHashColumn final : public FEditorDataStorageColumn
{
public:
	uint64                                        LabelHash;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.ScriptTypedElementListProxy
// 0x0010 (0x0010 - 0x0000)
struct FScriptTypedElementListProxy final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TypedElementSyncBackToWorldTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSyncBackToWorldTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementSyncFromWorldTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSyncFromWorldTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementSyncFromWorldInteractiveTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSyncFromWorldInteractiveTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementRowReferenceColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementRowReferenceColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.NameColumn
// 0x0008 (0x0008 - 0x0000)
struct FNameColumn final : public FEditorDataStorageColumn
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.ObjectOverrideColumn
// 0x0001 (0x0001 - 0x0000)
struct FObjectOverrideColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TypedElementPackageUnresolvedReference
// 0x0010 (0x0010 - 0x0000)
struct FTypedElementPackageUnresolvedReference final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TypedElementPackageReference
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementPackageReference final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TypedElementPackageUpdatedTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementPackageUpdatedTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementPackagePathColumn
// 0x0010 (0x0010 - 0x0000)
struct FTypedElementPackagePathColumn final : public FEditorDataStorageColumn
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementPackageLoadedPathColumn
// 0x000C (0x000C - 0x0000)
struct FTypedElementPackageLoadedPathColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TypedElementPivotOffset
// 0x0018 (0x0018 - 0x0000)
struct FTypedElementPivotOffset final : public FEditorDataStorageColumn
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.SCCInChangelistTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCInChangelistTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.SCCStagedTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCStagedTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.SCCLockedTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCLockedTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.SCCExternallyEditedTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCExternallyEditedTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.SCCNotCurrentTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCNotCurrentTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.SCCStatusColumn
// 0x0004 (0x0004 - 0x0000)
struct FSCCStatusColumn final : public FEditorDataStorageColumn
{
public:
	ESCCModification                              Modification;                                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.SCCRevisionId
// 0x0014 (0x0014 - 0x0000)
struct FSCCRevisionId final
{
public:
	uint32                                        ID[0x5];                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.SCCRevisionIdColumn
// 0x0014 (0x0014 - 0x0000)
struct FSCCRevisionIdColumn final : public FEditorDataStorageColumn
{
public:
	struct FSCCRevisionId                         RevisionId;                                        // 0x0000(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.SCCExternalRevisionIdColumn
// 0x0014 (0x0014 - 0x0000)
struct FSCCExternalRevisionIdColumn final : public FEditorDataStorageColumn
{
public:
	struct FSCCRevisionId                         RevisionId;                                        // 0x0000(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.SCCUserInfo
// 0x0010 (0x0010 - 0x0000)
struct FSCCUserInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.SCCExternallyLockedColumn
// 0x0010 (0x0010 - 0x0000)
struct FSCCExternallyLockedColumn final : public FEditorDataStorageColumn
{
public:
	struct FSCCUserInfo                           LockedBy;                                          // 0x0000(0x0010)(NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementSelectionColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementSelectionColumn final : public FEditorDataStorageColumn
{
public:
	class FName                                   SelectionSet;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementSlateWidgetReferenceColumn
// 0x0030 (0x0030 - 0x0000)
struct FTypedElementSlateWidgetReferenceColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TypedElementSlateWidgetReferenceDeletesRowTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSlateWidgetReferenceDeletesRowTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.DisplayNameColumn
// 0x0010 (0x0010 - 0x0000)
struct FDisplayNameColumn final : public FEditorDataStorageColumn
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0010)(NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.DescriptionColumn
// 0x0010 (0x0010 - 0x0000)
struct FDescriptionColumn final : public FEditorDataStorageColumn
{
public:
	class FText                                   Description;                                       // 0x0000(0x0010)(NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.SlateColorColumn
// 0x0014 (0x0014 - 0x0000)
struct FSlateColorColumn final : public FEditorDataStorageColumn
{
public:
	struct FSlateColor                            Color;                                             // 0x0000(0x0014)(NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.IsInEditingModeTag
// 0x0000 (0x0001 - 0x0001)
struct FIsInEditingModeTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TestColumnA
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnA final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TestColumnB
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnB final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TestColumnC
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnC final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TestColumnD
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnD final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TestColumnE
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnE final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TestColumnF
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnF final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TestColumnG
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnG final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TestColumnDynamic
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnDynamic final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TestColumnInt
// 0x0004 (0x0004 - 0x0000)
struct FTestColumnInt final : public FEditorDataStorageColumn
{
public:
	int32                                         TestInt;                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TestColumnString
// 0x0010 (0x0010 - 0x0000)
struct FTestColumnString final : public FEditorDataStorageColumn
{
public:
	class FString                                 TestString;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TestTagColumnA
// 0x0000 (0x0001 - 0x0001)
struct FTestTagColumnA final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TestTagColumnB
// 0x0000 (0x0001 - 0x0001)
struct FTestTagColumnB final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TestTagColumnC
// 0x0000 (0x0001 - 0x0001)
struct FTestTagColumnC final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TestTagColumnD
// 0x0000 (0x0001 - 0x0001)
struct FTestTagColumnD final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TEDSProcessorTestsReferenceColumn
// 0x0010 (0x0010 - 0x0000)
struct FTEDSProcessorTestsReferenceColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TEDSProcessorTests_PrimaryTag
// 0x0000 (0x0001 - 0x0001)
struct FTEDSProcessorTests_PrimaryTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TEDSProcessorTests_SecondaryTag
// 0x0000 (0x0001 - 0x0001)
struct FTEDSProcessorTests_SecondaryTag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TEDSProcessorTests_Linked
// 0x0000 (0x0001 - 0x0001)
struct FTEDSProcessorTests_Linked final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementLocalTransformColumn
// 0x0060 (0x0060 - 0x0000)
struct FTypedElementLocalTransformColumn final : public FEditorDataStorageColumn
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementClassTypeInfoColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementClassTypeInfoColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.TypedElementScriptStructTypeInfoColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementScriptStructTypeInfoColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.HideRowFromUITag
// 0x0000 (0x0001 - 0x0001)
struct FHideRowFromUITag final : public FEditorDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementU32IntValueCacheColumn
// 0x0004 (0x0004 - 0x0000)
struct FTypedElementU32IntValueCacheColumn final : public FEditorDataStorageColumn
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementI32IntValueCacheColumn
// 0x0004 (0x0004 - 0x0000)
struct FTypedElementI32IntValueCacheColumn final : public FEditorDataStorageColumn
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementU64IntValueCacheColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementU64IntValueCacheColumn final : public FEditorDataStorageColumn
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementI64IntValueCacheColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementI64IntValueCacheColumn final : public FEditorDataStorageColumn
{
public:
	int64                                         Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementFloatValueCacheColumn
// 0x0004 (0x0004 - 0x0000)
struct FTypedElementFloatValueCacheColumn final : public FEditorDataStorageColumn
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementViewportOutlineColorColumn
// 0x0001 (0x0001 - 0x0000)
struct FTypedElementViewportOutlineColorColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         SelectionOutlineColorIndex;                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementViewportOverlayColorColumn
// 0x0004 (0x0004 - 0x0000)
struct FTypedElementViewportOverlayColorColumn final : public FEditorDataStorageColumn
{
public:
	struct FColor                                 OverlayColor;                                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.VisibleInEditorColumn
// 0x0001 (0x0001 - 0x0000)
struct FVisibleInEditorColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.EditorDataStorageUrlColumn
// 0x0010 (0x0010 - 0x0000)
struct FEditorDataStorageUrlColumn final : public FEditorDataStorageColumn
{
public:
	class FString                                 UrlString;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.EditorDataStorageWebImageColumn
// 0x0018 (0x0018 - 0x0000)
struct FEditorDataStorageWebImageColumn final : public FEditorDataStorageColumn
{
public:
	class FString                                 UrlString;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        Width;                                             // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        Height;                                            // 0x0012(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.WidgetPurposeColumn
// 0x0020 (0x0020 - 0x0000)
struct FWidgetPurposeColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.WidgetPurposeNameColumn
// 0x0018 (0x0018 - 0x0000)
struct FWidgetPurposeNameColumn final : public FEditorDataStorageColumn
{
public:
	class FName                                   Namespace;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Frame;                                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.WidgetFactoryColumn
// 0x0008 (0x0008 - 0x0000)
struct FWidgetFactoryColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.WidgetFactoryConstructorTypeInfoColumn
// 0x0008 (0x0008 - 0x0000)
struct FWidgetFactoryConstructorTypeInfoColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.WidgetFactoryConstructorColumn
// 0x0008 (0x0008 - 0x0000)
struct FWidgetFactoryConstructorColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct TypedElementFramework.WidgetFactoryConditionsColumn
// 0x0288 (0x0288 - 0x0000)
struct FWidgetFactoryConditionsColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x288];                                      // 0x0000(0x0288)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

