#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UDS_Cloud_Paint_Container

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass UDS_Cloud_Paint_Container.UDS_Cloud_Paint_Container_C
// 0x344A2D50 (0x344A3000 - 0x02B0)
class alignas(0x344A3000) AUDS_Cloud_Paint_Container_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<struct FIntPoint, class UUDS_Cloud_Paint_Cell_C*> Cloud_Painting_Cell_Data;                 // 0x02C8(0x0050)(Edit, BlueprintVisible)
	int32                                         Cloud_Painting_Cell_Size;                          // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cloud_Painting_Cell_Resolution;                    // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FIntPoint, class UTextureRenderTarget2D*> Cell_Render_Targets;                       // 0x0320(0x0050)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_UDS_Cloud_Paint_Container(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UDS_Cloud_Paint_Container_C">();
	}
	static class AUDS_Cloud_Paint_Container_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUDS_Cloud_Paint_Container_C>();
	}
};

}

