#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEActorUID

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum UWEActorUID.EUWEActorUIDInstanceState
// NumValues: 0x0004
enum class EUWEActorUIDInstanceState : uint8
{
	Invalid                                  = 0,
	Unloaded                                 = 1,
	Valid                                    = 2,
	EUWEActorUIDInstanceState_MAX            = 3,
};

// ScriptStruct UWEActorUID.UWEActorUID
// 0x0010 (0x0010 - 0x0000)
struct FUWEActorUID final
{
public:
	struct FGuid                                  InternalId;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct UWEActorUID.UWEActorUIDInstance
// 0x000C (0x000C - 0x0000)
struct FUWEActorUIDInstance final
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWEActorUID.UWEActorUIDCallbackWrapper
// 0x0050 (0x0050 - 0x0000)
struct FUWEActorUIDCallbackWrapper final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bExecuteOnce;                                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

