#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEAbilityTask

#include "Basic.hpp"

#include "GameplayAbilities_classes.hpp"
#include "UWEAbilityTask_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class UWEAbilityTask.UWEAbilityTask_WaitActivateAbilityByClass
// 0x0048 (0x00C8 - 0x0080)
class UUWEAbilityTask_WaitActivateAbilityByClass final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              OnCompleted;                                       // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCancelled;                                       // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailed;                                          // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UAbilitySystemComponent*                TargetASC;                                         // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UUWEAbilityTask_WaitActivateAbilityByClass* WaitActivateAbilityByClass(class UGameplayAbility* OwningAbility, TSubclassOf<class UGameplayAbility> InAbilityToActivate, class AActor* InActor, bool bInPredicted);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAbilityTask_WaitActivateAbilityByClass">();
	}
	static class UUWEAbilityTask_WaitActivateAbilityByClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAbilityTask_WaitActivateAbilityByClass>();
	}
};

// Class UWEAbilityTask.AUWEGameplayAbilityTargetActor_ActorList
// 0x0010 (0x0400 - 0x03F0)
class AAUWEGameplayAbilityTargetActor_ActorList final : public AGameplayAbilityTargetActor
{
public:
	TArray<TWeakObjectPtr<class AActor>>          CachedActors;                                      // 0x03F0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AUWEGameplayAbilityTargetActor_ActorList">();
	}
	static class AAUWEGameplayAbilityTargetActor_ActorList* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAUWEGameplayAbilityTargetActor_ActorList>();
	}
};

// Class UWEAbilityTask.UWEAbilityTask_WaitTargetDataBase
// 0x0020 (0x00A0 - 0x0080)
class UUWEAbilityTask_WaitTargetDataBase : public UAbilityTask
{
public:
	class AGameplayAbilityTargetActor*            TargetActor;                                       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x18];                                      // 0x0088(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnTargetDataCancelledCallback(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTargetDataReadyCallback(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTargetDataReplicatedCallback(const struct FGameplayAbilityTargetDataHandle& Data, const struct FGameplayTag& ActivationTag);
	void OnTargetDataReplicatedCancelledCallback();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAbilityTask_WaitTargetDataBase">();
	}
	static class UUWEAbilityTask_WaitTargetDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAbilityTask_WaitTargetDataBase>();
	}
};

// Class UWEAbilityTask.UWEAbilityTask_WaitActorList
// 0x0030 (0x00D0 - 0x00A0)
class UUWEAbilityTask_WaitActorList final : public UUWEAbilityTask_WaitTargetDataBase
{
public:
	TMulticastInlineDelegate<void(const TArray<class AActor*>& OutActors)> ValidData;                // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<class AActor*>& OutActors)> Cancelled;                // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class AActor>>          Actors;                                            // 0x00C0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UUWEAbilityTask_WaitActorList* WaitActorListSynced(class UGameplayAbility* OwningAbility, const TArray<class AActor*>& InActors);

	TArray<class AActor*> GetActors() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAbilityTask_WaitActorList">();
	}
	static class UUWEAbilityTask_WaitActorList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAbilityTask_WaitActorList>();
	}
};

// Class UWEAbilityTask.AUWEGameplayAbilityTargetActor_AimTransform
// 0x0030 (0x0420 - 0x03F0)
class AAUWEGameplayAbilityTargetActor_AimTransform final : public AGameplayAbilityTargetActor
{
public:
	struct FUWEAimTransform                       CachedAimTransform;                                // 0x03F0(0x0030)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AUWEGameplayAbilityTargetActor_AimTransform">();
	}
	static class AAUWEGameplayAbilityTargetActor_AimTransform* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAUWEGameplayAbilityTargetActor_AimTransform>();
	}
};

// Class UWEAbilityTask.UWEAbilityTask_WaitAimTransform
// 0x0080 (0x0120 - 0x00A0)
class UUWEAbilityTask_WaitAimTransform final : public UUWEAbilityTask_WaitTargetDataBase
{
public:
	TMulticastInlineDelegate<void(const struct FTransform& AimTransform)> ValidData;                 // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FTransform& AimTransform)> Cancelled;                 // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x60];                                      // 0x00C0(0x0060)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UUWEAbilityTask_WaitAimTransform* WaitAimTransformSynced(class UGameplayAbility* OwningAbility, const struct FTransform& AimTransform, class FName TaskInstanceName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAbilityTask_WaitAimTransform">();
	}
	static class UUWEAbilityTask_WaitAimTransform* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAbilityTask_WaitAimTransform>();
	}
};

// Class UWEAbilityTask.UWEAbilityTask_WaitFloatValue
// 0x0028 (0x00A8 - 0x0080)
class UUWEAbilityTask_WaitFloatValue final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(float FloatValue)> OnFloatValue;                                   // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x18];                                      // 0x0090(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UUWEAbilityTask_WaitFloatValue* WaitFloatValue(class UGameplayAbility* OwningAbility, const float InFloatValue, class FName TaskInstanceName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAbilityTask_WaitFloatValue">();
	}
	static class UUWEAbilityTask_WaitFloatValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAbilityTask_WaitFloatValue>();
	}
};

// Class UWEAbilityTask.AUWEGameplayAbilityTargetActor_GenericValue
// 0x0060 (0x0450 - 0x03F0)
class AAUWEGameplayAbilityTargetActor_GenericValue final : public AGameplayAbilityTargetActor
{
public:
	struct FUWEGameplayAbilityTargetData_Generic  CachedData;                                        // 0x03F0(0x0060)(Edit, BlueprintVisible, ExposeOnSpawn, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AUWEGameplayAbilityTargetActor_GenericValue">();
	}
	static class AAUWEGameplayAbilityTargetActor_GenericValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAUWEGameplayAbilityTargetActor_GenericValue>();
	}
};

// Class UWEAbilityTask.UWEAbilityTask_WaitGenericValue
// 0x0078 (0x0118 - 0x00A0)
class UUWEAbilityTask_WaitGenericValue final : public UUWEAbilityTask_WaitTargetDataBase
{
public:
	TMulticastInlineDelegate<void(const struct FUWEGenericAbilityActorData& GenericValues)> ValidData; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FUWEGenericAbilityActorData            GenericValue;                                      // 0x00B0(0x0058)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UUWEAbilityTask_WaitGenericValue* WaitGenericValueSynced(class UGameplayAbility* OwningAbility, const struct FUWEGenericAbilityActorData& InGenericValue, class FName TaskInstanceName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAbilityTask_WaitGenericValue">();
	}
	static class UUWEAbilityTask_WaitGenericValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAbilityTask_WaitGenericValue>();
	}
};

}

