#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEAI

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "UWETickAggregation_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UWESequence_classes.hpp"
#include "UWEVolumeTracker_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "UWEAI_structs.hpp"
#include "UWEAssetRegistry_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UWEBreakable_structs.hpp"
#include "UWEAIMovement_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "UWEMath_classes.hpp"


namespace SDK
{

// Class UWEAI.EQT_Bulk
// 0x0000 (0x01F8 - 0x01F8)
class UEQT_Bulk final : public UEnvQueryTest
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EQT_Bulk">();
	}
	static class UEQT_Bulk* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEQT_Bulk>();
	}
};

// Class UWEAI.EQT_Keywords
// 0x0048 (0x0240 - 0x01F8)
class UEQT_Keywords final : public UEnvQueryTest
{
public:
	struct FGameplayTagQuery                      TagQueryToMatch;                                   // 0x01F8(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EQT_Keywords">();
	}
	static class UEQT_Keywords* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEQT_Keywords>();
	}
};

// Class UWEAI.EQT_OutOfBounds
// 0x0000 (0x01F8 - 0x01F8)
class UEQT_OutOfBounds final : public UEnvQueryTest
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EQT_OutOfBounds">();
	}
	static class UEQT_OutOfBounds* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEQT_OutOfBounds>();
	}
};

// Class UWEAI.EQT_Water
// 0x0000 (0x01F8 - 0x01F8)
class UEQT_Water final : public UEnvQueryTest
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EQT_Water">();
	}
	static class UEQT_Water* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEQT_Water>();
	}
};

// Class UWEAI.UWEAIActionComponent
// 0x0020 (0x00E0 - 0x00C0)
class UUWEAIActionComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class AAIController*                          AIOwner;                                           // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnGameplayTagRemove(const struct FGameplayTag& InTag, int32 NewCount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIActionComponent">();
	}
	static class UUWEAIActionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIActionComponent>();
	}
};

// Class UWEAI.UWEAIAnimationSequenceActor
// 0x0010 (0x0380 - 0x0370)
class AUWEAIAnimationSequenceActor : public AUWESerializedLevelSequenceActor
{
public:
	class UUWESweepTestEnforceComponent*          SweepTestEnforceComponent;                         // 0x0370(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ActorBindingTag;                                   // 0x0378(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIAnimationSequenceActor">();
	}
	static class AUWEAIAnimationSequenceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEAIAnimationSequenceActor>();
	}
};

// Class UWEAI.UWEAIArchetypeComponent
// 0x0150 (0x0210 - 0x00C0)
class UUWEAIArchetypeComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x20];                                      // 0x00C0(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	class UBehaviorTree*                          BehaviorTreeOverride;                              // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWEAIDecisionTargetInfo               DecisionTargetInfoOverride;                        // 0x00E8(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bForceDisableLODs;                                 // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAIArchetypeDataAsset*               ArchetypeData;                                     // 0x0178(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEAIArchetypeDataAsset*               LoadedArchetypeData;                               // 0x0180(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             ProfilesDataTable;                                 // 0x0188(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   CurrentProfileName;                                // 0x0190(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUWEAIProfileDataRow                   ActiveProfile;                                     // 0x0198(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C0[0x50];                                     // 0x01C0(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	struct FUWEAISoundData GetAISoundData(const struct FGameplayTag& InGameplayTag);
	TSoftObjectPtr<class UAnimMontage> GetAnimMontage(const struct FGameplayTag& InGameplayTag);
	struct FUWEAttackData GetAttackData(const struct FGameplayTag& AttackTag);
	class UFMODEvent* GetFMODEvent(const struct FGameplayTag& InGameplayTag);
	float GetLoseSightRadius();
	float GetPeripheralVisionAngleDegrees();
	float GetSightRadius();
	void LoadArchetypeData(const class UUWEAIArchetypeDataAsset* ArchetypeData_0);
	void SwitchProfile(class FName ProfileName);

	float GetAccelerationAwarenessPerSecond() const;
	struct FUWEAIProfileDataRow GetCurrentProfile() const;
	float GetDamageMultiplier() const;
	float GetDecelerationAwarenessPerSecond() const;
	const class UUWEAIArchetypeDataAsset* GetDefaultArchetypeData() const;
	float GetHabitatRadiusMultiplier() const;
	const class UUWEAIArchetypeDataAsset* GetLoadedArchetypeData() const;
	float GetLoseSightRadiusMultiplier() const;
	float GetPeripheralVisionAngleDegreesMultiplier() const;
	float GetSightRadiusMultiplier() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIArchetypeComponent">();
	}
	static class UUWEAIArchetypeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIArchetypeComponent>();
	}
};

// Class UWEAI.UWEAIArchetypeDataAsset
// 0x0778 (0x07C0 - 0x0048)
class UUWEAIArchetypeDataAsset final : public UUWEPrimaryDataAssetBase
{
public:
	struct FGameplayTag                           IdentifierTag;                                     // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Keywords;                                          // 0x0050(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Enemies;                                           // 0x0070(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Friendlies;                                        // 0x0090(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FUWEAIAwarenessParameters              Awareness;                                         // 0x00B0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<struct FGameplayTag, TSoftObjectPtr<class UAnimMontage>> Animations;                        // 0x00C0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FUWEAttackData> Attacks;                                        // 0x0110(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UFMODEvent>> Sounds;                              // 0x0160(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FUWEAISoundData> SoundsMap;                                     // 0x01B0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FUWEAIArchetypeProfile> ProfilesMap;                            // 0x0200(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FUWEAIAttackTicketData                 AttackTicketData;                                  // 0x0250(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UBehaviorTree>           BehaviorTree;                                      // 0x0258(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Brainless;                                         // 0x0280(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWEAILODParameters                    LODParameters;                                     // 0x0288(0x01C0)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          DisableCollisionAtProximityToPlayerOnClient;       // 0x0448(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DisableCollisionDistance;                          // 0x044C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableMeshCollisionAtProximityToPlayerOnAuthority; // 0x0450(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DisableMeshCollisionDistance;                      // 0x0454(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FUWEAITargetEvaluationData> UtilityTargets;                     // 0x0458(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FUWEAIHungerFactorData                 Hunger;                                            // 0x04A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWEAIHealthFactorData                 Health;                                            // 0x04C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWEAITemperFactorData                 Temper;                                            // 0x04D8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWEAIStaminaFactorData                Stamina;                                           // 0x04F0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FUWEAISmartObjectEvaluationData> UtilityActivities;             // 0x0508(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         QueryBoxHalfExtent;                                // 0x0558(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FindSmartObjectsTime;                              // 0x055C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FindPerceivedSmartObjectsOnly;                     // 0x0560(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UAISenseConfig*>                 SensesConfig;                                      // 0x0568(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TSubclassOf<class UAISense>                   DominantSense;                                     // 0x0578(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BroadcastPerceivedTargetToGroup;                   // 0x0580(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BroadcastPerceivedTargetToLeader;                  // 0x0581(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_582[0xE];                                      // 0x0582(0x000E)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWEAIMovementData                     MovementData;                                      // 0x0590(0x0230)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIArchetypeDataAsset">();
	}
	static class UUWEAIArchetypeDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIArchetypeDataAsset>();
	}
};

// Class UWEAI.UWEAIBaseRotationSwitcherComponent
// 0x0078 (0x0138 - 0x00C0)
class UUWEAIBaseRotationSwitcherComponent final : public UActorComponent
{
public:
	TMap<struct FGameplayTag, struct FWEAIBaseRotationSwitcherStateConfig> States;                   // 0x00C0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           DefaultStateTag;                                   // 0x0110(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AddReplicatedLooseGameplayTagToAbilitySystem;      // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          PauseOnCollisionWithStaticObstacle;                // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         StaticObstacleCollisionPauseTime;                  // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEAIMovementComponent*                MovementComponent;                                 // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x10];                                     // 0x0128(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetDefaultState();
	void SwitchState(const struct FGameplayTag& StateTag);

	struct FGameplayTag GetCurrentStateTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIBaseRotationSwitcherComponent">();
	}
	static class UUWEAIBaseRotationSwitcherComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIBaseRotationSwitcherComponent>();
	}
};

// Class UWEAI.UWEAIBehaviorTreeComponent
// 0x0000 (0x02B0 - 0x02B0)
class UUWEAIBehaviorTreeComponent final : public UBehaviorTreeComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIBehaviorTreeComponent">();
	}
	static class UUWEAIBehaviorTreeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIBehaviorTreeComponent>();
	}
};

// Class UWEAI.UWEAIBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UUWEAIBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TArray<class UUWEAIArchetypeDataAsset*> GetAIArchetypesWithDataAsset(class UUWEPrimaryDataAssetBase* DataAsset);
	static class FString GetAIMovementDescription(const class UUWEAIArchetypeDataAsset* ArchetypeDataAsset, class UUWEPrimaryDataAssetBase* DataAssetBase, bool DisplayDetails);
	static void GetAllCreatureClass(TArray<TSubclassOf<class AActor>>* OutAssets);
	static const class UUWEAIArchetypeDataAsset* GetArchetype(const struct FGameplayTag& ArchetypeId);
	static TSubclassOf<class AActor> GetCreatureClass(const struct FGameplayTag& ArchetypeId);
	static void OnAIMovementDataEdited(const class UUWEAIArchetypeDataAsset* Archetype, class UUWEPrimaryDataAssetBase* DataAssetBase);
	static void SetForceMultiplierByTerminalVelocity(const class UUWEAIArchetypeDataAsset* ArchetypeDataAsset, class UUWEAIMovementCoreModuleSettings* CoreModuleSettings, float TerminalVelocity);
	static class AUWEAIPawn* SpawnCreature(class UObject* WorldContextObject, TSubclassOf<class AActor> ActorClass, const struct FTransform& Transform, class UBehaviorTree* BehaviorTreeOverride);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIBlueprintFunctionLibrary">();
	}
	static class UUWEAIBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIBlueprintFunctionLibrary>();
	}
};

// Class UWEAI.UWEAICharacter
// 0x0038 (0x0680 - 0x0648)
class AUWEAICharacter final : public ACharacter
{
public:
	uint8                                         Pad_648[0x8];                                      // 0x0648(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAbilitySystemComponent*             UWEAbilitySystemComponent;                         // 0x0650(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEAIArchetypeComponent*               ArchetypeComponent;                                // 0x0658(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEHealthSetComponent*                 HealthSetComponent;                                // 0x0660(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWESurvivalSetComponent*               SurvivalSetComponent;                              // 0x0668(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEMovementSetComponent*               MovementSetComponent;                              // 0x0670(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEPhysicalSetComponent*               PhysicalSetComponent;                              // 0x0678(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void UpdateMaxSpeed();

	class UUWEAIArchetypeComponent* GetAIArchetypeComponent() const;
	class UUWEAbilitySystemComponent* GetASC() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAICharacter">();
	}
	static class AUWEAICharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEAICharacter>();
	}
};

// Class UWEAI.UWEAIController
// 0x0030 (0x0400 - 0x03D0)
class AUWEAIController final : public AAIController
{
public:
	class UUWEAIPerceptionComponent*              AIPerceptionComponent;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEAIDecisionComponent*                AIDecisionComponent;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEAIActionComponent*                  AIActionComponent;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEAILocomotionComponent*              AILocomotionComponent;                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEAIArchetypeComponent*               AIArchetypeComponent;                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUWEAILOD                                     CurrentLODLevel;                                   // 0x03F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void InitializeAIComponents();
	void OnProfileChanged();

	class UUWEAIActionComponent* GetAIAction() const;
	class UUWEAIArchetypeComponent* GetAIArchetype() const;
	class UUWEAIDecisionComponent* GetAIDecision() const;
	class UUWEAILocomotionComponent* GetAILocomotion() const;
	class UUWEAIPerceptionComponent* GetAIPerception() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIController">();
	}
	static class AUWEAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEAIController>();
	}
};

// Class UWEAI.UWEAIControllerTicker
// 0x00A8 (0x03D8 - 0x0330)
class AUWEAIControllerTicker final : public AUWEAggregatedActorTickerBase
{
public:
	TSet<class AUWEAIController*>                 Actors;                                            // 0x0330(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<class AUWEAIController*>                 ActorsLeftOver;                                    // 0x0380(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D0[0x8];                                      // 0x03D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIControllerTicker">();
	}
	static class AUWEAIControllerTicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEAIControllerTicker>();
	}
};

// Class UWEAI.UWEAICreatureHitData
// 0x0018 (0x0060 - 0x0048)
class UUWEAICreatureHitData final : public UUWEActorDataAsset
{
public:
	int32                                         HitEffectCount;                                    // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UUWEGameplayEffect>         EffectToApplyOnHit;                                // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUWEGameplayEffect>         EffectToApplyOnHitCountExceeded;                   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UUWEAICreatureHitData* GetCreatureHitDataForActor(const class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAICreatureHitData">();
	}
	static class UUWEAICreatureHitData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAICreatureHitData>();
	}
};

// Class UWEAI.UWEAIDecisionComponent
// 0x03C0 (0x0480 - 0x00C0)
class UUWEAIDecisionComponent final : public UActorComponent
{
public:
	struct FUWESmartObjectData                    SmartObjectData;                                   // 0x00C0(0x0068)(Edit, BlueprintVisible, Transient, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWEAttachmentData                     AttachmentData;                                    // 0x0128(0x0018)(Edit, BlueprintVisible, Transient, EditConst, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FUWEAIBehaviorTreeParams>       BehaviorTreeParams;                                // 0x0140(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_150[0x30];                                     // 0x0150(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  RegisteredStimulusTags;                            // 0x0180(0x0020)(Transient, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, class AActor*>      WorkerStimulusData;                                // 0x01A0(0x0050)(Transient, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  WorkerOwnedGameplayTags;                           // 0x01F0(0x0020)(Transient, NativeAccessSpecifierPublic)
	struct FUWEAIAttributeValues                  WorkerAttributeValues;                             // 0x0210(0x0024)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<class AActor*, struct FUWEAIPerceivedActorsData> WorkerPerceivedActorsData;                 // 0x0238(0x0050)(Transient, NativeAccessSpecifierPublic)
	TArray<struct FUWEAIIndexedUtilityValue>      AllChildren;                                       // 0x0288(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FUWEAIIndexedUtilityValue>      SortedChildren;                                    // 0x0298(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	struct FUWEAIIndexedUtilityValue              SelectedChild;                                     // 0x02A8(0x00C0)(Transient, NativeAccessSpecifierPublic)
	class AUWEAIController*                       AIOwner;                                           // 0x0368(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEAIArchetypeDataAsset*               ArchetypeData;                                     // 0x0370(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEHealthSetComponent*                 HealthSetComponent;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWESurvivalSetComponent*               SurvivalSetComponent;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEPhysicalSetComponent*               PhysicalSetComponent;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEBehaviorSetComponent*               BehaviorSetComponent;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUWEAIDecisionTargetInfo               DecisionTargetInfo;                                // 0x0398(0x0088)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	int32                                         SelectedChildIdx;                                  // 0x0420(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FUWEAIIndexedUtilityValue>      CachedSortedChildren;                              // 0x0428(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSmartObjectRequestResult>      SmartObjects;                                      // 0x0438(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_448[0x1C];                                     // 0x0448(0x001C)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class AActor>                  CurrentAttackTarget;                               // 0x0464(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<int32>                                 ReservedAttackTickets;                             // 0x0470(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void SetDecisionTarget(const struct FUWEAIDecisionTargetInfo& InTarget);
	void SetParentActor(class AActor* Parent);

	class AActor* GetDecisionTarget() const;
	struct FUWEAIDecisionTargetInfo GetDecisionTargetInfo() const;
	class AActor* GetLeader() const;
	class UUWEAIDecisionComponent* GetLeaderAIDecision() const;
	bool HasLeader() const;
	bool IsLeader() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIDecisionComponent">();
	}
	static class UUWEAIDecisionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIDecisionComponent>();
	}
};

// Class UWEAI.UWEAIDeveloperSettings
// 0x0088 (0x00C0 - 0x0038)
class UUWEAIDeveloperSettings final : public UDeveloperSettings
{
public:
	TSoftClassPtr<class UClass>                   MaxSwimSpeedGameplayEffect_SetByCaller;            // 0x0038(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UUWEAIMovementComponentGlobalSettings> AIMovementComponentGlobalSettings;   // 0x0060(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DefaultMovementStyle;                              // 0x0088(0x0008)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NeutralTag;                                        // 0x0090(0x0008)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              Profiles;                                          // 0x0098(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIDeveloperSettings">();
	}
	static class UUWEAIDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIDeveloperSettings>();
	}
};

// Class UWEAI.UWEAIDirectorPlayerStateComponent
// 0x0010 (0x00D0 - 0x00C0)
class UUWEAIDirectorPlayerStateComponent final : public UActorComponent
{
public:
	bool                                          IsPlayerDetected;                                  // 0x00C0(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         HighestAwareness;                                  // 0x00C4(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  HighestAwarenessActor;                             // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIDirectorPlayerStateComponent">();
	}
	static class UUWEAIDirectorPlayerStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIDirectorPlayerStateComponent>();
	}
};

// Class UWEAI.UWEAIDirectorSubsystem
// 0x00D8 (0x0118 - 0x0040)
class UUWEAIDirectorSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FUWEViewerInfo>                 Viewers;                                           // 0x0048(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<uint32, struct FUWEViewerHandle>         ViewerMap;                                         // 0x0058(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<TWeakObjectPtr<class AActor>, struct FUWEAIAttackTicketPool> AttackTicketPools;             // 0x00C8(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	void OnPlayerControllerEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIDirectorSubsystem">();
	}
	static class UUWEAIDirectorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIDirectorSubsystem>();
	}
};

// Class UWEAI.UWEAIGroupingComponent
// 0x0038 (0x00F8 - 0x00C0)
class UUWEAIGroupingComponent final : public UActorComponent
{
public:
	class AUWEAIPawn*                             AIOwner;                                           // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FUWEAIGroupMember>              GroupEntities;                                     // 0x00C8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  Leader;                                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x18];                                      // 0x00E0(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	TArray<struct FUWEAIGroupMember> GetGroup();
	void SetLeader(class AActor* InLeader);
	void TryDestroyGroup();
	void TryRearrangeGroup();

	class AActor* GetLeader() const;
	class AUWEAIController* GetLeaderAIController() const;
	bool IsLeader() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIGroupingComponent">();
	}
	static class UUWEAIGroupingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIGroupingComponent>();
	}
};

// Class UWEAI.UWEAIPawn
// 0x0190 (0x04C0 - 0x0330)
class AUWEAIPawn : public APawn
{
public:
	uint8                                         Pad_330[0x30];                                     // 0x0330(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEPawnAttachmentOwner*                AttachedToOwner;                                   // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_368[0x1];                                      // 0x0368(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          IsObstacleSensed;                                  // 0x0369(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_36A[0x76];                                     // 0x036A(0x0076)(Fixing Size After Last Property [ Dumper-8 ])
	class USceneComponent*                        RootCollisionComponent;                            // 0x03E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEAbilitySystemComponent*             UWEAbilitySystemComponent;                         // 0x03E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEAIArchetypeComponent*               ArchetypeComponent;                                // 0x03F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEHealthSetComponent*                 HealthComponent;                                   // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWESurvivalSetComponent*               SurvivalComponent;                                 // 0x0400(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEMovementSetComponent*               MovementSetComponent;                              // 0x0408(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEPhysicalSetComponent*               PhysicalComponent;                                 // 0x0410(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEBehaviorSetComponent*               BehaviorSetComponent;                              // 0x0418(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEAIMovementComponent*                MovementComponent;                                 // 0x0420(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMercuna3DNavigationComponent*          Mercuna3DNavigation;                               // 0x0428(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMercunaSurfaceNavigationComponent*     MercunaSurfaceNavigation;                          // 0x0430(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWENetworkSmoothingComponent*          NetworkSmoothingComponent;                         // 0x0438(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVolumeTrackerComponent*                VolumeTrackerComponent;                            // 0x0440(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableSweepTestForNetworkSmoothing;                // 0x0448(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAIPerceptionStimuliSourceComponent*    AIPerceptionStimuliSourceComponent;                // 0x0450(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWECollisionImpactComponent*           CollisionImpactComponent;                          // 0x0458(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEAIGroupingComponent*                GroupingComponent;                                 // 0x0460(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEAIReplicationComponent*             ReplicationComponent;                              // 0x0468(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWEAIPawnOverlapMode                         OverlapMode_Authority;                             // 0x0470(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUWEAIPawnOverlapMode                         OverlapMode_Client;                                // 0x0471(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_472[0x6];                                      // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UMeshComponent*                         MeshComponent;                                     // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_480[0x8];                                      // 0x0480(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEPawnAttachmentOwner*                PawnAttachmentOwner;                               // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_490[0x18];                                     // 0x0490(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstanceDynamic*               DynamicMaterialInstance;                           // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4B0[0x10];                                     // 0x04B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void EnableActorCollision(bool Enable);
	void EnableMeshCollision(bool Enable);
	void EnableRootComponentCollision(bool Enable);
	void OnActorAttachStarted(class AActor* Actor, const class FName& SlotName);
	void OnActorDetachFinished(class AActor* Actor, const class FName& SlotName);
	void OnDied(class AActor* SourceActor, class AActor* TargetActor);
	void OnInfectionChanged(float Infection);
	void OnRangeTrackerPostUpdate();
	void OnRep_IsObstacleSensed();
	void SetDefaultEnvironmentType();
	void SetDefaultMovementStyle();
	void SetEnvironmentType(const struct FGameplayTag& EnvironmentType);
	void SetMovementStyle(const struct FGameplayTag& InMovementStyle);
	void UpdateMaxSpeed();

	class UUWEAIArchetypeComponent* GetAIArchetypeComponent() const;
	class UUWEAIGroupingComponent* GetAIGroupingComponent() const;
	class UUWEAIReplicationComponent* GetAIReplicationComponent() const;
	class UUWEAbilitySystemComponent* GetASC() const;
	struct FGameplayTag GetCurrentMovementStyle() const;
	class AActor* GetDecisionTarget() const;
	bool HasMovementStyle(const struct FGameplayTag& InMovementStyle) const;
	bool IsActorCollisionEnabled() const;
	bool IsMeshCollisionEnabled() const;
	bool IsRootComponentCollisionEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIPawn">();
	}
	static class AUWEAIPawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEAIPawn>();
	}
};

// Class UWEAI.UWEAILargeFish
// 0x0000 (0x04C0 - 0x04C0)
class AUWEAILargeFish : public AUWEAIPawn
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAILargeFish">();
	}
	static class AUWEAILargeFish* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEAILargeFish>();
	}
};

// Class UWEAI.UWEAILocomotionComponent
// 0x00D0 (0x0190 - 0x00C0)
class UUWEAILocomotionComponent final : public UActorComponent
{
public:
	class AUWEAIController*                       AIOwner;                                           // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                StartLocation;                                     // 0x00C8(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               StartRotation;                                     // 0x00E0(0x0018)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CurrentHabitationAreaTag;                          // 0x00F8(0x0008)(Edit, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FUWEHabitationArea> HabitationAreas;                            // 0x0100(0x0050)(Edit, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	class UUWEAIMovementComponentGlobalSettings*  GlobalSettings;                                    // 0x0150(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x20];                                     // 0x0158(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	EVolumeType                                   CurrentVolumeType;                                 // 0x0178(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           CurrentEnvironmentType;                            // 0x017C(0x0008)(Edit, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class USplineComponent>        PatrolSplineComponent;                             // 0x0184(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	struct FVector GetClosestCenterOfCurrentHabitationArea(const struct FVector& Location);
	struct FVector GetClosestCenterOfHabitationArea(const struct FGameplayTag& HabitationAreaTag, const struct FVector& Location);
	struct FVector GetClosestPointToCurrentHabitationArea(const struct FVector& Location);
	struct FVector GetClosestPointToHabitationArea(const struct FGameplayTag& HabitationAreaTag, const struct FVector& Location);
	class USplineComponent* GetPatrolSplineComponent();
	bool IsInsideCurrentHabitationArea();
	bool IsInsideHabitationArea(const struct FGameplayTag& HabitationAreaTag);
	void OnCurrentVolumeChanged();
	void Restart();
	void Shutdown(const class FString& Reason);
	bool SwitchHabitationArea(const struct FGameplayTag& HabitationAreaTag);

	struct FUWEHabitationArea GetCurrentHabitationArea() const;
	struct FGameplayTag GetCurrentHabitationAreaTag() const;
	struct FVector GetStartLocation() const;
	struct FRotator GetStartRotation() const;
	bool HasHabitationArea(const struct FGameplayTag& HabitationAreaTag) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAILocomotionComponent">();
	}
	static class UUWEAILocomotionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAILocomotionComponent>();
	}
};

// Class UWEAI.UWEAIPerceptionComponent
// 0x0060 (0x0210 - 0x01B0)
class UUWEAIPerceptionComponent final : public UAIPerceptionComponent
{
public:
	class UUWEAIArchetypeDataAsset*               ArchetypeData;                                     // 0x01B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class AActor*, struct FUWEAIAwareness>   AwarenessMap;                                      // 0x01B8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	class AUWEAIController*                       UWEAIOwner;                                        // 0x0208(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	struct FVector GetLastSensedLocation(class AActor* PerceivedActor);
	float GetLoseSightRadius();
	float GetSightRadius();
	bool IsCurrentlyPerceived(class AActor* PerceivedActor);
	bool IsDetected(class AActor* PerceivedActor);
	bool IsPlayer(class AActor* PerceivedActor);
	void OnTargetEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);
	void OnTargetPerceptionForgot(class AActor* Actor);
	void OnTargetPerceptionUpdate(class AActor* Actor, const struct FAIStimulus& Stimulus);
	void Reload();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIPerceptionComponent">();
	}
	static class UUWEAIPerceptionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIPerceptionComponent>();
	}
};

// Class UWEAI.UWEAIRamData
// 0x0018 (0x0060 - 0x0048)
class UUWEAIRamData final : public UUWEActorDataAsset
{
public:
	struct FGameplayTag                           TargetCueTag;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FResourceContent>               Content;                                           // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIRamData">();
	}
	static class UUWEAIRamData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIRamData>();
	}
};

// Class UWEAI.UWEAIReplicationComponent
// 0x0008 (0x00C8 - 0x00C0)
class UUWEAIReplicationComponent final : public UActorComponent
{
public:
	class AActor*                                 TargetActor;                                       // 0x00C0(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class AActor* GetTargetActor();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAIReplicationComponent">();
	}
	static class UUWEAIReplicationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAIReplicationComponent>();
	}
};

// Class UWEAI.UWEAISmallFish
// 0x0010 (0x04D0 - 0x04C0)
class AUWEAISmallFish : public AUWEAIPawn
{
public:
	uint8                                         Pad_4C0[0x8];                                      // 0x04C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	uint8                                         bHasBeenPickedUp : 1;                              // 0x04C8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAISmallFish">();
	}
	static class AUWEAISmallFish* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEAISmallFish>();
	}
};

// Class UWEAI.UWEBTCUtilitySelector
// 0x0008 (0x0088 - 0x0080)
class UUWEBTCUtilitySelector final : public UBTCompositeNode
{
public:
	EUWEAIUtilityRankGatheringType                RankGatheringType;                                 // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWEAIUtilityWeightSelectionType              WeightSelectionType;                               // 0x0081(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEBTCUtilitySelector">();
	}
	static class UUWEBTCUtilitySelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEBTCUtilitySelector>();
	}
};

// Class UWEAI.UWEBTDActorConditionBase
// 0x0018 (0x0080 - 0x0068)
class UUWEBTDActorConditionBase : public UBTDecorator
{
public:
	struct FFloatRange                            DistanceRange;                                     // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
