#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEAbilitySystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UWEAbilitySystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UWEInterfaces_structs.hpp"


namespace SDK::Params
{

// Function UWEAbilitySystem.UUWEAbilityTask_PlayMontageAndWaitWithNotify.PlayMontageAndWaitWithNotify
// 0x0048 (0x0048 - 0x0000)
struct UUWEAbilityTask_PlayMontageAndWaitWithNotify_PlayMontageAndWaitWithNotify final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskInstanceName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           InMontageToPlay;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InRate;                                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InStartSection;                                    // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InNotifyName;                                      // 0x0024(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInStopWhenAbilityEnds;                            // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         InAnimRootMotionTranslationScale;                  // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InStartTimeSeconds;                                // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAllowInterruptAfterBlendOut;                    // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUUWEAbilityTask_PlayMontageAndWaitWithNotify* ReturnValue;                                // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UUWEAbilityTask_PlayMontageAndWaitWithNotify.OnNotifyBeginReceived
// 0x0028 (0x0028 - 0x0000)
struct UUWEAbilityTask_PlayMontageAndWaitWithNotify_OnNotifyBeginReceived final
{
public:
	class FName                                   InNotifyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBranchingPointNotifyPayload           BranchingPointPayload;                             // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWESurvivalAttributeSet.OnRep_DehydrationRateScalar
// 0x0010 (0x0010 - 0x0000)
struct UWESurvivalAttributeSet_OnRep_DehydrationRateScalar final
{
public:
	struct FUWEGameplayAttributeData              OldValue;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWESurvivalAttributeSet.OnRep_Food
// 0x0010 (0x0010 - 0x0000)
struct UWESurvivalAttributeSet_OnRep_Food final
{
public:
	struct FUWEGameplayAttributeData              OldValue;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWESurvivalAttributeSet.OnRep_HydrationRateScalar
// 0x0010 (0x0010 - 0x0000)
struct UWESurvivalAttributeSet_OnRep_HydrationRateScalar final
{
public:
	struct FUWEGameplayAttributeData              OldValue;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWESurvivalAttributeSet.OnRep_MaxFood
// 0x0010 (0x0010 - 0x0000)
struct UWESurvivalAttributeSet_OnRep_MaxFood final
{
public:
	struct FUWEGameplayAttributeData              OldValue;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWESurvivalAttributeSet.OnRep_MaxOxygen
// 0x0010 (0x0010 - 0x0000)
struct UWESurvivalAttributeSet_OnRep_MaxOxygen final
{
public:
	struct FUWEGameplayAttributeData              OldValue;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWESurvivalAttributeSet.OnRep_MaxWater
// 0x0010 (0x0010 - 0x0000)
struct UWESurvivalAttributeSet_OnRep_MaxWater final
{
public:
	struct FUWEGameplayAttributeData              OldValue;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWESurvivalAttributeSet.OnRep_NominalDepthMeters
// 0x0010 (0x0010 - 0x0000)
struct UWESurvivalAttributeSet_OnRep_NominalDepthMeters final
{
public:
	struct FUWEGameplayAttributeData              OldValue;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWESurvivalAttributeSet.OnRep_Oxygen
// 0x0010 (0x0010 - 0x0000)
struct UWESurvivalAttributeSet_OnRep_Oxygen final
{
public:
	struct FUWEGameplayAttributeData              OldValue;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWESurvivalAttributeSet.OnRep_StarvationRateScalar
// 0x0010 (0x0010 - 0x0000)
struct UWESurvivalAttributeSet_OnRep_StarvationRateScalar final
{
public:
	struct FUWEGameplayAttributeData              OldValue;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWESurvivalAttributeSet.OnRep_SuffocationRateScalar
// 0x0010 (0x0010 - 0x0000)
struct UWESurvivalAttributeSet_OnRep_SuffocationRateScalar final
{
public:
	struct FUWEGameplayAttributeData              OldValue;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWESurvivalAttributeSet.OnRep_Water
// 0x0010 (0x0010 - 0x0000)
struct UWESurvivalAttributeSet_OnRep_Water final
{
public:
	struct FUWEGameplayAttributeData              OldValue;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilityAsync_WaitGameplayTagCountChanged.WaitGameplayTagCountChangedForActor
// 0x0038 (0x0038 - 0x0000)
struct UWEAbilityAsync_WaitGameplayTagCountChanged_WaitGameplayTagCountChangedForActor final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Tags;                                              // 0x0008(0x0020)(Parm, NativeAccessSpecifierPublic)
	bool                                          OnlyTriggerOnce;                                   // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAbilityAsync_WaitGameplayTagCountChanged* ReturnValue;                                 // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.AttachEffect
// 0x0018 (0x0018 - 0x0000)
struct UWEGameplayAbility_AttachEffect final
{
public:
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Stacks;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAbilitySystem.UWEGameplayAbility.BP_ApplyPredictedGameplayEffectToTarget
// 0x0048 (0x0048 - 0x0000)
struct UWEGameplayAbility_BP_ApplyPredictedGameplayEffectToTarget final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GameplayEffectLevel;                               // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Stacks;                                            // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FActiveGameplayEffectHandle>    ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.ChangeActivationGroup
// 0x0002 (0x0002 - 0x0000)
struct UWEGameplayAbility_ChangeActivationGroup final
{
public:
	EUWEAbilityActivationGroup                    NewGroup;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.ForceRemoveGameplayCue
// 0x0008 (0x0008 - 0x0000)
struct UWEGameplayAbility_ForceRemoveGameplayCue final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.OnAbilityTargetDataReady
// 0x0028 (0x0028 - 0x0000)
struct UWEGameplayAbility_OnAbilityTargetDataReady final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.UpdateTargetData
// 0x0028 (0x0028 - 0x0000)
struct UWEGameplayAbility_UpdateTargetData final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetDataHandle;                                  // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.UWEAddGameplayCueWithParams
// 0x00E8 (0x00E8 - 0x0000)
struct UWEGameplayAbility_UWEAddGameplayCueWithParams final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 GameplayCueParameter;                              // 0x0008(0x00D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bRemoveOnAbilityEnd;                               // 0x00E0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAbilitySystem.UWEGameplayAbility.UWEAddGameplayCueWithParamsToTarget
// 0x00F0 (0x00F0 - 0x0000)
struct UWEGameplayAbility_UWEAddGameplayCueWithParamsToTarget final
{
public:
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 GameplayCueParameter;                              // 0x0010(0x00D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bRemoveOnAbilityEnd;                               // 0x00E8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAbilitySystem.UWEGameplayAbility.UWEApplyGameplayEffectToOwner
// 0x0028 (0x0028 - 0x0000)
struct UWEGameplayAbility_UWEApplyGameplayEffectToOwner final
{
public:
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 EffectCauser;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GameplayEffectLevel;                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Stacks;                                            // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveOnAbilityEnd;                               // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x001C(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAbilitySystem.UWEGameplayAbility.UWEApplyGameplayEffectToTarget
// 0x0030 (0x0030 - 0x0000)
struct UWEGameplayAbility_UWEApplyGameplayEffectToTarget final
{
public:
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 EffectCauser;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GameplayEffectLevel;                               // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Stacks;                                            // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveOnAbilityEnd;                               // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0024(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAbilitySystem.UWEGameplayAbility.UWECommitCost
// 0x0002 (0x0002 - 0x0000)
struct UWEGameplayAbility_UWECommitCost final
{
public:
	bool                                          BroadcastCommitEvent;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.UWEExecuteGameplayCueWithParams
// 0x00E0 (0x00E0 - 0x0000)
struct UWEGameplayAbility_UWEExecuteGameplayCueWithParams final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 GameplayCueParameters;                             // 0x0008(0x00D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.UWEExecuteGameplayCueWithParamsOnTarget
// 0x00E8 (0x00E8 - 0x0000)
struct UWEGameplayAbility_UWEExecuteGameplayCueWithParamsOnTarget final
{
public:
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 GameplayCueParameters;                             // 0x0010(0x00D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.UWERemoveGameplayCue
// 0x0008 (0x0008 - 0x0000)
struct UWEGameplayAbility_UWERemoveGameplayCue final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.UWERemoveGameplayCueFromTarget
// 0x0010 (0x0010 - 0x0000)
struct UWEGameplayAbility_UWERemoveGameplayCueFromTarget final
{
public:
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.CanChangeActivationGroup
// 0x0002 (0x0002 - 0x0000)
struct UWEGameplayAbility_CanChangeActivationGroup final
{
public:
	EUWEAbilityActivationGroup                    NewGroup;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.GetActivateAbilityInfo
// 0x0068 (0x0068 - 0x0000)
struct UWEGameplayAbility_GetActivateAbilityInfo final
{
public:
	struct FAbilityInfoData                       ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.GetActivateOnSpawn
// 0x0001 (0x0001 - 0x0000)
struct UWEGameplayAbility_GetActivateOnSpawn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.GetAnimationEventData
// 0x0008 (0x0008 - 0x0000)
struct UWEGameplayAbility_GetAnimationEventData final
{
public:
	struct FUWEAnimationEventParams               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.GetAttributeValue
// 0x0040 (0x0040 - 0x0000)
struct UWEGameplayAbility_GetAttributeValue final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFound;                                            // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ReturnValue;                                       // 0x003C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.GetCosmeticTagsFromActorInfo
// 0x0020 (0x0020 - 0x0000)
struct UWEGameplayAbility_GetCosmeticTagsFromActorInfo final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.GetGameplayEventData
// 0x0050 (0x0050 - 0x0000)
struct UWEGameplayAbility_GetGameplayEventData final
{
public:
	struct FUWEGameplayEventParams                ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.GetHoverActorFromActorInfo
// 0x0008 (0x0008 - 0x0000)
struct UWEGameplayAbility_GetHoverActorFromActorInfo final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.GetHoverComponentFromActorInfo
// 0x0008 (0x0008 - 0x0000)
struct UWEGameplayAbility_GetHoverComponentFromActorInfo final
{
public:
	class UPrimitiveComponent*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.GetHoverInfoFromActorInfo
// 0x0138 (0x0138 - 0x0000)
struct UWEGameplayAbility_GetHoverInfoFromActorInfo final
{
public:
	struct FUWETargetActor                        ReturnValue;                                       // 0x0000(0x0138)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.GetUWEAbilitySystemComponentFromActorInfo
// 0x0008 (0x0008 - 0x0000)
struct UWEGameplayAbility_GetUWEAbilitySystemComponentFromActorInfo final
{
public:
	class UUWEAbilitySystemComponent*             ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.HasActiveTasks
// 0x0018 (0x0018 - 0x0000)
struct UWEGameplayAbility_HasActiveTasks final
{
public:
	class UGameplayTask*                          IgnoreTask;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FilterName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAbilitySystem.UWEGameplayAbility.IsInputPressed
// 0x0001 (0x0001 - 0x0000)
struct UWEGameplayAbility_IsInputPressed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.UWECheckCost
// 0x0058 (0x0058 - 0x0000)
struct UWEGameplayAbility_UWECheckCost final
{
public:
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0008(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAbilitySystem.UWEGameplayAbility.UWEMakeOutgoingGameplayEffectSpec
// 0x0028 (0x0028 - 0x0000)
struct UWEGameplayAbility_UWEMakeOutgoingGameplayEffectSpec final
{
public:
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 EffectCauser;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Stacks;                                            // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectSpecHandle              ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEGameplayAbility.UWEMakeOutgoingGameplayEffectSpecForDamage
// 0x0130 (0x0130 - 0x0000)
struct UWEGameplayAbility_UWEMakeOutgoingGameplayEffectSpecForDamage final
{
public:
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 EffectCauser;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DamageType;                                        // 0x0014(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FHitResult                             HitResult;                                         // 0x0020(0x0100)(Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayEffectSpecHandle              ReturnValue;                                       // 0x0120(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEPhysicalSetComponent.GetBulk
// 0x0004 (0x0004 - 0x0000)
struct UWEPhysicalSetComponent_GetBulk final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.AddDynamicTagGameplayEffect
// 0x0010 (0x0010 - 0x0000)
struct UWEAbilitySystemComponent_AddDynamicTagGameplayEffect final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.AddGameplayCueLocal
// 0x00E0 (0x00E0 - 0x0000)
struct UWEAbilitySystemComponent_AddGameplayCueLocal final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 GameplayCueParameters;                             // 0x0008(0x00D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.AddReplicatedGameplayTagForDuration
// 0x0018 (0x0018 - 0x0000)
struct UWEAbilitySystemComponent_AddReplicatedGameplayTagForDuration final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPredict;                                          // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.AddUniqueDynamicTagGameplayEffect
// 0x0008 (0x0008 - 0x0000)
struct UWEAbilitySystemComponent_AddUniqueDynamicTagGameplayEffect final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.BP_AddLooseGameplayTag
// 0x000C (0x000C - 0x0000)
struct UWEAbilitySystemComponent_BP_AddLooseGameplayTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.BP_ApplyUniqueGameplayEffectToSelf
// 0x0038 (0x0038 - 0x0000)
struct UWEAbilitySystemComponent_BP_ApplyUniqueGameplayEffectToSelf final
{
public:
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0010(0x0018)(Parm, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x002C(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.BP_RemoveLooseGameplayTag
// 0x000C (0x000C - 0x0000)
struct UWEAbilitySystemComponent_BP_RemoveLooseGameplayTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.BP_SetLooseGameplayTagCount
// 0x000C (0x000C - 0x0000)
struct UWEAbilitySystemComponent_BP_SetLooseGameplayTagCount final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.ExecuteGameplayCueLocal
// 0x00E0 (0x00E0 - 0x0000)
struct UWEAbilitySystemComponent_ExecuteGameplayCueLocal final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 GameplayCueParameters;                             // 0x0008(0x00D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.GetSimulatedTask
// 0x0010 (0x0010 - 0x0000)
struct UWEAbilitySystemComponent_GetSimulatedTask final
{
public:
	TSubclassOf<class UGameplayTask>              TaskClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayTask*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.GetTargetActor
// 0x0008 (0x0008 - 0x0000)
struct UWEAbilitySystemComponent_GetTargetActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.OnRep_AbilityTags
// 0x0020 (0x0020 - 0x0000)
struct UWEAbilitySystemComponent_OnRep_AbilityTags final
{
public:
	struct FGameplayTagContainer                  OldTags;                                           // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.RemoveDynamicTagGameplayEffect
// 0x0008 (0x0008 - 0x0000)
struct UWEAbilitySystemComponent_RemoveDynamicTagGameplayEffect final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.RemoveGameplayCueLocal
// 0x00E0 (0x00E0 - 0x0000)
struct UWEAbilitySystemComponent_RemoveGameplayCueLocal final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 GameplayCueParameters;                             // 0x0008(0x00D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.SetGameplayEffectDurationHandle
// 0x0010 (0x0010 - 0x0000)
struct UWEAbilitySystemComponent_SetGameplayEffectDurationHandle final
{
public:
	struct FActiveGameplayEffectHandle            Handle;                                            // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewDuration;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.SetPersistentGameplayTag
// 0x000C (0x000C - 0x0000)
struct UWEAbilitySystemComponent_SetPersistentGameplayTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActive;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.TagResponseEvent
// 0x0010 (0x0010 - 0x0000)
struct UWEAbilitySystemComponent_TagResponseEvent final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         idx;                                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.UWEApplyAOEDamage
// 0x0068 (0x0068 - 0x0000)
struct UWEAbilitySystemComponent_UWEApplyAOEDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DamageType;                                        // 0x0004(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Location;                                          // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0028(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   ObstacleCheckProfileName;                          // 0x0038(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeSelf;                                      // 0x0044(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoLOSCheck;                                       // 0x0045(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  ContextTags;                                       // 0x0048(0x0020)(Parm, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.UWEApplyDamage
// 0x0140 (0x0140 - 0x0000)
struct UWEAbilitySystemComponent_UWEApplyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DamageType;                                        // 0x0004(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 DamageReceiver;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             HitResult;                                         // 0x0018(0x0100)(Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ContextTags;                                       // 0x0118(0x0020)(Parm, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0138(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.UWEApplyDamageOverTime
// 0x0148 (0x0148 - 0x0000)
struct UWEAbilitySystemComponent_UWEApplyDamageOverTime final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Period;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DamageType;                                        // 0x000C(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 DamageReceiver;                                    // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             HitResult;                                         // 0x0020(0x0100)(Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ContextTags;                                       // 0x0120(0x0020)(Parm, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0140(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemComponent.AllAbilitySetAbilitiesGranted
// 0x0001 (0x0001 - 0x0000)
struct UWEAbilitySystemComponent_AllAbilitySetAbilitiesGranted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemGlobals.ExecuteGameplayCueUnpredicted
// 0x00E8 (0x00E8 - 0x0000)
struct UWEAbilitySystemGlobals_ExecuteGameplayCueUnpredicted final
{
public:
	class UAbilitySystemComponent*                ASC;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CueTag;                                            // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemGlobals.GetAnyAbilitySystemComponentFromActor
// 0x0018 (0x0018 - 0x0000)
struct UWEAbilitySystemGlobals_GetAnyAbilitySystemComponentFromActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LookForComponent;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAbilitySystemComponent*                ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemGlobals.GetUWEAbilitySystemComponentFromActor
// 0x0018 (0x0018 - 0x0000)
struct UWEAbilitySystemGlobals_GetUWEAbilitySystemComponentFromActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LookForComponent;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAbilitySystemComponent*             ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemGlobals.TryEndTask
// 0x0008 (0x0008 - 0x0000)
struct UWEAbilitySystemGlobals_TryEndTask final
{
public:
	class UGameplayTask*                          Task;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilitySystemTagChangeAnalytics.UpdateTagChanged
// 0x000C (0x000C - 0x0000)
struct UWEAbilitySystemTagChangeAnalytics_UpdateTagChanged final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TagCount;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilityTask_OnPossessedChanged.WaitPossessedChanged
// 0x0018 (0x0018 - 0x0000)
struct UWEAbilityTask_OnPossessedChanged_WaitPossessedChanged final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskInstanceName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEAbilityTask_OnPossessedChanged*     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilityTask_PlayCharacterAnimationAndWait.PlayCharacterAnimationAndWait
// 0x0028 (0x0028 - 0x0000)
struct UWEAbilityTask_PlayCharacterAnimationAndWait_PlayCharacterAnimationAndWait final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskInstanceName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           AnimationTag_0;                                    // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDuration;                                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAbilityTask_PlayCharacterAnimationAndWait* ReturnValue;                                // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilityTask_WaitAnimationNotify.WaitAnimationNotify
// 0x0028 (0x0028 - 0x0000)
struct UWEAbilityTask_WaitAnimationNotify_WaitAnimationNotify final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskInstanceName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NotifyName;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnce;                                             // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAbilityTask_WaitAnimationNotify*    ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilityTask_WaitAnimationNotify.OnAbilityAnimNotify
// 0x0008 (0x0008 - 0x0000)
struct UWEAbilityTask_WaitAnimationNotify_OnAbilityAnimNotify final
{
public:
	class FName                                   InNotifyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilityTask_WaitAnimationNotify.OnNotifyBeginReceived
// 0x0028 (0x0028 - 0x0000)
struct UWEAbilityTask_WaitAnimationNotify_OnNotifyBeginReceived final
{
public:
	class FName                                   InNotifyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBranchingPointNotifyPayload           BranchingPointPayload;                             // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEAbilitySystem.UWEAbilityTask_WaitInputActionValue.WaitInputActionValue
// 0x0020 (0x0020 - 0x0000)
struct UWEAbilityTask_WaitInputActionValue_WaitInputActionValue final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
