#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEAssetRegistry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UWEAssetRegistry.UWEPrimaryDataAssetBase.IsPublished
// 0x0001 (0x0001 - 0x0000)
struct UWEPrimaryDataAssetBase_IsPublished final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEAssetRegistryStatics.GetActorDataAssetForActor
// 0x0018 (0x0018 - 0x0000)
struct UWEAssetRegistryStatics_GetActorDataAssetForActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUWEActorDataAsset>         AssetDataClass;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UUWEActorDataAsset*               ReturnValue;                                       // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEAssetRegistryStatics.GetActorDataAssetForActorSoftClass
// 0x0038 (0x0038 - 0x0000)
struct UWEAssetRegistryStatics_GetActorDataAssetForActorSoftClass final
{
public:
	TSoftClassPtr<class UClass>                   ActorSoftClass;                                    // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUWEActorDataAsset>         AssetDataClass;                                    // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UUWEActorDataAsset*               ReturnValue;                                       // 0x0030(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEAssetRegistryStatics.GetAllAssetUserDataAssetsForActor
// 0x0018 (0x0018 - 0x0000)
struct UWEAssetRegistryStatics_GetAllAssetUserDataAssetsForActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUWEPrimaryDataAssetBase*>       OutAssets;                                         // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEAssetRegistryStatics.GetAllAssetUserDataForActor
// 0x0018 (0x0018 - 0x0000)
struct UWEAssetRegistryStatics_GetAllAssetUserDataForActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                 ReturnValue;                                       // 0x0008(0x0010)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEAssetRegistryStatics.GetAllAssetUserDataFromMesh
// 0x0018 (0x0018 - 0x0000)
struct UWEAssetRegistryStatics_GetAllAssetUserDataFromMesh final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                 ReturnValue;                                       // 0x0008(0x0010)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEAssetRegistryStatics.GetAllDataAssetsOfClass
// 0x0018 (0x0018 - 0x0000)
struct UWEAssetRegistryStatics_GetAllDataAssetsOfClass final
{
public:
	TSubclassOf<class UDataAsset>                 AssetClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEAssetRegistryStatics.GetAssetUserDataForActorByClass
// 0x0018 (0x0018 - 0x0000)
struct UWEAssetRegistryStatics_GetAssetUserDataForActorByClass final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAssetUserData>             Class_0;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAssetUserData*                   ReturnValue;                                       // 0x0010(0x0008)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEAssetRegistryStatics.GetAssetUserDataFromMeshByClass
// 0x0018 (0x0018 - 0x0000)
struct UWEAssetRegistryStatics_GetAssetUserDataFromMeshByClass final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAssetUserData>             Class_0;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAssetUserData*                   ReturnValue;                                       // 0x0010(0x0008)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEAssetRegistryStatics.NotEqual_DataAsset
// 0x0020 (0x0020 - 0x0000)
struct UWEAssetRegistryStatics_NotEqual_DataAsset final
{
public:
	class UUWEPrimaryDataAssetBase*               A;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 B;                                                 // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAssetRegistry.UWEDataAssetInfoInterface.GetDataAssetDescription
// 0x0010 (0x0010 - 0x0000)
struct UWEDataAssetInfoInterface_GetDataAssetDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEDataAssetInfoInterface.GetDataAssetName
// 0x0010 (0x0010 - 0x0000)
struct UWEDataAssetInfoInterface_GetDataAssetName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEDataAssetInfoInterface.GetDataAssetSecondaryDescription
// 0x0010 (0x0010 - 0x0000)
struct UWEDataAssetInfoInterface_GetDataAssetSecondaryDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEDataAssetInfoInterface.GetDataAssetThumbnail
// 0x0028 (0x0028 - 0x0000)
struct UWEDataAssetInfoInterface_GetDataAssetThumbnail final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEDataAssetOrderingInterface.GetDataAssetOrderingIndex
// 0x0004 (0x0004 - 0x0000)
struct UWEDataAssetOrderingInterface_GetDataAssetOrderingIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAssetRegistry.UWEDataAssetPartialProgressInterface.GetCurrentProgressCount
// 0x0010 (0x0010 - 0x0000)
struct UWEDataAssetPartialProgressInterface_GetCurrentProgressCount final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAssetRegistry.UWEDataAssetPartialProgressInterface.GetTotalProgressCount
// 0x0010 (0x0010 - 0x0000)
struct UWEDataAssetPartialProgressInterface_GetTotalProgressCount final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAssetRegistry.UWEDataAssetPartialProgressInterface.IsPartialScanProgressPinnable
// 0x0010 (0x0010 - 0x0000)
struct UWEDataAssetPartialProgressInterface_IsPartialScanProgressPinnable final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAssetRegistry.UWEDataAssetPartialProgressInterface.IsProgressCompleted
// 0x0010 (0x0010 - 0x0000)
struct UWEDataAssetPartialProgressInterface_IsProgressCompleted final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

