#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEAmbienceSound

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "UWEImGui_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "UWEGameplayCues_structs.hpp"


namespace SDK
{

// Class UWEAmbienceSound.UWEAmbienceSoundDiagnostic
// 0x0000 (0x00F0 - 0x00F0)
class UUWEAmbienceSoundDiagnostic final : public UUWEImGuiComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAmbienceSoundDiagnostic">();
	}
	static class UUWEAmbienceSoundDiagnostic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAmbienceSoundDiagnostic>();
	}
};

// Class UWEAmbienceSound.UWEAmbienceSoundSubsystem
// 0x0020 (0x0060 - 0x0040)
class UUWEAmbienceSoundSubsystem final : public UTickableWorldSubsystem
{
public:
	TArray<class UUWEConditionalAmbienceSound*>   SoundInstances;                                    // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           AmbienceSounds;                                    // 0x0050(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAmbienceSoundSubsystem">();
	}
	static class UUWEAmbienceSoundSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAmbienceSoundSubsystem>();
	}
};

// Class UWEAmbienceSound.UWEConditionalAmbienceSound
// 0x0070 (0x0098 - 0x0028)
class UUWEConditionalAmbienceSound : public UObject
{
public:
	class UFMODEvent*                             Event;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FUWEEffectParam>                Params_0;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x58];                                      // 0x0040(0x0058)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void BP_OnUpdate(class APawn* LocalPawn, float DeltaTime);
	void SetParameter(class FName Name_0, float Value);

	class FString GetEventName() const;
	bool ShouldPlay(class APawn* LocalPawn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEConditionalAmbienceSound">();
	}
	static class UUWEConditionalAmbienceSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEConditionalAmbienceSound>();
	}
};

}

