#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEAIMovement

#include "Basic.hpp"

#include "UWEAIMovement_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UWEAIMovement.UWEAIMovementBlueprintFunctionLibrary.ChooseDefaultEnvironment
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementBlueprintFunctionLibrary_ChooseDefaultEnvironment final
{
public:
	class UUWEAIMovementComponentGlobalSettings*  GlobalSettings;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEAIMovementBaseSettings*             BaseSettings;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementBlueprintFunctionLibrary.GetAIMovementDescription
// 0x0030 (0x0030 - 0x0000)
struct UWEAIMovementBlueprintFunctionLibrary_GetAIMovementDescription final
{
public:
	class UUWEAIMovementComponentGlobalSettings*  GlobalSettings;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEAIMovementBaseSettings*             BaseSettings;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEPrimaryDataAssetBase*               DataAsset;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisplayDetails;                                    // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementBlueprintFunctionLibrary.SetForceMultiplierByTerminalVelocity
// 0x0038 (0x0038 - 0x0000)
struct UWEAIMovementBlueprintFunctionLibrary_SetForceMultiplierByTerminalVelocity final
{
public:
	struct FUWEAIMovementCoreModuleSettingsPack   Settings;                                          // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         TerminalVelocity;                                  // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAIMovement.UWEAIMovementComponentSettings.GetAllSettings
// 0x0010 (0x0010 - 0x0000)
struct UWEAIMovementComponentSettings_GetAllSettings final
{
public:
	TArray<class UUWEPrimaryDataAssetBase*>       ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.AddExternalAcceleration
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_AddExternalAcceleration final
{
public:
	struct FVector                                Acceleration;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.AddExternalForce
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_AddExternalForce final
{
public:
	struct FVector                                Force;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.AddExternalImpulse
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_AddExternalImpulse final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.AddExternalVelocity
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_AddExternalVelocity final
{
public:
	struct FVector                                InVelocity;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.CanCrawl
// 0x0001 (0x0001 - 0x0000)
struct UWEAIMovementComponent_CanCrawl final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.CanSwim
// 0x0001 (0x0001 - 0x0000)
struct UWEAIMovementComponent_CanSwim final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.EditorOnly_Set2DMode
// 0x0001 (0x0001 - 0x0000)
struct UWEAIMovementComponent_EditorOnly_Set2DMode final
{
public:
	bool                                          In2DMode;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.EnforceSweepTestOnMove
// 0x0001 (0x0001 - 0x0000)
struct UWEAIMovementComponent_EnforceSweepTestOnMove final
{
public:
	bool                                          Enforce;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.ExternalDeltaMove
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_ExternalDeltaMove final
{
public:
	struct FVector                                DeltaMotion;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.FinishMoveToLocation
// 0x0020 (0x0020 - 0x0000)
struct UWEAIMovementComponent_FinishMoveToLocation final
{
public:
	struct FVector                                TargetLocation;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveToForceProportion;                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ApproachDistance;                                  // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAngularVelocityAsQuaternion
// 0x0020 (0x0020 - 0x0000)
struct UWEAIMovementComponent_GetAngularVelocityAsQuaternion final
{
public:
	struct FQuat                                  ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAnimationSteeringAcceleration
// 0x0020 (0x0020 - 0x0000)
struct UWEAIMovementComponent_GetAnimationSteeringAcceleration final
{
public:
	EUWEAIMovementVectorSpace                     VectorSpace;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWEAIMovementVectorRelativeMode              RelativeMode;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAnimationSteeringAccelerationInLocalSpace
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetAnimationSteeringAccelerationInLocalSpace final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAnimationVelocity
// 0x0020 (0x0020 - 0x0000)
struct UWEAIMovementComponent_GetAnimationVelocity final
{
public:
	EUWEAIMovementVectorSpace                     VectorSpace;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWEAIMovementVectorRelativeMode              RelativeMode;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAnimationVelocityInLocalSpace
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetAnimationVelocityInLocalSpace final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAnimationVelocityRelativeToCurrentMax
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetAnimationVelocityRelativeToCurrentMax final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAnimationVelocityRelativeToCurrentMaxInLocalSpace
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetAnimationVelocityRelativeToCurrentMaxInLocalSpace final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAnimationVelocityRelativeToOverallMax
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetAnimationVelocityRelativeToOverallMax final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAnimationVelocityRelativeToOverallMaxInLocalSpace
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetAnimationVelocityRelativeToOverallMaxInLocalSpace final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetEnvironmentType
// 0x0008 (0x0008 - 0x0000)
struct UWEAIMovementComponent_GetEnvironmentType final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetRelativeAngularVelocity
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetRelativeAngularVelocity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetRelativeVelocity
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetRelativeVelocity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetRelativeVelocityInLocalSpace
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetRelativeVelocityInLocalSpace final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetSmoothedRelativeAngularVelocity
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetSmoothedRelativeAngularVelocity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetSteeringAccelerationInLocalSpace
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetSteeringAccelerationInLocalSpace final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetTerminalVelocityMagnitude
// 0x0004 (0x0004 - 0x0000)
struct UWEAIMovementComponent_GetTerminalVelocityMagnitude final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetVelocityInLocalSpace
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetVelocityInLocalSpace final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.IsCrawlingActive
// 0x0001 (0x0001 - 0x0000)
struct UWEAIMovementComponent_IsCrawlingActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.IsSwimmingActive
// 0x0001 (0x0001 - 0x0000)
struct UWEAIMovementComponent_IsSwimmingActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.LookAtLocation
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_LookAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.MoveInDesiredSteeringDirection
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_MoveInDesiredSteeringDirection final
{
public:
	struct FVector                                SteeringDirection;                                 // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.MoveToLocation
// 0x0020 (0x0020 - 0x0000)
struct UWEAIMovementComponent_MoveToLocation final
{
public:
	struct FVector                                TargetLocation;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ApproachDistance;                                  // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAIMovement.UWEAIMovementComponent.SetBaseRotation
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_SetBaseRotation final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.SetDesiredLookDirection
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_SetDesiredLookDirection final
{
public:
	struct FVector                                InLookDirection;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.SetDesiredSteeringDirection
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_SetDesiredSteeringDirection final
{
public:
	struct FVector                                SteeringDirection;                                 // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.SetMoveToForceProportion
// 0x0004 (0x0004 - 0x0000)
struct UWEAIMovementComponent_SetMoveToForceProportion final
{
public:
	float                                         InForceProportion;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.StartMoveToLocation
// 0x0028 (0x0028 - 0x0000)
struct UWEAIMovementComponent_StartMoveToLocation final
{
public:
	struct FVector                                TargetLocation;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveToForceProportion;                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ApproachDistance;                                  // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWEAIMovementStoppingConfig           InStoppingConfig;                                  // 0x0020(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAnimationCurrentMaxSpeed
// 0x0004 (0x0004 - 0x0000)
struct UWEAIMovementComponent_GetAnimationCurrentMaxSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAnimationCurrentMaxSteeringAcceleration
// 0x0004 (0x0004 - 0x0000)
struct UWEAIMovementComponent_GetAnimationCurrentMaxSteeringAcceleration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAnimationOverallMaxSpeed
// 0x0004 (0x0004 - 0x0000)
struct UWEAIMovementComponent_GetAnimationOverallMaxSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetAnimationOverallMaxSteeringAcceleration
// 0x0004 (0x0004 - 0x0000)
struct UWEAIMovementComponent_GetAnimationOverallMaxSteeringAcceleration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetBaseRotation
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementComponent_GetBaseRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.GetTerminalVelocityMagnitudeWithForceProportion
// 0x0008 (0x0008 - 0x0000)
struct UWEAIMovementComponent_GetTerminalVelocityMagnitudeWithForceProportion final
{
public:
	float                                         InForceProportion;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementComponent.IsMovementValid
// 0x0001 (0x0001 - 0x0000)
struct UWEAIMovementComponent_IsMovementValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementCoreModule.AddAcceleration
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementCoreModule_AddAcceleration final
{
public:
	struct FVector                                Acceleration;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementCoreModule.AddForce
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementCoreModule_AddForce final
{
public:
	struct FVector                                Force;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementCoreModule.AddImpulse
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementCoreModule_AddImpulse final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementCoreModule.AddVelocity
// 0x0018 (0x0018 - 0x0000)
struct UWEAIMovementCoreModule_AddVelocity final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementCoreModule.SetDragProportion
// 0x0004 (0x0004 - 0x0000)
struct UWEAIMovementCoreModule_SetDragProportion final
{
public:
	float                                         InDragProportion;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEAIMovement.UWEAIMovementCoreModule.SetForceProportion
// 0x0004 (0x0004 - 0x0000)
struct UWEAIMovementCoreModule_SetForceProportion final
{
public:
	float                                         InForceProportion;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

