#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEAssetRegistry

#include "Basic.hpp"

#include "UWEAssetRegistry_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class UWEAssetRegistry.UWEPrimaryDataAssetBase
// 0x0018 (0x0048 - 0x0030)
class UUWEPrimaryDataAssetBase : public UPrimaryDataAsset
{
public:
	EUWEPublishedStatus                           PublishedStatus;                                   // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 DeveloperNote;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool IsPublished() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPrimaryDataAssetBase">();
	}
	static class UUWEPrimaryDataAssetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPrimaryDataAssetBase>();
	}
};

// Class UWEAssetRegistry.UWEActorDataAsset
// 0x0000 (0x0048 - 0x0048)
class UUWEActorDataAsset : public UUWEPrimaryDataAssetBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEActorDataAsset">();
	}
	static class UUWEActorDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEActorDataAsset>();
	}
};

// Class UWEAssetRegistry.UWEAssetDataComponent
// 0x0000 (0x00C0 - 0x00C0)
class UUWEAssetDataComponent final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAssetDataComponent">();
	}
	static class UUWEAssetDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAssetDataComponent>();
	}
};

// Class UWEAssetRegistry.UWEAssetRegistryStatics
// 0x0000 (0x0028 - 0x0028)
class UUWEAssetRegistryStatics final : public UBlueprintFunctionLibrary
{
public:
	static const class UUWEActorDataAsset* GetActorDataAssetForActor(const class AActor* Actor, TSubclassOf<class UUWEActorDataAsset> AssetDataClass);
	static const class UUWEActorDataAsset* GetActorDataAssetForActorSoftClass(TSoftClassPtr<class UClass> ActorSoftClass, TSubclassOf<class UUWEActorDataAsset> AssetDataClass);
	static void GetAllAssetUserDataAssetsForActor(class AActor* Actor, TArray<class UUWEPrimaryDataAssetBase*>* OutAssets);
	static const TArray<class UAssetUserData*> GetAllAssetUserDataForActor(class AActor* Actor);
	static const TArray<class UAssetUserData*> GetAllAssetUserDataFromMesh(class UStaticMesh* Mesh);
	static TArray<struct FAssetData> GetAllDataAssetsOfClass(TSubclassOf<class UDataAsset> AssetClass);
	static const class UAssetUserData* GetAssetUserDataForActorByClass(class AActor* Actor, TSubclassOf<class UAssetUserData> Class_0);
	static const class UAssetUserData* GetAssetUserDataFromMeshByClass(class UStaticMesh* Mesh, TSubclassOf<class UAssetUserData> Class_0);
	static bool NotEqual_DataAsset(class UUWEPrimaryDataAssetBase* A, const class FString& B);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAssetRegistryStatics">();
	}
	static class UUWEAssetRegistryStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAssetRegistryStatics>();
	}
};

// Class UWEAssetRegistry.UWEAssetRegistrySubsystem
// 0x01E0 (0x0210 - 0x0030)
class UUWEAssetRegistrySubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x110];                                     // 0x0030(0x0110)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<class UClass*, struct FUWEPrimaryDataAssetBaseArray> CachedDataAssets;                      // 0x0140(0x0050)(NativeAccessSpecifierPrivate)
	TSet<TSubclassOf<class UObject>>              CachedAssetClasses;                                // 0x0190(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        CachedAssets;                                      // 0x01E0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UObject>>            CachedBlueprintClasses;                            // 0x01F0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_200[0x10];                                     // 0x0200(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAssetRegistrySubsystem">();
	}
	static class UUWEAssetRegistrySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAssetRegistrySubsystem>();
	}
};

// Class UWEAssetRegistry.UWEAssetUserData
// 0x0010 (0x0038 - 0x0028)
class UUWEAssetUserData final : public UAssetUserData
{
public:
	TArray<class UUWEActorDataAsset*>             DataAssets;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAssetUserData">();
	}
	static class UUWEAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAssetUserData>();
	}
};

// Class UWEAssetRegistry.UWEDataAssetInfoInterface
// 0x0000 (0x0000 - 0x0000)
class IUWEDataAssetInfoInterface final
{
public:
	class FText GetDataAssetDescription();
	class FText GetDataAssetName();
	class FText GetDataAssetSecondaryDescription();
	TSoftObjectPtr<class UTexture2D> GetDataAssetThumbnail();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDataAssetInfoInterface">();
	}
	static class IUWEDataAssetInfoInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUWEDataAssetInfoInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class UWEAssetRegistry.UWEDataAssetOrderingInterface
// 0x0000 (0x0000 - 0x0000)
class IUWEDataAssetOrderingInterface final
{
public:
	int32 GetDataAssetOrderingIndex();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDataAssetOrderingInterface">();
	}
	static class IUWEDataAssetOrderingInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUWEDataAssetOrderingInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class UWEAssetRegistry.UWEDataAssetPartialProgressInterface
// 0x0000 (0x0000 - 0x0000)
class IUWEDataAssetPartialProgressInterface final
{
public:
	int32 GetCurrentProgressCount(class APlayerState* PlayerState);
	int32 GetTotalProgressCount(class APlayerState* PlayerState);
	bool IsPartialScanProgressPinnable(class APlayerState* PlayerState);
	bool IsProgressCompleted(class APlayerState* PlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDataAssetPartialProgressInterface">();
	}
	static class IUWEDataAssetPartialProgressInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUWEDataAssetPartialProgressInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class UWEAssetRegistry.UWEDataAssetSettings
// 0x0028 (0x0050 - 0x0028)
class UUWEDataAssetSettings final : public UObject
{
public:
	TSoftObjectPtr<class UTexture2D>              DefaultThumbnail;                                  // 0x0028(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDataAssetSettings">();
	}
	static class UUWEDataAssetSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEDataAssetSettings>();
	}
};

}

