#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEActorUID

#include "Basic.hpp"

#include "UWEActorUID_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UWEActorUID.UWEActorUIDStatics.GetActorUID
// 0x0018 (0x0018 - 0x0000)
struct UWEActorUIDStatics_GetActorUID final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWEActorUID                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEActorUID.UWEActorUIDStatics.IsActorUIDValid
// 0x0014 (0x0014 - 0x0000)
struct UWEActorUIDStatics_IsActorUIDValid final
{
public:
	struct FUWEActorUID                           ActorUId;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEActorUID.UWEActorUIDStatics.TryGetActorFromUID
// 0x0020 (0x0020 - 0x0000)
struct UWEActorUIDStatics_TryGetActorFromUID final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWEActorUID                           ActorUId;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEActorUID.UWECustomActorUIDInterface.GetCustomActorUID
// 0x0010 (0x0010 - 0x0000)
struct UWECustomActorUIDInterface_GetCustomActorUID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

