#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEBiomods

#include "Basic.hpp"

#include "UWEUnlockables_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "UWECommonUI_structs.hpp"


namespace SDK::Params
{

// Function UWEBiomods.UWEBioAbilityData.GetAllBioAbilityData
// 0x0020 (0x0020 - 0x0000)
struct UWEBioAbilityData_GetAllBioAbilityData final
{
public:
	bool                                          bOnlyUnlocked;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUWEBioAbilityData*>             ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBioAbilityData.GetBioAbilitiesForActor
// 0x0018 (0x0018 - 0x0000)
struct UWEBioAbilityData_GetBioAbilitiesForActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UGameplayAbility*>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBioAbilityData.GetBioAbilityDataFromAbility
// 0x0010 (0x0010 - 0x0000)
struct UWEBioAbilityData_GetBioAbilityDataFromAbility final
{
public:
	TSubclassOf<class UGameplayAbility>           AbilityClass;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEBioAbilityData*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBioAbilityData.GetBioAbilityDataFromAbilityTag
// 0x0010 (0x0010 - 0x0000)
struct UWEBioAbilityData_GetBioAbilityDataFromAbilityTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEBioAbilityData*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBioAbilityData.GetMissingRequiredBioScans
// 0x0018 (0x0018 - 0x0000)
struct UWEBioAbilityData_GetMissingRequiredBioScans final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUWEBioScanData*>                ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBioAbilityData.GetUnlockedRequiredBioScans
// 0x0018 (0x0018 - 0x0000)
struct UWEBioAbilityData_GetUnlockedRequiredBioScans final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUWEBioScanData*>                ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBioAbilityData.GetUnlockState
// 0x0010 (0x0010 - 0x0000)
struct UWEBioAbilityData_GetUnlockState final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUnlockState                                  ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBioAbilityData.IsCrafted
// 0x0010 (0x0010 - 0x0000)
struct UWEBioAbilityData_IsCrafted final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBioAbilityData.IsUnlocked
// 0x0010 (0x0010 - 0x0000)
struct UWEBioAbilityData_IsUnlocked final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBioAbilityData.IsActiveBioAbility
// 0x0001 (0x0001 - 0x0000)
struct UWEBioAbilityData_IsActiveBioAbility final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBioAbilityViewModel.OnRecipePinned
// 0x0008 (0x0008 - 0x0000)
struct UWEBioAbilityViewModel_OnRecipePinned final
{
public:
	class UUWEPrimaryDataAssetBase*               Recipe;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBioAbilityViewModel.OnRecipeUnpinned
// 0x0008 (0x0008 - 0x0000)
struct UWEBioAbilityViewModel_OnRecipeUnpinned final
{
public:
	class UUWEPrimaryDataAssetBase*               Recipe;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBioAbilityViewModel.Setup
// 0x0028 (0x0028 - 0x0000)
struct UWEBioAbilityViewModel_Setup final
{
public:
	class UUWEBioAbilityData*                     InAbilityData;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AUWEBioLab*                             biolab;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEBiomodCrafterInteractionComponent*  InteractionComponent;                              // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 BioAbilityOwner;                                   // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsInstalled;                                    // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAvailabilityOverriden;                          // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBioAbilityViewModel.TrySetRecipePinned
// 0x0001 (0x0001 - 0x0000)
struct UWEBioAbilityViewModel_TrySetRecipePinned final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBioAbilityViewModel.GetCooldownFraction
// 0x0010 (0x0010 - 0x0000)
struct UWEBioAbilityViewModel_GetCooldownFraction final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBioAbilityViewModel.GetRemainingCooldownSeconds
// 0x0010 (0x0010 - 0x0000)
struct UWEBioAbilityViewModel_GetRemainingCooldownSeconds final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBioLab.OnWidgetPopped
// 0x0010 (0x0010 - 0x0000)
struct UWEBioLab_OnWidgetPopped final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLast;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UCommonActivatableWidget>   Class_0;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBioLabViewModel.OnAbilityGiven
// 0x0010 (0x0010 - 0x0000)
struct UWEBioLabViewModel_OnAbilityGiven final
{
public:
	const class UUWEAbilitySystemComponent*       ASC;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             AbilitySpecHandle;                                 // 0x0008(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBioLabViewModel.OnAbilityRemoved
// 0x0010 (0x0010 - 0x0000)
struct UWEBioLabViewModel_OnAbilityRemoved final
{
public:
	const class UUWEAbilitySystemComponent*       ASC;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             AbilitySpecHandle;                                 // 0x0008(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBiomodCrafterInteractionComponent.ServerInstallBiomod
// 0x0008 (0x0008 - 0x0000)
struct UWEBiomodCrafterInteractionComponent_ServerInstallBiomod final
{
public:
	class UUWEBioAbilityData*                     AbilityData;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBiomodCrafterInteractionComponent.ServerUninstallBiomod
// 0x0008 (0x0008 - 0x0000)
struct UWEBiomodCrafterInteractionComponent_ServerUninstallBiomod final
{
public:
	class UUWEBioAbilityData*                     AbilityData;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBiomodHUDViewModel.TryGetBiomodHUDViewModel
// 0x0010 (0x0010 - 0x0000)
struct UWEBiomodHUDViewModel_TryGetBiomodHUDViewModel final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEBiomodHUDViewModel*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBiomodHUDViewModel.DisplayBiomodActiveState
// 0x0010 (0x0010 - 0x0000)
struct UWEBiomodHUDViewModel_DisplayBiomodActiveState final
{
public:
	class UGameplayAbility*                       GameplayAbility;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActive;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBiomodHUDViewModel.OnAbilityActivated
// 0x0008 (0x0008 - 0x0000)
struct UWEBiomodHUDViewModel_OnAbilityActivated final
{
public:
	class UGameplayAbility*                       GameplayAbility;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBiomodHUDViewModel.OnAbilityCommit
// 0x0008 (0x0008 - 0x0000)
struct UWEBiomodHUDViewModel_OnAbilityCommit final
{
public:
	class UGameplayAbility*                       GameplayAbility;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBiomodHUDViewModel.OnAbilityEnded
// 0x0008 (0x0008 - 0x0000)
struct UWEBiomodHUDViewModel_OnAbilityEnded final
{
public:
	class UGameplayAbility*                       GameplayAbility;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBiomodHUDViewModel.OnAbilityGiven
// 0x0010 (0x0010 - 0x0000)
struct UWEBiomodHUDViewModel_OnAbilityGiven final
{
public:
	const class UUWEAbilitySystemComponent*       ASC;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             AbilitySpecHandle;                                 // 0x0008(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBiomodHUDViewModel.OnAbilityRemoved
// 0x0010 (0x0010 - 0x0000)
struct UWEBiomodHUDViewModel_OnAbilityRemoved final
{
public:
	const class UUWEAbilitySystemComponent*       ASC;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             AbilitySpecHandle;                                 // 0x0008(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBiomodHUDViewModel.GetViewModelForAbility
// 0x0010 (0x0010 - 0x0000)
struct UWEBiomodHUDViewModel_GetViewModelForAbility final
{
public:
	const class UGameplayAbility*                 GameplayAbility;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEBioAbilityViewModel*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBiomodStatics.GetInstalledAbilities
// 0x0018 (0x0018 - 0x0000)
struct UWEBiomodStatics_GetInstalledAbilities final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUWEBioAbilityData*>             ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBiomodStatics.GetInstalledPassiveBioAbilities
// 0x0018 (0x0018 - 0x0000)
struct UWEBiomodStatics_GetInstalledPassiveBioAbilities final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUWEBioAbilityData*>             ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEBiomods.UWEBiomodStatics.HasActiveBioAbility
// 0x0010 (0x0010 - 0x0000)
struct UWEBiomodStatics_HasActiveBioAbility final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBiomodStatics.HasBioAbility
// 0x0018 (0x0018 - 0x0000)
struct UWEBiomodStatics_HasBioAbility final
{
public:
	const class UUWEBioAbilityData*               BioAbilityData;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           Actor;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBiomodStatics.HasBioScanCapability
// 0x0010 (0x0010 - 0x0000)
struct UWEBiomodStatics_HasBioScanCapability final
{
public:
	class APlayerState*                           PS;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBiomodStatics.ShouldIgnoreUnlockBiomodRequirements
// 0x0010 (0x0010 - 0x0000)
struct UWEBiomodStatics_ShouldIgnoreUnlockBiomodRequirements final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEBiomods.UWEBioScanData.GetUnlockState
// 0x0010 (0x0010 - 0x0000)
struct UWEBioScanData_GetUnlockState final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUnlockState                                  ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

