#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEConsole

#include "Basic.hpp"

#include "UWEConsole_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class UWEConsole.UWEConsole
// 0x0010 (0x0170 - 0x0160)
class UUWEConsole final : public UConsole
{
public:
	uint8                                         Pad_160[0x10];                                     // 0x0160(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEConsole">();
	}
	static class UUWEConsole* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEConsole>();
	}
};

// Class UWEConsole.UWEConsoleModuleSettings
// 0x0028 (0x0050 - 0x0028)
class UUWEConsoleModuleSettings final : public UObject
{
public:
	bool                                          bLimitToAllowedCommandsInShipping;                 // 0x0028(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLimitToAllowedCommandsInEverythingElse;           // 0x0029(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FUWEConsoleCommand>             Commands;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FString>                         UnregisteredCommands;                              // 0x0040(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEConsoleModuleSettings">();
	}
	static class UUWEConsoleModuleSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEConsoleModuleSettings>();
	}
};

}

