#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWECommonUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUI_classes.hpp"
#include "UWECommonUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class UWECommonUI.CommonUIButtonBase
// 0x0000 (0x1530 - 0x1530)
class UCommonUIButtonBase : public UCommonButtonBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonUIButtonBase">();
	}
	static class UCommonUIButtonBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUIButtonBase>();
	}
};

// Class UWECommonUI.CommonUITextButtonBase
// 0x0020 (0x1550 - 0x1530)
class UCommonUITextButtonBase : public UCommonButtonBase
{
public:
	class FText                                   Text;                                              // 0x1530(0x0010)(Edit, BlueprintVisible, Protected, ExposeOnSpawn, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       TextLabel;                                         // 0x1540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1548[0x8];                                     // 0x1548(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonUITextButtonBase">();
	}
	static class UCommonUITextButtonBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUITextButtonBase>();
	}
};

// Class UWECommonUI.FocusActivatableWidget
// 0x0010 (0x04B8 - 0x04A8)
class UFocusActivatableWidget : public UCommonActivatableWidget
{
public:
	class UObject*                                Context;                                           // 0x04A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUWEInputMode                                 InputMode;                                         // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMouseCaptureMode                             CaptureMode;                                       // 0x04B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          HideCursor;                                        // 0x04B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B3[0x5];                                      // 0x04B3(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnContextChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FocusActivatableWidget">();
	}
	static class UFocusActivatableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFocusActivatableWidget>();
	}
};

// Class UWECommonUI.ModalActivatableWidget
// 0x0000 (0x04B8 - 0x04B8)
class UModalActivatableWidget : public UFocusActivatableWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModalActivatableWidget">();
	}
	static class UModalActivatableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModalActivatableWidget>();
	}
};

// Class UWECommonUI.UWEModalActivatableWidget
// 0x0000 (0x04B8 - 0x04B8)
class UUWEModalActivatableWidget : public UModalActivatableWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEModalActivatableWidget">();
	}
	static class UUWEModalActivatableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEModalActivatableWidget>();
	}
};

// Class UWECommonUI.UWECommonActionWidgetWithGlyphFallback
// 0x0028 (0x0450 - 0x0428)
class UUWECommonActionWidgetWithGlyphFallback final : public UCommonActionWidget
{
public:
	TSubclassOf<class UCommonTextStyle>           TextStyle;                                         // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOnlyShowRimForGlyphFallback;                      // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_431[0x1F];                                     // 0x0431(0x001F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWECommonActionWidgetWithGlyphFallback">();
	}
	static class UUWECommonActionWidgetWithGlyphFallback* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWECommonActionWidgetWithGlyphFallback>();
	}
};

// Class UWECommonUI.UWEEditableTextBoxWithValidation
// 0x0018 (0x0E90 - 0x0E78)
class UUWEEditableTextBoxWithValidation final : public UEditableTextBox
{
public:
	int32                                         MaxNumChars;                                       // 0x0E78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E7C[0x14];                                     // 0x0E7C(0x0014)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool ValidateText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEEditableTextBoxWithValidation">();
	}
	static class UUWEEditableTextBoxWithValidation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEEditableTextBoxWithValidation>();
	}
};

// Class UWECommonUI.UWEInputKeySelector
// 0x0468 (0x05D0 - 0x0168)
class UUWEInputKeySelector final : public UWidget
{
public:
	TMulticastInlineDelegate<void(const struct FInputChord& SelectedKey)> OnKeySelected;             // 0x0168(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnIsSelectingKeyChanged;                           // 0x0178(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FVector2D                              IconSize;                                          // 0x0188(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                TextPadding;                                       // 0x0198(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UCommonTextStyle>           TextStyle;                                         // 0x01B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FButtonStyle                           WidgetStyle;                                       // 0x01C0(0x0390)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FInputChord                            SelectedKey;                                       // 0x0550(0x0020)(BlueprintVisible, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                Margin;                                            // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FText                                   KeySelectionText;                                  // 0x0580(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FText                                   NoKeySpecifiedText;                                // 0x0590(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                          bAllowModifierKeys;                                // 0x05A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowGamepadKeys;                                 // 0x05A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A2[0x6];                                      // 0x05A2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FKey>                           EscapeKeys;                                        // 0x05A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5B8[0x18];                                     // 0x05B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetAllowGamepadKeys(bool bInAllowGamepadKeys);
	void SetAllowModifierKeys(bool bInAllowModifierKeys);
	void SetEscapeKeys(const TArray<struct FKey>& InKeys);
	void SetIconSize(const struct FVector2D& NewSize);
	void SetKeySelectionText(const class FText& InKeySelectionText);
	void SetNoKeySpecifiedText(const class FText& InNoKeySpecifiedText);
	void SetSelectedKey(const struct FInputChord& InSelectedKey);
	void SetStyle(TSubclassOf<class UCommonTextStyle> InStyle);
	void SetTextBlockVisibility(const ESlateVisibility InVisibility);

	bool GetIsSelectingKey() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEInputKeySelector">();
	}
	static class UUWEInputKeySelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEInputKeySelector>();
	}
};

// Class UWECommonUI.UWELazyImage
// 0x0000 (0x0450 - 0x0450)
class UUWELazyImage final : public UCommonLazyImage
{
public:
	void SetBrushFromLazyTextureKeepingSize(const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	void SetBrushFromLazyTextureMatchingSize(const TSoftObjectPtr<class UTexture2D>& LazyTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWELazyImage">();
	}
	static class UUWELazyImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWELazyImage>();
	}
};

// Class UWECommonUI.UWELazyWidget
// 0x0050 (0x01D0 - 0x0180)
class UUWELazyWidget final : public UContentWidget
{
public:
	TSoftClassPtr<class UClass>                   WidgetClass;                                       // 0x0180(0x0028)(Edit, BlueprintVisible, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Width;                                             // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Height;                                            // 0x01AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnWidgetInView;                                    // 0x01B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C0[0x10];                                     // 0x01C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWELazyWidget">();
	}
	static class UUWELazyWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWELazyWidget>();
	}
};

// Class UWECommonUI.UWELazyWidgetSlot
// 0x0008 (0x0040 - 0x0038)
class UUWELazyWidgetSlot final : public UPanelSlot
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWELazyWidgetSlot">();
	}
	static class UUWELazyWidgetSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWELazyWidgetSlot>();
	}
};

// Class UWECommonUI.UWENavigationInputSubsystem
// 0x0018 (0x0048 - 0x0030)
class UUWENavigationInputSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	EUINavigation GetLastNavigationDirection() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWENavigationInputSubsystem">();
	}
	static class UUWENavigationInputSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWENavigationInputSubsystem>();
	}
};

// Class UWECommonUI.UWERichTextBlockLinkDecorator
// 0x0698 (0x06C0 - 0x0028)
class UUWERichTextBlockLinkDecorator : public URichTextBlockDecorator
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FHyperlinkStyle                        Style;                                             // 0x0030(0x0690)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWERichTextBlockLinkDecorator">();
	}
	static class UUWERichTextBlockLinkDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWERichTextBlockLinkDecorator>();
	}
};

// Class UWECommonUI.UWERichTextBlockWithLinks
// 0x0020 (0x0800 - 0x07E0)
class UUWERichTextBlockWithLinks final : public UCommonRichTextBlock
{
public:
	TMulticastInlineDelegate<void(const class FString& Command, const class FString& Context)> OnLinkClicked; // 0x07E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class UDataTable*                             RuntimeTextStyleSet;                               // 0x07F0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             BaseTextStyleSet;                                  // 0x07F8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWERichTextBlockWithLinks">();
	}
	static class UUWERichTextBlockWithLinks* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWERichTextBlockWithLinks>();
	}
};

// Class UWECommonUI.UWEScrollBox
// 0x0000 (0x0B90 - 0x0B90)
class UUWEScrollBox final : public UScrollBox
{
public:
	bool IsWidgetInView(class UWidget* Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEScrollBox">();
	}
	static class UUWEScrollBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEScrollBox>();
	}
};

// Class UWECommonUI.UWEScrollNotify
// 0x0000 (0x0000 - 0x0000)
class IUWEScrollNotify final
{
public:
	void ScrollBoxOnUserScrolled(class UUWEScrollBox* ScrollBox);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEScrollNotify">();
	}
	static class IUWEScrollNotify* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUWEScrollNotify>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class UWECommonUI.UWESimpleGrid
// 0x0080 (0x0200 - 0x0180)
class UUWESimpleGrid final : public UPanelWidget
{
public:
	uint8                                         Pad_180[0x10];                                     // 0x0180(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         NumColumns;                                        // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumRows;                                           // 0x0194(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                SlotPadding;                                       // 0x0198(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         SlotMinHeight;                                     // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<EUINavigation, class UWidget*>           NavigationToExplicitWidget;                        // 0x01B0(0x0050)(ExportObject, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void ClearExplicitNavigationOverride(EUINavigation Direction);
	void SetExplicitNavigationOverride(EUINavigation Direction, class UWidget* Widget);
	void SetNumColumns(int32 InNumColumns);
	void SetNumRows(int32 InNumRows);
	void SetSlotMinHeight(float InSlotMinHeight);
	void SetSlotPadding(const struct FMargin& InSlotPadding);

	int32 GetNumColumns() const;
	int32 GetNumRows() const;
	struct FMargin GetSlotPadding() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESimpleGrid">();
	}
	static class UUWESimpleGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESimpleGrid>();
	}
};

// Class UWECommonUI.UWESimpleGridSlot
// 0x0010 (0x0048 - 0x0038)
class UUWESimpleGridSlot final : public UPanelSlot
{
public:
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A[0xE];                                       // 0x003A(0x000E)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

	EHorizontalAlignment GetHorizontalAlignment() const;
	EVerticalAlignment GetVerticalAlignment() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESimpleGridSlot">();
	}
	static class UUWESimpleGridSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESimpleGridSlot>();
	}
};

// Class UWECommonUI.UWEWidgetLayer
// 0x0008 (0x02A8 - 0x02A0)
class UUWEWidgetLayer final : public UCommonActivatableWidgetStack
{
public:
	EUWEWindowManagerLayer                        Layer;                                             // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UCommonUserWidget* AddNamedWidget(TSubclassOf<class UCommonUserWidget> WidgetClass, class FName Name_0);
	void RemoveNamedWidget(class FName Name_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEWidgetLayer">();
	}
	static class UUWEWidgetLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEWidgetLayer>();
	}
};

// Class UWECommonUI.WindowManager
// 0x0098 (0x00C8 - 0x0030)
class UWindowManager final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(EUWEWindowManagerLayer LayerId, bool IsFirst, TSubclassOf<class UCommonActivatableWidget> WidgetClass)> OnWidgetPushed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EUWEWindowManagerLayer LayerId, bool IsLast, TSubclassOf<class UCommonActivatableWidget> WidgetClass)> OnWidgetPopped; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UInputAction* InputAction)> OnEnhancedInputAction;           // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMap<EUWEWindowManagerLayer, class UUWEWidgetLayer*> Layers;                                     // 0x0068(0x0050)(ExportObject, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UUserWidget*                            MainScreen;                                        // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UCommonUserWidget* AddChildToLayer(EUWEWindowManagerLayer LayerId, TSubclassOf<class UCommonUserWidget> WidgetClass, class FName Name_0);
	void BroadcastEnhancedInputAction(class UInputAction* InputAction);
	void EmptyLayer(EUWEWindowManagerLayer LayerId);
	class UCommonActivatableWidget* GetActiveWidget(EUWEWindowManagerLayer LayerId);
	void HandleAppActivationChanged(bool bIsActive);
	bool HasWidgetOnLayer(EUWEWindowManagerLayer LayerId);
	void Hide();
	void Init(TSubclassOf<class UUserWidget> InMainScreenClass);
	void OnWidgetRemoved(class UWidget* Widget);
	void Pop(class UCommonActivatableWidget* Widget);
	void PopFromLayer(EUWEWindowManagerLayer LayerId);
	class UCommonActivatableWidget* PushToLayer(EUWEWindowManagerLayer LayerId, TSubclassOf<class UCommonActivatableWidget> ActivatableWidgetClass);
	class UModalActivatableWidget* PushToLayerWithContext(EUWEWindowManagerLayer LayerId, TSubclassOf<class UModalActivatableWidget> ActivatableWidgetClass, class UObject* Context);
	void RegisterLayer(EUWEWindowManagerLayer LayerId, class UUWEWidgetLayer* InLayer);
	void RemoveChildFromLayer(EUWEWindowManagerLayer LayerId, class FName Name_0);
	void RemoveWidgetFromLayer(EUWEWindowManagerLayer LayerId, class UCommonActivatableWidget* Widget);
	class UCommonActivatableWidget* SetWidgetOnLayer(EUWEWindowManagerLayer LayerId, TSubclassOf<class UCommonActivatableWidget> ActivatableWidgetClass);
	void Show();

	bool IsHidden() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WindowManager">();
	}
	static class UWindowManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWindowManager>();
	}
};

}

