#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWECarryable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWEInventory_structs.hpp"
#include "UWECarryable_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function UWECarryable.UWEAbilityTask_WaitAttachCarryable.WaitAttachCarryable
// 0x0038 (0x0038 - 0x0000)
struct UWEAbilityTask_WaitAttachCarryable_WaitAttachCarryable final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InCarryableActor;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        InParentComponent;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InSocket;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskInstanceName;                                  // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseTransition;                                     // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEAbilityTask_WaitAttachCarryable*    ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWEAbilityTask_WaitAttachCarryable.OnDied
// 0x0010 (0x0010 - 0x0000)
struct UWEAbilityTask_WaitAttachCarryable_OnDied final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWEAbilityTask_WaitAttachCarryable.GetCarryableActor
// 0x0008 (0x0008 - 0x0000)
struct UWEAbilityTask_WaitAttachCarryable_GetCarryableActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableActorPowered.NetMulticast_SetCollisionResponse
// 0x0002 (0x0002 - 0x0000)
struct UWECarryableActorPowered_NetMulticast_SetCollisionResponse final
{
public:
	ECollisionChannel                             Channel;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionResponse                            NewResponse;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableActorPowered.NetMulticast_SetPhysicsEnabled
// 0x0002 (0x0002 - 0x0000)
struct UWECarryableActorPowered_NetMulticast_SetPhysicsEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceToSleep;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableActorPowered.OnEnergyEmpty
// 0x0008 (0x0008 - 0x0000)
struct UWECarryableActorPowered_OnEnergyEmpty final
{
public:
	class AActor*                                 Who;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableActorPowered.OnEnergyRefilled
// 0x0008 (0x0008 - 0x0000)
struct UWECarryableActorPowered_OnEnergyRefilled final
{
public:
	class AActor*                                 Who;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableActorPowered.OnPhysicsSleep
// 0x0010 (0x0010 - 0x0000)
struct UWECarryableActorPowered_OnPhysicsSleep final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableActorPowered.OnPhysicsWake
// 0x0010 (0x0010 - 0x0000)
struct UWECarryableActorPowered_OnPhysicsWake final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableActorPowered.OnPowerSourceAdded
// 0x0040 (0x0040 - 0x0000)
struct UWECarryableActorPowered_OnPowerSourceAdded final
{
public:
	struct FUWEInventoryItem                      InventoryItem;                                     // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableActorPowered.OnPowerSourceRemoved
// 0x0040 (0x0040 - 0x0000)
struct UWECarryableActorPowered_OnPowerSourceRemoved final
{
public:
	struct FUWEInventoryItem                      InventoryItem;                                     // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableActorPowered.SetReplicatedCollisionEnabled
// 0x0001 (0x0001 - 0x0000)
struct UWECarryableActorPowered_SetReplicatedCollisionEnabled final
{
public:
	bool                                          bNewCollisionEnabled;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableActorPowered.SetReplicatedSimulatePhysics
// 0x0001 (0x0001 - 0x0000)
struct UWECarryableActorPowered_SetReplicatedSimulatePhysics final
{
public:
	bool                                          bNewSimulatePhysics;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableActorPowered.GetIsPowered
// 0x0001 (0x0001 - 0x0000)
struct UWECarryableActorPowered_GetIsPowered final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableAttachPointComponent.AttachCarryable
// 0x0010 (0x0010 - 0x0000)
struct UWECarryableAttachPointComponent_AttachCarryable final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWECarryable.UWECarryableAttachPointComponent.DetachCarryable
// 0x0001 (0x0001 - 0x0000)
struct UWECarryableAttachPointComponent_DetachCarryable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableAttachPointComponent.OnAttachedDestroyed
// 0x0008 (0x0008 - 0x0000)
struct UWECarryableAttachPointComponent_OnAttachedDestroyed final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableAttachPointComponent.OnOwnerDestroyed
// 0x0008 (0x0008 - 0x0000)
struct UWECarryableAttachPointComponent_OnOwnerDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableAttachPointComponent.OnPhysicsWake
// 0x0010 (0x0010 - 0x0000)
struct UWECarryableAttachPointComponent_OnPhysicsWake final
{
public:
	class UPrimitiveComponent*                    WakingComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableAttachPointComponent.OnPostPickedUpItem
// 0x0008 (0x0008 - 0x0000)
struct UWECarryableAttachPointComponent_OnPostPickedUpItem final
{
public:
	class AActor*                                 PickupActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableAttachPointComponent.OnRep_AttachedActor
// 0x0008 (0x0008 - 0x0000)
struct UWECarryableAttachPointComponent_OnRep_AttachedActor final
{
public:
	TWeakObjectPtr<class AActor>                  OldAttachedActor;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableAttachPointComponent.IsOccupied
// 0x0001 (0x0001 - 0x0000)
struct UWECarryableAttachPointComponent_IsOccupied final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableData.GetCarryableDataForActor
// 0x0010 (0x0010 - 0x0000)
struct UWECarryableData_GetCarryableDataForActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWECarryableData*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableEventInterface.OnTransitionBegin
// 0x001C (0x001C - 0x0000)
struct UWECarryableEventInterface_OnTransitionBegin final
{
public:
	struct FUWECarryableAttachmentInfo            AttachmentInfo;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableEventInterface.OnTransitionEnd
// 0x001C (0x001C - 0x0000)
struct UWECarryableEventInterface_OnTransitionEnd final
{
public:
	struct FUWECarryableAttachmentInfo            AttachmentInfo;                                    // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWECarryable.UWECarryableStatics.GrantCarryableAbilities
// 0x0020 (0x0020 - 0x0000)
struct UWECarryableStatics_GrantCarryableAbilities final
{
public:
	class AActor*                                 CarryableActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayAbilitySpecHandle>     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

}

