#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWECamera

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UWECamera.UWECameraAnimation.BPAnimateCamera
// 0x1190 (0x1190 - 0x0000)
struct UWECameraAnimation_BPAnimateCamera final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-8 ])
	struct FMinimalViewInfo                       DesiredView;                                       // 0x0010(0x08C0)(Parm, NativeAccessSpecifierPublic)
	struct FMinimalViewInfo                       ReturnValue;                                       // 0x08D0(0x08C0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWECamera.UWECameraAnimation.GetCharacter
// 0x0008 (0x0008 - 0x0000)
struct UWECameraAnimation_GetCharacter final
{
public:
	class ACharacter*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECamera.UWECameraAnimation.GetFirstPersonCamera
// 0x0008 (0x0008 - 0x0000)
struct UWECameraAnimation_GetFirstPersonCamera final
{
public:
	class UUWEFirstPersonCamera*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECamera.UWEFirstPersonCamera.AddCameraAnimation
// 0x0010 (0x0010 - 0x0000)
struct UWEFirstPersonCamera_AddCameraAnimation final
{
public:
	class UUWEFirstPersonCamera*                  Camera;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUWECameraAnimation>        AnimationClass;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECamera.UWEFirstPersonCamera.EndCinematicLocation
// 0x0008 (0x0008 - 0x0000)
struct UWEFirstPersonCamera_EndCinematicLocation final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECamera.UWEFirstPersonCamera.EndCinematicRotation
// 0x0008 (0x0008 - 0x0000)
struct UWEFirstPersonCamera_EndCinematicRotation final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECamera.UWEFirstPersonCamera.SetCameraLockTransitionTime
// 0x0004 (0x0004 - 0x0000)
struct UWEFirstPersonCamera_SetCameraLockTransitionTime final
{
public:
	float                                         InTransistionTime;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECamera.UWEFirstPersonCamera.StartCinematicLocation
// 0x0008 (0x0008 - 0x0000)
struct UWEFirstPersonCamera_StartCinematicLocation final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECamera.UWEFirstPersonCamera.StartCinematicRotation
// 0x0008 (0x0008 - 0x0000)
struct UWEFirstPersonCamera_StartCinematicRotation final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECamera.UWEFirstPersonCamera.IsCinematic
// 0x0001 (0x0001 - 0x0000)
struct UWEFirstPersonCamera_IsCinematic final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECamera.UWEFirstPersonCamera.IsCinematicLocation
// 0x0001 (0x0001 - 0x0000)
struct UWEFirstPersonCamera_IsCinematicLocation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECamera.UWEFirstPersonCamera.IsCinematicRotation
// 0x0001 (0x0001 - 0x0000)
struct UWEFirstPersonCamera_IsCinematicRotation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

