#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWECamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class UWECamera.UWEAnimNotifyState_CinematicCamera
// 0x0008 (0x0038 - 0x0030)
class UUWEAnimNotifyState_CinematicCamera final : public UAnimNotifyState
{
public:
	bool                                          bAnimateRotation;                                  // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimateLocation;                                  // 0x0031(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         TransitionTime;                                    // 0x0034(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAnimNotifyState_CinematicCamera">();
	}
	static class UUWEAnimNotifyState_CinematicCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAnimNotifyState_CinematicCamera>();
	}
};

// Class UWECamera.UWECameraAnimation
// 0x0008 (0x0030 - 0x0028)
class UUWECameraAnimation : public UObject
{
public:
	bool                                          bAffectsMeshLocation;                              // 0x0028(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	struct FMinimalViewInfo BPAnimateCamera(float DeltaTime, const struct FMinimalViewInfo& DesiredView);
	void BPInitialize();

	class ACharacter* GetCharacter() const;
	class UUWEFirstPersonCamera* GetFirstPersonCamera() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWECameraAnimation">();
	}
	static class UUWECameraAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWECameraAnimation>();
	}
};

// Class UWECamera.UWEFirstPersonCamera
// 0x0970 (0x1400 - 0x0A90)
class UUWEFirstPersonCamera final : public UCameraComponent
{
public:
	TArray<TSubclassOf<class UUWECameraAnimation>> AnimationClasses;                                 // 0x0A90(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 FirstPersonMesh;                                   // 0x0AA0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CameraSocketName;                                  // 0x0AA8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAdjustMeshLocation;                               // 0x0AB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AB1[0x1];                                      // 0x0AB1(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bOverrideUseCameraSocketLocation;                  // 0x0AB2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideUseCameraSocketRotation;                  // 0x0AB3(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AB4[0x4];                                      // 0x0AB4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UUWECameraAnimation*>            ActiveAnimations;                                  // 0x0AB8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC8[0x48];                                     // 0x0AC8(0x0048)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<TWeakObjectPtr<class UObject>>         LocationUnlocks;                                   // 0x0B10(0x0010)(Edit, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class UObject>>         RotationUnlocks;                                   // 0x0B20(0x0010)(Edit, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FMinimalViewInfo                       DesiredView;                                       // 0x0B30(0x08C0)(Edit, EditConst, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13F0[0x10];                                    // 0x13F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static void AddCameraAnimation(class UUWEFirstPersonCamera* Camera, TSubclassOf<class UUWECameraAnimation> AnimationClass);

	void EndCinematicLocation(const class UObject* Context);
	void EndCinematicRotation(const class UObject* Context);
	void OnAnimInitialized();
	void SetCameraLockTransitionTime(float InTransistionTime);
	void StartCinematicLocation(const class UObject* Context);
	void StartCinematicRotation(const class UObject* Context);

	bool IsCinematic() const;
	bool IsCinematicLocation() const;
	bool IsCinematicRotation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEFirstPersonCamera">();
	}
	static class UUWEFirstPersonCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEFirstPersonCamera>();
	}
};

// Class UWECamera.UWEPlayerCameraManager
// 0x0000 (0x27D8 - 0x27D8)
#pragma pack(push, 0x1)
class alignas(0x08) AUWEPlayerCameraManager : public APlayerCameraManager
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPlayerCameraManager">();
	}
	static class AUWEPlayerCameraManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEPlayerCameraManager>();
	}
};
#pragma pack(pop)

}

