#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWECrashReporter

#include "Basic.hpp"


namespace SDK::Params
{

// Function UWECrashReporter.UWECrashReporterStatics.SendEvent
// 0x0010 (0x0010 - 0x0000)
struct UWECrashReporterStatics_SendEvent final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECrashReporter.UWECrashReporterStatics.WasLastExitUnclean
// 0x0001 (0x0001 - 0x0000)
struct UWECrashReporterStatics_WasLastExitUnclean final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECrashReporter.UWECrashReporterStatics.WasLastLobbyNotReached
// 0x0001 (0x0001 - 0x0000)
struct UWECrashReporterStatics_WasLastLobbyNotReached final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECrashReporter.UWECrashReporterSubsystem.OnSentrySettings
// 0x0008 (0x0008 - 0x0000)
struct UWECrashReporterSubsystem_OnSentrySettings final
{
public:
	class USentrySettings*                        Settings;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECrashReporter.UWESentryGameInstanceUpdater.OnSonarLoginCompleted
// 0x0001 (0x0001 - 0x0000)
struct UWESentryGameInstanceUpdater_OnSonarLoginCompleted final
{
public:
	bool                                          bLoggedIn;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

