#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWECommonUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UWECommonUI_structs.hpp"


namespace SDK::Params
{

// Function UWECommonUI.CommonUITextButtonBase.SetText
// 0x0010 (0x0010 - 0x0000)
struct CommonUITextButtonBase_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEEditableTextBoxWithValidation.ValidateText
// 0x0018 (0x0018 - 0x0000)
struct UWEEditableTextBoxWithValidation_ValidateText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWECommonUI.UWEInputKeySelector.SetAllowGamepadKeys
// 0x0001 (0x0001 - 0x0000)
struct UWEInputKeySelector_SetAllowGamepadKeys final
{
public:
	bool                                          bInAllowGamepadKeys;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEInputKeySelector.SetAllowModifierKeys
// 0x0001 (0x0001 - 0x0000)
struct UWEInputKeySelector_SetAllowModifierKeys final
{
public:
	bool                                          bInAllowModifierKeys;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEInputKeySelector.SetEscapeKeys
// 0x0010 (0x0010 - 0x0000)
struct UWEInputKeySelector_SetEscapeKeys final
{
public:
	TArray<struct FKey>                           InKeys;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEInputKeySelector.SetIconSize
// 0x0010 (0x0010 - 0x0000)
struct UWEInputKeySelector_SetIconSize final
{
public:
	struct FVector2D                              NewSize;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEInputKeySelector.SetKeySelectionText
// 0x0010 (0x0010 - 0x0000)
struct UWEInputKeySelector_SetKeySelectionText final
{
public:
	class FText                                   InKeySelectionText;                                // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEInputKeySelector.SetNoKeySpecifiedText
// 0x0010 (0x0010 - 0x0000)
struct UWEInputKeySelector_SetNoKeySpecifiedText final
{
public:
	class FText                                   InNoKeySpecifiedText;                              // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEInputKeySelector.SetSelectedKey
// 0x0020 (0x0020 - 0x0000)
struct UWEInputKeySelector_SetSelectedKey final
{
public:
	struct FInputChord                            InSelectedKey;                                     // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEInputKeySelector.SetStyle
// 0x0008 (0x0008 - 0x0000)
struct UWEInputKeySelector_SetStyle final
{
public:
	TSubclassOf<class UCommonTextStyle>           InStyle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEInputKeySelector.SetTextBlockVisibility
// 0x0001 (0x0001 - 0x0000)
struct UWEInputKeySelector_SetTextBlockVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEInputKeySelector.GetIsSelectingKey
// 0x0001 (0x0001 - 0x0000)
struct UWEInputKeySelector_GetIsSelectingKey final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWELazyImage.SetBrushFromLazyTextureKeepingSize
// 0x0028 (0x0028 - 0x0000)
struct UWELazyImage_SetBrushFromLazyTextureKeepingSize final
{
public:
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWELazyImage.SetBrushFromLazyTextureMatchingSize
// 0x0028 (0x0028 - 0x0000)
struct UWELazyImage_SetBrushFromLazyTextureMatchingSize final
{
public:
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWENavigationInputSubsystem.GetLastNavigationDirection
// 0x0001 (0x0001 - 0x0000)
struct UWENavigationInputSubsystem_GetLastNavigationDirection final
{
public:
	EUINavigation                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEScrollBox.IsWidgetInView
// 0x0010 (0x0010 - 0x0000)
struct UWEScrollBox_IsWidgetInView final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWECommonUI.UWEScrollNotify.ScrollBoxOnUserScrolled
// 0x0008 (0x0008 - 0x0000)
struct UWEScrollNotify_ScrollBoxOnUserScrolled final
{
public:
	class UUWEScrollBox*                          ScrollBox;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGrid.ClearExplicitNavigationOverride
// 0x0001 (0x0001 - 0x0000)
struct UWESimpleGrid_ClearExplicitNavigationOverride final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGrid.SetExplicitNavigationOverride
// 0x0010 (0x0010 - 0x0000)
struct UWESimpleGrid_SetExplicitNavigationOverride final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UWidget*                                Widget;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGrid.SetNumColumns
// 0x0004 (0x0004 - 0x0000)
struct UWESimpleGrid_SetNumColumns final
{
public:
	int32                                         InNumColumns;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGrid.SetNumRows
// 0x0004 (0x0004 - 0x0000)
struct UWESimpleGrid_SetNumRows final
{
public:
	int32                                         InNumRows;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGrid.SetSlotMinHeight
// 0x0004 (0x0004 - 0x0000)
struct UWESimpleGrid_SetSlotMinHeight final
{
public:
	float                                         InSlotMinHeight;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGrid.SetSlotPadding
// 0x0010 (0x0010 - 0x0000)
struct UWESimpleGrid_SetSlotPadding final
{
public:
	struct FMargin                                InSlotPadding;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGrid.GetNumColumns
// 0x0004 (0x0004 - 0x0000)
struct UWESimpleGrid_GetNumColumns final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGrid.GetNumRows
// 0x0004 (0x0004 - 0x0000)
struct UWESimpleGrid_GetNumRows final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGrid.GetSlotPadding
// 0x0010 (0x0010 - 0x0000)
struct UWESimpleGrid_GetSlotPadding final
{
public:
	struct FMargin                                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGridSlot.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct UWESimpleGridSlot_SetHorizontalAlignment final
{
public:
	EHorizontalAlignment                          InHorizontalAlignment;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGridSlot.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct UWESimpleGridSlot_SetVerticalAlignment final
{
public:
	EVerticalAlignment                            InVerticalAlignment;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGridSlot.GetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct UWESimpleGridSlot_GetHorizontalAlignment final
{
public:
	EHorizontalAlignment                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWESimpleGridSlot.GetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct UWESimpleGridSlot_GetVerticalAlignment final
{
public:
	EVerticalAlignment                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEWidgetLayer.AddNamedWidget
// 0x0018 (0x0018 - 0x0000)
struct UWEWidgetLayer_AddNamedWidget final
{
public:
	TSubclassOf<class UCommonUserWidget>          WidgetClass;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonUserWidget*                      ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.UWEWidgetLayer.RemoveNamedWidget
// 0x0008 (0x0008 - 0x0000)
struct UWEWidgetLayer_RemoveNamedWidget final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.AddChildToLayer
// 0x0020 (0x0020 - 0x0000)
struct WindowManager_AddChildToLayer final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UCommonUserWidget>          WidgetClass;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonUserWidget*                      ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.BroadcastEnhancedInputAction
// 0x0008 (0x0008 - 0x0000)
struct WindowManager_BroadcastEnhancedInputAction final
{
public:
	class UInputAction*                           InputAction;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.EmptyLayer
// 0x0001 (0x0001 - 0x0000)
struct WindowManager_EmptyLayer final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.GetActiveWidget
// 0x0010 (0x0010 - 0x0000)
struct WindowManager_GetActiveWidget final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonActivatableWidget*               ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.HandleAppActivationChanged
// 0x0001 (0x0001 - 0x0000)
struct WindowManager_HandleAppActivationChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.HasWidgetOnLayer
// 0x0002 (0x0002 - 0x0000)
struct WindowManager_HasWidgetOnLayer final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.Init
// 0x0008 (0x0008 - 0x0000)
struct WindowManager_Init final
{
public:
	TSubclassOf<class UUserWidget>                InMainScreenClass;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.OnWidgetRemoved
// 0x0008 (0x0008 - 0x0000)
struct WindowManager_OnWidgetRemoved final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.Pop
// 0x0008 (0x0008 - 0x0000)
struct WindowManager_Pop final
{
public:
	class UCommonActivatableWidget*               Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.PopFromLayer
// 0x0001 (0x0001 - 0x0000)
struct WindowManager_PopFromLayer final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.PushToLayer
// 0x0018 (0x0018 - 0x0000)
struct WindowManager_PushToLayer final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UCommonActivatableWidget>   ActivatableWidgetClass;                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonActivatableWidget*               ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.PushToLayerWithContext
// 0x0020 (0x0020 - 0x0000)
struct WindowManager_PushToLayerWithContext final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UModalActivatableWidget>    ActivatableWidgetClass;                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Context;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UModalActivatableWidget*                ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.RegisterLayer
// 0x0010 (0x0010 - 0x0000)
struct WindowManager_RegisterLayer final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEWidgetLayer*                        InLayer;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.RemoveChildFromLayer
// 0x000C (0x000C - 0x0000)
struct WindowManager_RemoveChildFromLayer final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   Name_0;                                            // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.RemoveWidgetFromLayer
// 0x0010 (0x0010 - 0x0000)
struct WindowManager_RemoveWidgetFromLayer final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonActivatableWidget*               Widget;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.SetWidgetOnLayer
// 0x0018 (0x0018 - 0x0000)
struct WindowManager_SetWidgetOnLayer final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UCommonActivatableWidget>   ActivatableWidgetClass;                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonActivatableWidget*               ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWECommonUI.WindowManager.IsHidden
// 0x0001 (0x0001 - 0x0000)
struct WindowManager_IsHidden final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

