#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWECrashReporter

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "Sentry_classes.hpp"


namespace SDK
{

// Class UWECrashReporter.UWECrashReporterStatics
// 0x0000 (0x0028 - 0x0028)
class UUWECrashReporterStatics final : public UBlueprintFunctionLibrary
{
public:
	static void NotifyLobbyReached();
	static void SendEvent(const class FString& Message);
	static bool WasLastExitUnclean();
	static bool WasLastLobbyNotReached();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWECrashReporterStatics">();
	}
	static class UUWECrashReporterStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWECrashReporterStatics>();
	}
};

// Class UWECrashReporter.UWEBeforeSendHandler
// 0x0000 (0x0028 - 0x0028)
class UUWEBeforeSendHandler final : public USentryBeforeSendHandler
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEBeforeSendHandler">();
	}
	static class UUWEBeforeSendHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEBeforeSendHandler>();
	}
};

// Class UWECrashReporter.UWECrashReporterSubsystem
// 0x0058 (0x0088 - 0x0030)
class UUWECrashReporterSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x58];                                      // 0x0030(0x0058)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnSentrySettings(class USentrySettings* Settings);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWECrashReporterSubsystem">();
	}
	static class UUWECrashReporterSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWECrashReporterSubsystem>();
	}
};

// Class UWECrashReporter.UWESentryGameInstanceUpdater
// 0x0008 (0x0038 - 0x0030)
class UUWESentryGameInstanceUpdater final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnSonarLoginCompleted(bool bLoggedIn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESentryGameInstanceUpdater">();
	}
	static class UUWESentryGameInstanceUpdater* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESentryGameInstanceUpdater>();
	}
};

// Class UWECrashReporter.UWESentryLocationUpdater
// 0x0008 (0x0038 - 0x0030)
class UUWESentryLocationUpdater final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESentryLocationUpdater">();
	}
	static class UUWESentryLocationUpdater* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESentryLocationUpdater>();
	}
};

// Class UWECrashReporter.UWESentryTagsUpdater
// 0x0028 (0x0058 - 0x0030)
class UUWESentryTagsUpdater final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         UpdateSeconds;                                     // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisabled;                                         // 0x003C(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D[0x1B];                                      // 0x003D(0x001B)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESentryTagsUpdater">();
	}
	static class UUWESentryTagsUpdater* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESentryTagsUpdater>();
	}
};

}

