#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEDoor

#include "Basic.hpp"

#include "UWEGameplay_classes.hpp"


namespace SDK
{

// Class UWEDoor.UWEDoorBase
// 0x00F0 (0x03B8 - 0x02C8)
class AUWEDoorBase : public AUWEGameplayActor
{
public:
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(bool IsOpen)>   OnOpenChanged;                                     // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bIsOpen;                                           // 0x02E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWantsToOpen;                                      // 0x02E1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWaitForAnimation;                                 // 0x02E2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	class UCurveFloat*                            OpenCurve;                                         // 0x02E8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFMODEvent>              OpenSound;                                         // 0x02F0(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFMODEvent>              CloseSound;                                        // 0x0318(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         OpenSpeed;                                         // 0x0340(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class UUWEStoryGoal>           StoryGoalToOpen;                                   // 0x0348(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UUWEStoryGoal>           StoryGoalToClose;                                  // 0x0370(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWESaveComponent*                      SaveComponent;                                     // 0x0398(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEGenericLockComponent*               LockComponent;                                     // 0x03A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWESaveHandle*                         SaveHandle;                                        // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void CanUnlock(bool* Result, class APawn* TriggeringActor);
	void Close();
	void CloseAndLock();
	void Lock();
	void OnOpenedFractionChanged(float Fraction);
	void OnRep_IsOpen();
	void OnStoryGoalUnlocked(class UUWEStoryGoal* lockedStoryGoal, class AActor* ReceivingActor);
	void Open();
	void ToggleOpen();
	void Unlock(class APawn* TriggeringActor);
	void UnlockAndOpen(class APawn* TriggeringActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDoorBase">();
	}
	static class AUWEDoorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEDoorBase>();
	}
};

}

