#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEDynamicResources

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "UWEDynamicResources_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function UWEDynamicResources.UWEAbilityTask_WaitMiniGameCompleted.WaitMiniGameCompleted
// 0x0010 (0x0010 - 0x0000)
struct UWEAbilityTask_WaitMiniGameCompleted_WaitMiniGameCompleted final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEAbilityTask_WaitMiniGameCompleted*  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEDynamicResources.UWEAbilityTask_WaitMiniGameCompleted.OnTargetDataCancelledCallback
// 0x0028 (0x0028 - 0x0000)
struct UWEAbilityTask_WaitMiniGameCompleted_OnTargetDataCancelledCallback final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEDynamicResources.UWEAbilityTask_WaitMiniGameCompleted.OnTargetDataReadyCallback
// 0x0028 (0x0028 - 0x0000)
struct UWEAbilityTask_WaitMiniGameCompleted_OnTargetDataReadyCallback final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEDynamicResources.UWEAbilityTask_WaitMiniGameCompleted.OnTargetDataReplicatedCallback
// 0x0030 (0x0030 - 0x0000)
struct UWEAbilityTask_WaitMiniGameCompleted_OnTargetDataReplicatedCallback final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActivationTag;                                     // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEDynamicResources.UWEAbilityTask_WaitMiniGameCompleted.SetCompletionResult
// 0x0010 (0x0010 - 0x0000)
struct UWEAbilityTask_WaitMiniGameCompleted_SetCompletionResult final
{
public:
	struct FUWEMiniGameCompletion                 InCompletionResult;                                // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

}

