#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEDynamicResources

#include "Basic.hpp"

#include "GameplayAbilities_classes.hpp"
#include "UWEDynamicResources_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "UWEAssetRegistry_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class UWEDynamicResources.UWEAbilityTask_WaitMiniGameCompleted
// 0x0040 (0x00C0 - 0x0080)
class UUWEAbilityTask_WaitMiniGameCompleted final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FUWEMiniGameCompletion& CompletionResult)> ValidData; // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FUWEMiniGameCompletion& CompletionResult)> Cancelled; // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class AGameplayAbilityTargetActor*            TargetActor;                                       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWEMiniGameCompletion                 CompletionResult;                                  // 0x00B0(0x0010)(NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UUWEAbilityTask_WaitMiniGameCompleted* WaitMiniGameCompleted(class UGameplayAbility* OwningAbility);

	void OnTargetDataCancelledCallback(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTargetDataReadyCallback(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTargetDataReplicatedCallback(const struct FGameplayAbilityTargetDataHandle& Data, const struct FGameplayTag& ActivationTag);
	void OnTargetDataReplicatedCancelledCallback();
	void SetCompletionResult(const struct FUWEMiniGameCompletion& InCompletionResult);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAbilityTask_WaitMiniGameCompleted">();
	}
	static class UUWEAbilityTask_WaitMiniGameCompleted* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAbilityTask_WaitMiniGameCompleted>();
	}
};

// Class UWEDynamicResources.UWEDynamicResourceDataAsset
// 0x0068 (0x00B0 - 0x0048)
class UUWEDynamicResourceDataAsset final : public UUWEActorDataAsset
{
public:
	class FText                                   ResourceNodeName;                                  // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FUWEHarvest>                    Harvests;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  SupportedInteracts;                                // 0x0068(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   RequiredTool;                                      // 0x0088(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDynamicResourceDataAsset">();
	}
	static class UUWEDynamicResourceDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEDynamicResourceDataAsset>();
	}
};

// Class UWEDynamicResources.UWEDynamicResourceHarvestObject
// 0x0048 (0x0070 - 0x0028)
class UUWEDynamicResourceHarvestObject final : public UObject
{
public:
	struct FUWEHarvest                            Harvest;                                           // 0x0028(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDynamicResourceHarvestObject">();
	}
	static class UUWEDynamicResourceHarvestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEDynamicResourceHarvestObject>();
	}
};

// Class UWEDynamicResources.UWEDynamicResourcesSettings
// 0x0010 (0x0048 - 0x0038)
class UUWEDynamicResourcesSettings final : public UDeveloperSettings
{
public:
	TArray<TSoftClassPtr<class UClass>>           DefaultAbilities;                                  // 0x0038(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDynamicResourcesSettings">();
	}
	static class UUWEDynamicResourcesSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEDynamicResourcesSettings>();
	}
};

// Class UWEDynamicResources.UWEDynamicResourcesStatics
// 0x0000 (0x0028 - 0x0028)
class UUWEDynamicResourcesStatics final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDynamicResourcesStatics">();
	}
	static class UUWEDynamicResourcesStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEDynamicResourcesStatics>();
	}
};

// Class UWEDynamicResources.UWEGameplayAbilityTargetActor_MiniGameCompletionResult
// 0x0010 (0x0400 - 0x03F0)
class AUWEGameplayAbilityTargetActor_MiniGameCompletionResult final : public AGameplayAbilityTargetActor
{
public:
	struct FUWEMiniGameCompletion                 CachedCompletionResult;                            // 0x03F0(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEGameplayAbilityTargetActor_MiniGameCompletionResult">();
	}
	static class AUWEGameplayAbilityTargetActor_MiniGameCompletionResult* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEGameplayAbilityTargetActor_MiniGameCompletionResult>();
	}
};

}

