#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEDatabank

#include "Basic.hpp"

#include "UWEAssetRegistry_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class UWEDatabank.UWEDatabankEntry
// 0x0070 (0x00B8 - 0x0048)
class UUWEDatabankEntry final : public UUWEPrimaryDataAssetBase
{
public:
	TArray<class FText>                           Categories;                                        // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   EntryTitle;                                        // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   EntryText;                                         // 0x0068(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              EntryImage;                                        // 0x0078(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEStoryGoalRule*                      UnlockingRequirements;                             // 0x00A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEStoryGoal*                          HideOnStoryGoal;                                   // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompletesInvestigation;                           // 0x00B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool IsUnlocked() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDatabankEntry">();
	}
	static class UUWEDatabankEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEDatabankEntry>();
	}
};

// Class UWEDatabank.UWEDatabankStatics
// 0x0000 (0x0028 - 0x0028)
class UUWEDatabankStatics final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDatabankStatics">();
	}
	static class UUWEDatabankStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEDatabankStatics>();
	}
};

// Class UWEDatabank.UWEDatabankWorldSubsystem
// 0x0000 (0x0030 - 0x0030)
class UUWEDatabankWorldSubsystem final : public UWorldSubsystem
{
public:
	void OnStoryGoalUnlocked(class UUWEStoryGoal* StoryGoalTag, class AActor* ReceivingActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDatabankWorldSubsystem">();
	}
	static class UUWEDatabankWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEDatabankWorldSubsystem>();
	}
};

}

