#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEDoor

#include "Basic.hpp"


namespace SDK::Params
{

// Function UWEDoor.UWEDoorBase.CanUnlock
// 0x0010 (0x0010 - 0x0000)
struct UWEDoorBase_CanUnlock final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class APawn*                                  TriggeringActor;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEDoor.UWEDoorBase.OnOpenedFractionChanged
// 0x0004 (0x0004 - 0x0000)
struct UWEDoorBase_OnOpenedFractionChanged final
{
public:
	float                                         Fraction;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEDoor.UWEDoorBase.OnStoryGoalUnlocked
// 0x0010 (0x0010 - 0x0000)
struct UWEDoorBase_OnStoryGoalUnlocked final
{
public:
	class UUWEStoryGoal*                          lockedStoryGoal;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReceivingActor;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEDoor.UWEDoorBase.Unlock
// 0x0008 (0x0008 - 0x0000)
struct UWEDoorBase_Unlock final
{
public:
	class APawn*                                  TriggeringActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEDoor.UWEDoorBase.UnlockAndOpen
// 0x0008 (0x0008 - 0x0000)
struct UWEDoorBase_UnlockAndOpen final
{
public:
	class APawn*                                  TriggeringActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

