#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEDynamicItems

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum UWEDynamicItems.EUWEDynamicItemSpawnRange
// NumValues: 0x0006
enum class EUWEDynamicItemSpawnRange : uint8
{
	Short                                    = 0,
	Medium                                   = 1,
	Long                                     = 2,
	ExtraLong                                = 3,
	Leviathan                                = 4,
	EUWEDynamicItemSpawnRange_MAX            = 5,
};

// ScriptStruct UWEDynamicItems.UWEDynamicItemInfo
// 0x00B0 (0x00B0 - 0x0000)
struct FUWEDynamicItemInfo final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   Class;                                             // 0x0060(0x0028)(SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Timestamp;                                         // 0x0088(0x0008)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        LifeSpan;                                          // 0x0090(0x0008)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveIfOutOfRange;                               // 0x0098(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasSimulatingPhysics;                             // 0x0099(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 Actor;                                             // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWEDynamicItems.UWEDynamicItemsSave
// 0x0050 (0x0050 - 0x0000)
struct FUWEDynamicItemsSave final
{
public:
	TMap<struct FGuid, struct FUWEDynamicItemInfo> DynamicItems;                                     // 0x0000(0x0050)(SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct UWEDynamicItems.UWEPlaceableProxySpawnedActor
// 0x0010 (0x0010 - 0x0000)
struct FUWEPlaceableProxySpawnedActor final
{
public:
	bool                                          bHasBeenDestroyed;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 SpawnedActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

