#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEEntitlements

#include "Basic.hpp"


namespace SDK
{

// Enum UWEEntitlements.EUWEEntitlementOnlinePlatform
// NumValues: 0x0007
enum class EUWEEntitlementOnlinePlatform : uint8
{
	Epic                                     = 0,
	Xbox                                     = 1,
	PSN                                      = 2,
	Steam                                    = 3,
	Sonar                                    = 4,
	Twitch                                   = 5,
	EUWEEntitlementOnlinePlatform_MAX        = 6,
};

// ScriptStruct UWEEntitlements.UWEEntitlementID
// 0x0018 (0x0018 - 0x0000)
struct FUWEEntitlementID final
{
public:
	EUWEEntitlementOnlinePlatform                 Platform;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 EntitlementID;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWEEntitlements.UWEEntitlementReward
// 0x0020 (0x0020 - 0x0000)
struct FUWEEntitlementReward final
{
public:
	TArray<struct FUWEEntitlementID>              EntitlementIds;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FText>                           RewardNames;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct UWEEntitlements.UWEEntitlementsCacheEntry
// 0x0010 (0x0010 - 0x0000)
struct FUWEEntitlementsCacheEntry final
{
public:
	TArray<class FString>                         EntitlementIds;                                    // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

}

