#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEEventTracker

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NetCore_structs.hpp"


namespace SDK
{

// ScriptStruct UWEEventTracker.UWEEventKey
// 0x0020 (0x0020 - 0x0000)
struct FUWEEventKey final
{
public:
	struct FGameplayTag                           Verb;                                              // 0x0000(0x0008)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPrimaryAssetId                        AssetId;                                           // 0x0010(0x0010)(ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWEEventTracker.UWEEventEntry
// 0x0024 (0x0030 - 0x000C)
struct FUWEEventEntry final : public FFastArraySerializerItem
{
public:
	struct FUWEEventKey                           Key;                                               // 0x000C(0x0020)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x002C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWEEventTracker.UWEEventArray
// 0x0018 (0x0128 - 0x0110)
struct FUWEEventArray final : public FFastArraySerializer
{
public:
	class UUWEEventTrackerComponent*              Owner;                                             // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FUWEEventEntry>                 Entries;                                           // 0x0118(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

}

