#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEEdgeOfWorld

#include "Basic.hpp"

#include "ModelViewViewModel_classes.hpp"
#include "Engine_classes.hpp"
#include "UWEVolumeTracker_structs.hpp"


namespace SDK
{

// Class UWEEdgeOfWorld.UWEEdgeOfWorldHUDViewModel
// 0x0020 (0x0088 - 0x0068)
class UUWEEdgeOfWorldHUDViewModel final : public UMVVMViewModelBase
{
public:
	bool                                          ShouldShowHUD;                                     // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x17];                                      // 0x0069(0x0017)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                WorldContextObject;                                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OOBTagResponseEvent(const struct FGameplayTag& GameplayTag, int32 I);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEEdgeOfWorldHUDViewModel">();
	}
	static class UUWEEdgeOfWorldHUDViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEEdgeOfWorldHUDViewModel>();
	}
};

// Class UWEEdgeOfWorld.UWEEdgeOfWorldSpline
// 0x0028 (0x02D8 - 0x02B0)
class AUWEEdgeOfWorldSpline : public AActor
{
public:
	TMulticastInlineDelegate<void(class APawn* Player)> OnPlayerOverlapBegin;                        // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APawn* Player)> OnPlayerOverlapEnd;                          // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UUWESplineComponent*                    SplineComponent;                                   // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool IsPointInside(const struct FVector& LocationToCheck);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEEdgeOfWorldSpline">();
	}
	static class AUWEEdgeOfWorldSpline* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEEdgeOfWorldSpline>();
	}
};

// Class UWEEdgeOfWorld.UWEEdgeOfWorldStatics
// 0x0000 (0x0028 - 0x0028)
class UUWEEdgeOfWorldStatics final : public UBlueprintFunctionLibrary
{
public:
	static bool IsActorOutOfBounds(const class UObject* WorldContextObject, class AActor* ActorToCheck);
	static bool IsActorWithinEdgeOfWorld(const class UObject* WorldContextObject, class AActor* ActorToCheck);
	static bool IsPointOutOfBounds(const class UObject* WorldContextObject, const struct FVector& Point);
	static bool IsPointWithinEdgeOfWorld(const class UObject* WorldContextObject, const struct FVector& Point);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEEdgeOfWorldStatics">();
	}
	static class UUWEEdgeOfWorldStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEEdgeOfWorldStatics>();
	}
};

// Class UWEEdgeOfWorld.UWEEdgeOfWorldSubsystem
// 0x0008 (0x0038 - 0x0030)
class UUWEEdgeOfWorldSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class AUWEEdgeOfWorldSpline* GetEdgeOfWorld() const;
	bool IsEdgeOfWorldCollisionEnabled() const;
	bool IsPointOutOfBounds(const struct FVector& Point) const;
	bool IsPointWithinEdgeOfWorld(const struct FVector& Point) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEEdgeOfWorldSubsystem">();
	}
	static class UUWEEdgeOfWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEEdgeOfWorldSubsystem>();
	}
};

// Class UWEEdgeOfWorld.UWEOutOfBoundsCheckComponent
// 0x0040 (0x0100 - 0x00C0)
class UUWEOutOfBoundsCheckComponent : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UGameplayEffect>            OutOfBoundsEffect;                                 // 0x00C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         OutOfBoundsPeriodicCheckTime;                      // 0x00D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UCommonActivatableWidget>   OutOfBoundsNotificationWidget;                     // 0x00D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonActivatableWidget>   EdgeOfWorldThanksNotificationWidget;               // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x18];                                      // 0x00E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void NotifyPlayerOutOfBounds();
	void NotifyPlayerThanks();
	void OnPlayerOverlapBegin(class APawn* Player);
	void OnPlayerOverlapEnd(class APawn* Player);
	void OnVolumeChanged(EVolumeType VolumeType);
	void TriggerEdgeOfWorldCollision(class AActor* Instigator);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEOutOfBoundsCheckComponent">();
	}
	static class UUWEOutOfBoundsCheckComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEOutOfBoundsCheckComponent>();
	}
};

}

