#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEEntitlements

#include "Basic.hpp"

#include "CommonUser_structs.hpp"
#include "UWEEntitlements_structs.hpp"
#include "UWEAssetRegistry_classes.hpp"
#include "UWEImGui_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class UWEEntitlements.UWEEntitlementBundleDataAsset
// 0x0020 (0x0068 - 0x0048)
class UUWEEntitlementBundleDataAsset final : public UUWEPrimaryDataAssetBase
{
public:
	TArray<TSoftObjectPtr<class IUWEUnlockableAsset>> UnlockableAssets;                              // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FUWEEntitlementID>              EntitlementIDsForPlatform;                         // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEEntitlementBundleDataAsset">();
	}
	static class UUWEEntitlementBundleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEEntitlementBundleDataAsset>();
	}
};

// Class UWEEntitlements.UWEEntitlementsCache
// 0x0098 (0x00C0 - 0x0028)
class UUWEEntitlementsCache final : public USaveGame
{
public:
	TMap<struct FUniqueNetIdRepl, struct FUWEEntitlementsCacheEntry> PlayerEntries;                  // 0x0028(0x0050)(NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       MostRecentlyCachedUserId;                          // 0x0078(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 SaveSlotName;                                      // 0x00A8(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         LocalPlayerIndex;                                  // 0x00B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEEntitlementsCache">();
	}
	static class UUWEEntitlementsCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEEntitlementsCache>();
	}
};

// Class UWEEntitlements.UWEEntitlementsDiagnostic
// 0x0040 (0x0130 - 0x00F0)
class UUWEEntitlementsDiagnostic final : public UUWEImGuiComponent
{
public:
	uint8                                         Pad_F0[0x40];                                      // 0x00F0(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEEntitlementsDiagnostic">();
	}
	static class UUWEEntitlementsDiagnostic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEEntitlementsDiagnostic>();
	}
};

// Class UWEEntitlements.UWEEntitlementsSubsystem
// 0x00E8 (0x0118 - 0x0030)
class UUWEEntitlementsSubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(bool bWasSuccessful, const TArray<struct FUWEEntitlementReward>& Names)> OnEntitlementsGranted; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0xD8];                                      // 0x0040(0x00D8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void CheckSonarEntitlements();
	void OnSonarLoginCompleted(bool bLoggedIn);
	void OnUserInitialized(const class UCommonUserInfo* UserInfo, bool bSuccess, const class FText& Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext);
	void OnUserPrivilegeChanged(const class UCommonUserInfo* UserInfo, ECommonUserPrivilege Privilege, ECommonUserAvailability OldAvailability, ECommonUserAvailability NewAvailability);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEEntitlementsSubsystem">();
	}
	static class UUWEEntitlementsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEEntitlementsSubsystem>();
	}
};

}

