#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEFrontend

#include "Basic.hpp"

#include "UWECommonUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UWEFrontend_structs.hpp"
#include "CommonUser_structs.hpp"
#include "UWESonar_structs.hpp"


namespace SDK::Params
{

// Function UWEFrontend.UWEFrontendHUD.OnWidgetPopped
// 0x0010 (0x0010 - 0x0000)
struct UWEFrontendHUD_OnWidgetPopped final
{
public:
	EUWEWindowManagerLayer                        LayerId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLast;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class UCommonActivatableWidget>   Class_0;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFrontend.UWEFrontendPSOSubsystem.SoftLoadForPSOPrecache
// 0x0008 (0x0008 - 0x0000)
struct UWEFrontendPSOSubsystem_SoftLoadForPSOPrecache final
{
public:
	const class UPSOPrecacheDataAsset*            LoadedDataAsset;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFrontend.UWEFrontendStatics.DoesSwitchExistOnCommandLine
// 0x0018 (0x0018 - 0x0000)
struct UWEFrontendStatics_DoesSwitchExistOnCommandLine final
{
public:
	class FString                                 Switch;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEFrontend.UWEFrontendStatics.DoUserPrivilegeCheck
// 0x0028 (0x0028 - 0x0000)
struct UWEFrontendStatics_DoUserPrivilegeCheck final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlatformUserId                        PlatformUserId;                                    // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWEUserPrivilege                             UserPrivilege;                                     // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   ErrorMessage;                                      // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bShowErrorMessage;                                 // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowResolveUI;                                    // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0022(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEFrontend.UWEFrontendStatics.GetNumberOfShaderPrecompilesRemaining
// 0x0004 (0x0004 - 0x0000)
struct UWEFrontendStatics_GetNumberOfShaderPrecompilesRemaining final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFrontend.UWEFrontendStatics.GetPrivilegeErrorText
// 0x0018 (0x0018 - 0x0000)
struct UWEFrontendStatics_GetPrivilegeErrorText final
{
public:
	ECommonUserPrivilegeResult                    UserPrivilege;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEFrontend.UWEFrontendStatics.GetShaderCacheStatistics
// 0x000C (0x000C - 0x0000)
struct UWEFrontendStatics_GetShaderCacheStatistics final
{
public:
	struct FUWEShaderCacheStatistics              ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEFrontend.UWEFrontendStatics.IsFirstTimeBoot
// 0x0001 (0x0001 - 0x0000)
struct UWEFrontendStatics_IsFirstTimeBoot final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFrontend.UWEFrontendStatics.PrintCacheStats
// 0x0008 (0x0008 - 0x0000)
struct UWEFrontendStatics_PrintCacheStats final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFrontend.UWEFrontendStatics.ReturnToFrontend
// 0x0038 (0x0038 - 0x0000)
struct UWEFrontendStatics_ReturnToFrontend final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UWorld>                  FrontendLevel;                                     // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWEFrontendMenuReturnReason                  ReturnReason;                                      // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEFrontend.UWEFrontendStatics.ReturnToFrontendByName
// 0x0018 (0x0018 - 0x0000)
struct UWEFrontendStatics_ReturnToFrontendByName final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FrontendLevelName;                                 // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWEFrontendMenuReturnReason                  ReturnReason;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEFrontend.UWEFrontendStatics.ShouldHoldForShaderPrecompilation
// 0x0001 (0x0001 - 0x0000)
struct UWEFrontendStatics_ShouldHoldForShaderPrecompilation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFrontend.UWEPressStartScreenViewModel.Initialize
// 0x0008 (0x0008 - 0x0000)
struct UWEPressStartScreenViewModel_Initialize final
{
public:
	class AUWEFrontendPlayerController*           FrontendPC;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFrontend.UWEStartScreenViewModel.Initialize
// 0x0008 (0x0008 - 0x0000)
struct UWEStartScreenViewModel_Initialize final
{
public:
	class AUWEFrontendPlayerController*           FrontendPC;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFrontend.UWETermsOfServiceViewModel.NeedsToAcceptLegalText
// 0x0001 (0x0001 - 0x0000)
struct UWETermsOfServiceViewModel_NeedsToAcceptLegalText final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

