#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEFarming

#include "Basic.hpp"

#include "UWEFarming_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UWEInventory_structs.hpp"


namespace SDK::Params
{

// Function UWEFarming.UWEFarmingSettings.GetRipeningTime
// 0x000C (0x000C - 0x0000)
struct UWEFarmingSettings_GetRipeningTime final
{
public:
	struct FGameplayTag                           SeedGrowerTierTag;                                 // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWEFarmTrayBase.OnPlantsLoaded
// 0x0010 (0x0010 - 0x0000)
struct UWEFarmTrayBase_OnPlantsLoaded final
{
public:
	TArray<class AActor*>                         Plants;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWEFarmTrayBase.OnRep_GrowingPlants
// 0x0010 (0x0010 - 0x0000)
struct UWEFarmTrayBase_OnRep_GrowingPlants final
{
public:
	TArray<struct FUWEPlantItemActor>             OldGrowingPlants;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWEFarmTrayBase.OnSeedAdded
// 0x0040 (0x0040 - 0x0000)
struct UWEFarmTrayBase_OnSeedAdded final
{
public:
	struct FUWEInventoryItem                      InventoryItem;                                     // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWEFarmTrayBase.OnSeedRemoved
// 0x0040 (0x0040 - 0x0000)
struct UWEFarmTrayBase_OnSeedRemoved final
{
public:
	struct FUWEInventoryItem                      InventoryItem;                                     // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWEMetalFarmBreakableResource.SetMetalData
// 0x0018 (0x0018 - 0x0000)
struct UWEMetalFarmBreakableResource_SetMetalData final
{
public:
	class UUWEResonatableData*                    ResonatableData;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Name_0;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWEPlantGrowerComponent.OnDied
// 0x0010 (0x0010 - 0x0000)
struct UWEPlantGrowerComponent_OnDied final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWEPlantGrowerComponent.OnRep_Growth
// 0x0004 (0x0004 - 0x0000)
struct UWEPlantGrowerComponent_OnRep_Growth final
{
public:
	float                                         OldGrowth;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWEPlantGrowerComponent.OnRep_MaxGrowth
// 0x0004 (0x0004 - 0x0000)
struct UWEPlantGrowerComponent_OnRep_MaxGrowth final
{
public:
	float                                         OldMaxGrowth;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWEPlantGrowerComponent.SetGrowthPercentage
// 0x0004 (0x0004 - 0x0000)
struct UWEPlantGrowerComponent_SetGrowthPercentage final
{
public:
	float                                         Percentage;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWEPlantGrowerComponent.GetGrowthPercentage
// 0x0004 (0x0004 - 0x0000)
struct UWEPlantGrowerComponent_GetGrowthPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWEPlantGrowerComponent.IsFullyGrown
// 0x0001 (0x0001 - 0x0000)
struct UWEPlantGrowerComponent_IsFullyGrown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWERegrowablePlant.OnDied
// 0x0010 (0x0010 - 0x0000)
struct UWERegrowablePlant_OnDied final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWERegrowablePlantData.GetRegrowablePlantDataForActor
// 0x0010 (0x0010 - 0x0000)
struct UWERegrowablePlantData_GetRegrowablePlantDataForActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWERegrowablePlantData*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWERegrowablePlantData.ReplaceDummyPlant
// 0x0010 (0x0010 - 0x0000)
struct UWERegrowablePlantData_ReplaceDummyPlant final
{
public:
	class AStaticMeshActor*                       PlantToReplace;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedData.GetSeedDataForActor
// 0x0010 (0x0010 - 0x0000)
struct UWESeedData_GetSeedDataForActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWESeedData*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.OnDestroySeed
// 0x0008 (0x0008 - 0x0000)
struct UWESeedGrowerComponent_OnDestroySeed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.OnOwnerDied
// 0x0010 (0x0010 - 0x0000)
struct UWESeedGrowerComponent_OnOwnerDied final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.OnPhysicsWakeSeed
// 0x0010 (0x0010 - 0x0000)
struct UWESeedGrowerComponent_OnPhysicsWakeSeed final
{
public:
	class UPrimitiveComponent*                    WakingComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.OnPickedUpSeed
// 0x0008 (0x0008 - 0x0000)
struct UWESeedGrowerComponent_OnPickedUpSeed final
{
public:
	class AActor*                                 PickupActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.SetGrowthRate
// 0x0004 (0x0004 - 0x0000)
struct UWESeedGrowerComponent_SetGrowthRate final
{
public:
	float                                         NewGrowthRate;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.SpawnSeed
// 0x0001 (0x0001 - 0x0000)
struct UWESeedGrowerComponent_SpawnSeed final
{
public:
	bool                                          bSpawnFullyRipened;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.TryDestroySeed
// 0x0001 (0x0001 - 0x0000)
struct UWESeedGrowerComponent_TryDestroySeed final
{
public:
	bool                                          bGrowNewSeed;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.TryDropSeed
// 0x0001 (0x0001 - 0x0000)
struct UWESeedGrowerComponent_TryDropSeed final
{
public:
	bool                                          bGrowNewSeed;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.GetRipenedAmount
// 0x0004 (0x0004 - 0x0000)
struct UWESeedGrowerComponent_GetRipenedAmount final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.GetSeedActor
// 0x0008 (0x0008 - 0x0000)
struct UWESeedGrowerComponent_GetSeedActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.GetTimeRemaining
// 0x0004 (0x0004 - 0x0000)
struct UWESeedGrowerComponent_GetTimeRemaining final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.HasFullyRipenedSeed
// 0x0001 (0x0001 - 0x0000)
struct UWESeedGrowerComponent_HasFullyRipenedSeed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.HasSeed
// 0x0001 (0x0001 - 0x0000)
struct UWESeedGrowerComponent_HasSeed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.IsInFarmTray
// 0x0001 (0x0001 - 0x0000)
struct UWESeedGrowerComponent_IsInFarmTray final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.IsPlantFullyGrown
// 0x0001 (0x0001 - 0x0000)
struct UWESeedGrowerComponent_IsPlantFullyGrown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerComponent.ShowProgress
// 0x0001 (0x0001 - 0x0000)
struct UWESeedGrowerComponent_ShowProgress final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEFarming.UWESeedGrowerReplicatorComponent.MultiCastSeedDropped
// 0x0010 (0x0010 - 0x0000)
struct UWESeedGrowerReplicatorComponent_MultiCastSeedDropped final
{
public:
	class AActor*                                 Seed;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SeedGrowerIndex;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEFarming.UWESeedGrowerReplicatorComponent.MulticastSeedPickedUp
// 0x0010 (0x0010 - 0x0000)
struct UWESeedGrowerReplicatorComponent_MulticastSeedPickedUp final
{
public:
	class AActor*                                 Seed;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SeedGrowerIndex;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEFarming.UWESeedGrowerReplicatorComponent.OnRep_GrowthData
// 0x0010 (0x0010 - 0x0000)
struct UWESeedGrowerReplicatorComponent_OnRep_GrowthData final
{
public:
	TArray<struct FUWEGrowthData>                 OldGrowthData;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

}

