#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEFeedbackSurvey

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "UWESonarAPI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UWEFeedbackSurvey_structs.hpp"
#include "ModelViewViewModel_classes.hpp"


namespace SDK
{

// Class UWEFeedbackSurvey.UWEFeedbackSurveySubsystem
// 0x0028 (0x0058 - 0x0030)
class UUWEFeedbackSurveySubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(bool Success, const TArray<struct FSonarSurveyResponse>& Response)> OnSurveysRequested; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	ESurveyStatus                                 SurveyStatus;                                      // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEFeedbackSurveyViewModel*            SurveyViewModel;                                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void GetActiveSurveys();
	void OnSonarConnectionChanged(bool bIsConnected);
	void SubmitSurveyResponse(const class FString& Title, const class FString& SurveyId, const TArray<struct FSonarSurveyAnswer>& Answers);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEFeedbackSurveySubsystem">();
	}
	static class UUWEFeedbackSurveySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEFeedbackSurveySubsystem>();
	}
};

// Class UWEFeedbackSurvey.UWEFeedbackSurveyViewModel
// 0x0060 (0x00C8 - 0x0068)
class UUWEFeedbackSurveyViewModel final : public UMVVMViewModelBase
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEFeedbackSurveySubsystem*            FeedbackSurveySubsystem;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 DocId;                                             // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 Title;                                             // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              Date;                                              // 0x0098(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FSonarSurveyQuestion>           Questions;                                         // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSonarSurveyResponse>           IncompleteActiveSurveys;                           // 0x00B0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          ShowSurveyButton;                                  // 0x00C0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void GetActiveSurveys();
	bool HasAnyIncompleteSurvey(const TArray<struct FSonarSurveyResponse>& ActiveSurveys);
	bool Initialize(class UObject* WorldContext);
	void OnSurveysRequested(bool bSuccess, const TArray<struct FSonarSurveyResponse>& Response);
	void UpdateCompletedSurveys();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEFeedbackSurveyViewModel">();
	}
	static class UUWEFeedbackSurveyViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEFeedbackSurveyViewModel>();
	}
};

}

