#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEGameModeTypes

#include "Basic.hpp"

#include "UWEGameModeTypes_structs.hpp"


namespace SDK::Params
{

// Function UWEGameModeTypes.UWEGameModeTypeStatics.GetAllGameModeAliases
// 0x0010 (0x0010 - 0x0000)
struct UWEGameModeTypeStatics_GetAllGameModeAliases final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEGameModeTypes.UWEGameModeTypeStatics.GetClassPathAliasFromGameModeAlias
// 0x0020 (0x0020 - 0x0000)
struct UWEGameModeTypeStatics_GetClassPathAliasFromGameModeAlias final
{
public:
	class FString                                 GameModeAlias;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGameModeTypes.UWEGameModeTypeStatics.GetClassPathAliasFromGameModeClass
// 0x0018 (0x0018 - 0x0000)
struct UWEGameModeTypeStatics_GetClassPathAliasFromGameModeClass final
{
public:
	TSubclassOf<class AGameModeBase>              GameModeClass;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGameModeTypes.UWEGameModeTypeStatics.GetGameModeAliasFromAlias
// 0x0020 (0x0020 - 0x0000)
struct UWEGameModeTypeStatics_GetGameModeAliasFromAlias final
{
public:
	class FString                                 GameModeAlias;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGameModeTypes.UWEGameModeTypeStatics.GetGameModeAliasFromGameModeClass
// 0x0018 (0x0018 - 0x0000)
struct UWEGameModeTypeStatics_GetGameModeAliasFromGameModeClass final
{
public:
	TSubclassOf<class AGameModeBase>              GameModeClass;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGameModeTypes.UWEGameModeTypeStatics.GetGameModeType
// 0x0010 (0x0010 - 0x0000)
struct UWEGameModeTypeStatics_GetGameModeType final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameModeAliasAsEnum                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEGameModeTypes.UWEGameModeTypeStatics.GetGameModeTypeFromAlias
// 0x0018 (0x0018 - 0x0000)
struct UWEGameModeTypeStatics_GetGameModeTypeFromAlias final
{
public:
	class FString                                 GameModeAlias;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameModeAliasAsEnum                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

