#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEGlobalActorData

#include "Basic.hpp"

#include "UWEGlobalActorData_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class UWEGlobalActorData.UWEActorDataBroadcastComponent
// 0x0020 (0x00E0 - 0x00C0)
class UUWEActorDataBroadcastComponent : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           DataFieldIdentifier;                               // 0x00C8(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          HasValidValue;                                     // 0x00D0(0x0001)(Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWESaveHandle*                         SaveHandle;                                        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool HasOverriddenValue();

	class AUWEActorDataGroup* GetActorDataGroup() const;
	struct FGameplayTag GetFieldIdentifier() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEActorDataBroadcastComponent">();
	}
	static class UUWEActorDataBroadcastComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEActorDataBroadcastComponent>();
	}
};

// Class UWEGlobalActorData.UWEADGBroadcastComponent_Float
// 0x0008 (0x00E8 - 0x00E0)
class UUWEADGBroadcastComponent_Float final : public UUWEActorDataBroadcastComponent
{
public:
	struct FUWEActorDataChange_Float              CurrentFloatChange;                                // 0x00E0(0x0004)(Net, SaveGame, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRep_CurrentFloatChange();
	void StartFloatChange(const struct FUWEActorDataChange_Float& DataChange);

	float GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEADGBroadcastComponent_Float">();
	}
	static class UUWEADGBroadcastComponent_Float* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEADGBroadcastComponent_Float>();
	}
};

// Class UWEGlobalActorData.UWEADGBroadcastComponent_Bool
// 0x0008 (0x00E8 - 0x00E0)
class UUWEADGBroadcastComponent_Bool final : public UUWEActorDataBroadcastComponent
{
public:
	struct FUWEActorDataChange_Bool               CurrentBoolChange;                                 // 0x00E0(0x0001)(Net, SaveGame, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRep_CurrentBoolChange();
	void StartBoolChange(const struct FUWEActorDataChange_Bool& DataChange);

	bool GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEADGBroadcastComponent_Bool">();
	}
	static class UUWEADGBroadcastComponent_Bool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEADGBroadcastComponent_Bool>();
	}
};

// Class UWEGlobalActorData.UWEActorDataGroup
// 0x0068 (0x0318 - 0x02B0)
class AUWEActorDataGroup : public AActor
{
public:
	class UUWEADGBroadcastComponent_Bool*         EnabledBroadcastComponent;                         // 0x02B0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           Identifier;                                        // 0x02B8(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUWESaveComponent*                      SaveComponent;                                     // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x50];                                     // 0x02C8(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool GetBoolValue(const struct FGameplayTag& FieldIdentifier, bool* Valid) const;
	float GetFloatValue(const struct FGameplayTag& FieldIdentifier, bool* Valid) const;
	struct FGameplayTag GetIdentifier() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEActorDataGroup">();
	}
	static class AUWEActorDataGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEActorDataGroup>();
	}
};

// Class UWEGlobalActorData.UWEActorDataReceiverComponent
// 0x0018 (0x00D8 - 0x00C0)
class UUWEActorDataReceiverComponent : public UActorComponent
{
public:
	struct FGameplayTag                           ActorDataGroupIdentifier;                          // 0x00C0(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x10];                                      // 0x00C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void CheckSubsystemReadyTimer();
	void OnChange(const class AUWEActorDataGroup* Group, const struct FGameplayTag& FieldType);
	void OnDataChanged(const struct FGameplayTag& ActorDataGroupId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEActorDataReceiverComponent">();
	}
	static class UUWEActorDataReceiverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEActorDataReceiverComponent>();
	}
};

// Class UWEGlobalActorData.UWEActorDataStatics
// 0x0000 (0x0028 - 0x0028)
class UUWEActorDataStatics final : public UBlueprintFunctionLibrary
{
public:
	static class AUWEActorDataGroup* GetActorDataGroup(const class UObject* WorldContextObject, const struct FGameplayTag& Identifier);
	static bool GetBoolValue(const struct FGameplayTag& ActorDataGroupId, const struct FGameplayTag& FieldIdentifier, bool* Valid);
	static float GetFloatValue(const struct FGameplayTag& ActorDataGroupId, const struct FGameplayTag& FieldIdentifier, bool* Valid);
	static void SetBoolValue(const struct FGameplayTag& ActorDataGroupId, const struct FGameplayTag& FieldIdentifier, bool Value);
	static void SetFloatValue(const struct FGameplayTag& ActorDataGroupId, const struct FGameplayTag& FieldIdentifier, float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEActorDataStatics">();
	}
	static class UUWEActorDataStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEActorDataStatics>();
	}
};

// Class UWEGlobalActorData.UWEActorDataWorldSubsystem
// 0x0010 (0x0040 - 0x0030)
class UUWEActorDataWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEActorDataWorldSubsystem">();
	}
	static class UUWEActorDataWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEActorDataWorldSubsystem>();
	}
};

}

