#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEGameplayTime

#include "Basic.hpp"


namespace SDK::Params
{

// Function UWEGameplayTime.UWEGameplayTimeComponent.GetUWEElapsedGameplayTime
// 0x0008 (0x0008 - 0x0000)
struct UWEGameplayTimeComponent_GetUWEElapsedGameplayTime final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGameplayTime.UWEGameplayTimeComponent.GetUWEGameplayTimeComponent
// 0x0008 (0x0008 - 0x0000)
struct UWEGameplayTimeComponent_GetUWEGameplayTimeComponent final
{
public:
	class UUWEGameplayTimeComponent*              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGameplayTime.UWEGameplayTimeComponent.AdvanceTime
// 0x0008 (0x0008 - 0x0000)
struct UWEGameplayTimeComponent_AdvanceTime final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGameplayTime.UWEGameplayTimeComponent.GetElapsedGameplayTime
// 0x0008 (0x0008 - 0x0000)
struct UWEGameplayTimeComponent_GetElapsedGameplayTime final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGameplayTime.UWEGameplayTimeComponent.GetGameDurationSeconds
// 0x0004 (0x0004 - 0x0000)
struct UWEGameplayTimeComponent_GetGameDurationSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGameplayTime.UWEGameplayTimeComponent.GetSessionDurationSeconds
// 0x0004 (0x0004 - 0x0000)
struct UWEGameplayTimeComponent_GetSessionDurationSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

