#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEGameConfiguration

#include "Basic.hpp"

#include "UWEGameConfiguration_structs.hpp"


namespace SDK::Params
{

// Function UWEGameConfiguration.UWEGameConfigComponent.OverrideCraftingSettings
// 0x000C (0x000C - 0x0000)
struct UWEGameConfigComponent_OverrideCraftingSettings final
{
public:
	struct FUWECraftingSettings                   InCraftingSettings;                                // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEGameConfiguration.UWEGameConfigComponent.OverrideGameSettings
// 0x002C (0x002C - 0x0000)
struct UWEGameConfigComponent_OverrideGameSettings final
{
public:
	struct FUWEGameConfigSettings                 InGameSettings;                                    // 0x0000(0x002C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEGameConfiguration.UWEGameConfigComponent.GetGameSettings
// 0x002C (0x002C - 0x0000)
struct UWEGameConfigComponent_GetGameSettings final
{
public:
	struct FUWEGameConfigSettings                 ReturnValue;                                       // 0x0000(0x002C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEGameConfiguration.UWEGameConfigurationStatics.GetConfigComponent
// 0x0010 (0x0010 - 0x0000)
struct UWEGameConfigurationStatics_GetConfigComponent final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEGameConfigComponent*                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGameConfiguration.UWEGameConfigurationStatics.GetGlobalOceanSeaLevel
// 0x0004 (0x0004 - 0x0000)
struct UWEGameConfigurationStatics_GetGlobalOceanSeaLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

