#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEGameplayMessageRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum UWEGameplayMessageRuntime.EGameplayMessageMatch
// NumValues: 0x0003
enum class EGameplayMessageMatch : uint8
{
	ExactMatch                               = 0,
	PartialMatch                             = 1,
	EGameplayMessageMatch_MAX                = 2,
};

// ScriptStruct UWEGameplayMessageRuntime.GameplayMessageListenerHandle
// 0x0020 (0x0020 - 0x0000)
struct FGameplayMessageListenerHandle final
{
public:
	TWeakObjectPtr<class UUWEGameplayMessageSubsystem> Subsystem;                                    // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           Channel;                                           // 0x0008(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ID;                                                // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWEGameplayMessageRuntime.GameplayMessageListenerData
// 0x0050 (0x0050 - 0x0000)
struct FGameplayMessageListenerData final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWEGameplayMessageRuntime.GameplayMessageGeneric
// 0x0058 (0x0058 - 0x0000)
struct FGameplayMessageGeneric final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	int32                                         int_0;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 String;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        float_0;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Tags;                                              // 0x0030(0x0020)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWEGameplayMessageRuntime.GameplayMessageString
// 0x0010 (0x0010 - 0x0000)
struct FGameplayMessageString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWEGameplayMessageRuntime.GameplayMessageText
// 0x0010 (0x0010 - 0x0000)
struct FGameplayMessageText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct UWEGameplayMessageRuntime.GameplayMessageLocalizedNotify
// 0x0048 (0x0048 - 0x0000)
struct FGameplayMessageLocalizedNotify final
{
public:
	struct FGameplayTag                           Severity;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PersistIntoMainMenu;                               // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 LocalizedMessageKey;                               // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LocalizedMessageStringTableID;                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           TextArgs;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class FString                                 InputActionPath;                                   // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

