#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEGlobalActorData

#include "Basic.hpp"

#include "UWEGlobalActorData_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function UWEGlobalActorData.UWEActorDataBroadcastComponent.HasOverriddenValue
// 0x0001 (0x0001 - 0x0000)
struct UWEActorDataBroadcastComponent_HasOverriddenValue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEActorDataBroadcastComponent.GetActorDataGroup
// 0x0008 (0x0008 - 0x0000)
struct UWEActorDataBroadcastComponent_GetActorDataGroup final
{
public:
	class AUWEActorDataGroup*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEActorDataBroadcastComponent.GetFieldIdentifier
// 0x0008 (0x0008 - 0x0000)
struct UWEActorDataBroadcastComponent_GetFieldIdentifier final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEADGBroadcastComponent_Float.StartFloatChange
// 0x0004 (0x0004 - 0x0000)
struct UWEADGBroadcastComponent_Float_StartFloatChange final
{
public:
	struct FUWEActorDataChange_Float              DataChange;                                        // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEADGBroadcastComponent_Float.GetValue
// 0x0004 (0x0004 - 0x0000)
struct UWEADGBroadcastComponent_Float_GetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEADGBroadcastComponent_Bool.StartBoolChange
// 0x0001 (0x0001 - 0x0000)
struct UWEADGBroadcastComponent_Bool_StartBoolChange final
{
public:
	struct FUWEActorDataChange_Bool               DataChange;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEADGBroadcastComponent_Bool.GetValue
// 0x0001 (0x0001 - 0x0000)
struct UWEADGBroadcastComponent_Bool_GetValue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEActorDataGroup.GetBoolValue
// 0x000C (0x000C - 0x0000)
struct UWEActorDataGroup_GetBoolValue final
{
public:
	struct FGameplayTag                           FieldIdentifier;                                   // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEGlobalActorData.UWEActorDataGroup.GetFloatValue
// 0x0010 (0x0010 - 0x0000)
struct UWEActorDataGroup_GetFloatValue final
{
public:
	struct FGameplayTag                           FieldIdentifier;                                   // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEActorDataGroup.GetIdentifier
// 0x0008 (0x0008 - 0x0000)
struct UWEActorDataGroup_GetIdentifier final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEActorDataReceiverComponent.OnChange
// 0x0010 (0x0010 - 0x0000)
struct UWEActorDataReceiverComponent_OnChange final
{
public:
	const class AUWEActorDataGroup*               Group;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           FieldType;                                         // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEActorDataReceiverComponent.OnDataChanged
// 0x0008 (0x0008 - 0x0000)
struct UWEActorDataReceiverComponent_OnDataChanged final
{
public:
	struct FGameplayTag                           ActorDataGroupId;                                  // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEActorDataStatics.GetActorDataGroup
// 0x0018 (0x0018 - 0x0000)
struct UWEActorDataStatics_GetActorDataGroup final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Identifier;                                        // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AUWEActorDataGroup*                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEActorDataStatics.GetBoolValue
// 0x0014 (0x0014 - 0x0000)
struct UWEActorDataStatics_GetBoolValue final
{
public:
	struct FGameplayTag                           ActorDataGroupId;                                  // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           FieldIdentifier;                                   // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Valid;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEGlobalActorData.UWEActorDataStatics.GetFloatValue
// 0x0018 (0x0018 - 0x0000)
struct UWEActorDataStatics_GetFloatValue final
{
public:
	struct FGameplayTag                           ActorDataGroupId;                                  // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           FieldIdentifier;                                   // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Valid;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEGlobalActorData.UWEActorDataStatics.SetBoolValue
// 0x0014 (0x0014 - 0x0000)
struct UWEActorDataStatics_SetBoolValue final
{
public:
	struct FGameplayTag                           ActorDataGroupId;                                  // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           FieldIdentifier;                                   // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEGlobalActorData.UWEActorDataStatics.SetFloatValue
// 0x0014 (0x0014 - 0x0000)
struct UWEActorDataStatics_SetFloatValue final
{
public:
	struct FGameplayTag                           ActorDataGroupId;                                  // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           FieldIdentifier;                                   // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

