#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEGameplay

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct UWEGameplay.ActiveDynamicForceFeedback
// 0x0010 (0x0010 - 0x0000)
struct FActiveDynamicForceFeedback final
{
public:
	class UUWEDynamicForceFeedbackEffect*         DynamicEffect;                                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWEGameplay.DamageSource
// 0x0018 (0x0018 - 0x0000)
struct FDamageSource final
{
public:
	class FString                                 InstigatorName;                                    // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DamageType;                                        // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWEGameplay.UWEPlayerSaveDataStub
// 0x0060 (0x0060 - 0x0000)
struct FUWEPlayerSaveDataStub final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

