#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEGameplayTime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class UWEGameplayTime.UWEGameplayTimeComponent
// 0x0048 (0x0108 - 0x00C0)
class UUWEGameplayTimeComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         GameDurationSeconds;                               // 0x00C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SessionDurationSeconds;                            // 0x00CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              GameStartedTimestamp;                              // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              SessionStartedTimestamp;                           // 0x00D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UpdateSessionInterval;                             // 0x00E0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWESaveHandle*                         SaveHandle;                                        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                        ServerWorldTimeOffset;                             // 0x00F0(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                        SavedElapsedGameplayTime;                          // 0x00F8(0x0008)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static double GetUWEElapsedGameplayTime();
	static class UUWEGameplayTimeComponent* GetUWEGameplayTimeComponent();

	void AdvanceTime(double DeltaTime);

	double GetElapsedGameplayTime() const;
	float GetGameDurationSeconds() const;
	float GetSessionDurationSeconds() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEGameplayTimeComponent">();
	}
	static class UUWEGameplayTimeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEGameplayTimeComponent>();
	}
};

}

