#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEInGameCurrency

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UWEInGameCurrency_structs.hpp"


namespace SDK::Params
{

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.AddCurrency
// 0x0018 (0x0018 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_AddCurrency final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Source;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.AddPurchase
// 0x0018 (0x0018 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_AddPurchase final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Purchase;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Cost;                                              // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.OnRep_Transactions
// 0x0010 (0x0010 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_OnRep_Transactions final
{
public:
	TArray<struct FCurrencyTransaction>           PriorTransactions;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.RegisterCurrencyListener
// 0x0018 (0x0018 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_RegisterCurrencyListener final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGameplayTag& CurrencyTag, const struct FCurrencyData& OldData, const struct FCurrencyData& NewData)> OnCurrencyChanged; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.RegisterCurrencyPurchaseListener
// 0x0018 (0x0018 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_RegisterCurrencyPurchaseListener final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGameplayTag& CurrencyTag, TSoftObjectPtr<class UObject> Purchase, int32 Cost)> OnPurchaseMade; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.Server_AddCurrency
// 0x0018 (0x0018 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_Server_AddCurrency final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Source;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.Server_AddPurchase
// 0x0018 (0x0018 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_Server_AddPurchase final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Purchase;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Cost;                                              // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.UnregisterCurrencyListener
// 0x0018 (0x0018 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_UnregisterCurrencyListener final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGameplayTag& CurrencyTag, const struct FCurrencyData& OldData, const struct FCurrencyData& NewData)> OnCurrencyChanged; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.UnregisterCurrencyPurchaseListener
// 0x0018 (0x0018 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_UnregisterCurrencyPurchaseListener final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGameplayTag& CurrencyTag, TSoftObjectPtr<class UObject> Purchase, int32 Cost)> OnPurchaseMade; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.CanAffordPurchase
// 0x0010 (0x0010 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_CanAffordPurchase final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.GetAllCurrencyTags
// 0x0010 (0x0010 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_GetAllCurrencyTags final
{
public:
	TArray<struct FGameplayTag>                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.GetAllValidPurchases
// 0x0018 (0x0018 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_GetAllValidPurchases final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UObject>>         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.GetCurrencyData
// 0x0018 (0x0018 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_GetCurrencyData final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCurrencyData                          ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.HasIncomeFromSource
// 0x0018 (0x0018 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_HasIncomeFromSource final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          Source;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInGameCurrency.UWEInGameCurrencyPlayerStateComponent.HasPurchaseForCurrency
// 0x0018 (0x0018 - 0x0000)
struct UWEInGameCurrencyPlayerStateComponent_HasPurchaseForCurrency final
{
public:
	struct FGameplayTag                           CurrencyTag;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          Purchase;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

