#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEInventory

#include "Basic.hpp"

#include "UWEInterfaces_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UWEEventTracker_structs.hpp"
#include "UWEInventory_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function UWEInventory.UWEBaseItem.GetAttachTarget
// 0x0010 (0x0010 - 0x0000)
struct UWEBaseItem_GetAttachTarget final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.AddExternalInfluence
// 0x0020 (0x0020 - 0x0000)
struct UWEBaseItem_AddExternalInfluence final
{
public:
	EUWEMovementComponentInfluenceType            InfluenceType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                Value;                                             // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.AddImpulse
// 0x0020 (0x0020 - 0x0000)
struct UWEBaseItem_AddImpulse final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Normalized;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEBaseItem.AddImpulseAway
// 0x0010 (0x0010 - 0x0000)
struct UWEBaseItem_AddImpulseAway final
{
public:
	const class AActor*                           FromActor;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnImpulse;                                      // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEBaseItem.AddImpulseAwayRandom
// 0x0010 (0x0010 - 0x0000)
struct UWEBaseItem_AddImpulseAwayRandom final
{
public:
	const class AActor*                           FromActor;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnImpulse;                                      // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEBaseItem.BPOnEquipped
// 0x0001 (0x0001 - 0x0000)
struct UWEBaseItem_BPOnEquipped final
{
public:
	bool                                          bFirstEquip;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.BPOnEquipVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct UWEBaseItem_BPOnEquipVisibilityChanged final
{
public:
	bool                                          bNewVisible;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.BPOnHolstered
// 0x0008 (0x0008 - 0x0000)
struct UWEBaseItem_BPOnHolstered final
{
public:
	const class AActor*                           OldEquippedByActor;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.BPOnUnequipped
// 0x0008 (0x0008 - 0x0000)
struct UWEBaseItem_BPOnUnequipped final
{
public:
	const class AActor*                           OldEquippedByActor;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.ExecuteItemGameplayCue_NonReplicated
// 0x0008 (0x0008 - 0x0000)
struct UWEBaseItem_ExecuteItemGameplayCue_NonReplicated final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.GetDefaultCueParams
// 0x00D8 (0x00D8 - 0x0000)
struct UWEBaseItem_GetDefaultCueParams final
{
public:
	struct FGameplayCueParameters                 ReturnValue;                                       // 0x0000(0x00D8)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.GetEquippedMesh
// 0x0008 (0x0008 - 0x0000)
struct UWEBaseItem_GetEquippedMesh final
{
public:
	class UMeshComponent*                         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.NetMulticast_SetCollisionResponse
// 0x0002 (0x0002 - 0x0000)
struct UWEBaseItem_NetMulticast_SetCollisionResponse final
{
public:
	ECollisionChannel                             Channel;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionResponse                            NewResponse;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.NetMulticast_SetPhysicsEnabled
// 0x0002 (0x0002 - 0x0000)
struct UWEBaseItem_NetMulticast_SetPhysicsEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceToSleep;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.OnPhysicsSleep
// 0x0010 (0x0010 - 0x0000)
struct UWEBaseItem_OnPhysicsSleep final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.OnPhysicsWake
// 0x0010 (0x0010 - 0x0000)
struct UWEBaseItem_OnPhysicsWake final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.SetReplicatedCollisionEnabled
// 0x0001 (0x0001 - 0x0000)
struct UWEBaseItem_SetReplicatedCollisionEnabled final
{
public:
	bool                                          bNewCollisionEnabled;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.SetReplicatedSimulatePhysics
// 0x0001 (0x0001 - 0x0000)
struct UWEBaseItem_SetReplicatedSimulatePhysics final
{
public:
	bool                                          bNewSimulatePhysics;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.SimulateMagnetism
// 0x0008 (0x0008 - 0x0000)
struct UWEBaseItem_SimulateMagnetism final
{
public:
	class AActor*                                 ToActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.ThrowForward
// 0x0028 (0x0028 - 0x0000)
struct UWEBaseItem_ThrowForward final
{
public:
	class AActor*                                 ThrowingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEBaseItem.GetCharacterMesh
// 0x0008 (0x0008 - 0x0000)
struct UWEBaseItem_GetCharacterMesh final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.HasMagnet
// 0x0001 (0x0001 - 0x0000)
struct UWEBaseItem_HasMagnet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.IsEquipped
// 0x0001 (0x0001 - 0x0000)
struct UWEBaseItem_IsEquipped final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.IsEquippedByLocalPawn
// 0x0001 (0x0001 - 0x0000)
struct UWEBaseItem_IsEquippedByLocalPawn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseItem.IsOwned
// 0x0001 (0x0001 - 0x0000)
struct UWEBaseItem_IsOwned final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseEquippable.GetSlotSocketName
// 0x0008 (0x0008 - 0x0000)
struct UWEBaseEquippable_GetSlotSocketName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseEquippable.GetEquippableItemType
// 0x0008 (0x0008 - 0x0000)
struct UWEBaseEquippable_GetEquippableItemType final
{
public:
	class UUWEItemType*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseEquippable.GetPlayerAbilitySystemComponent
// 0x0008 (0x0008 - 0x0000)
struct UWEBaseEquippable_GetPlayerAbilitySystemComponent final
{
public:
	class UUWEAbilitySystemComponent*             ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseEquippable.IsHiddenInToolbar
// 0x0001 (0x0001 - 0x0000)
struct UWEBaseEquippable_IsHiddenInToolbar final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEBaseEquippable.IsLocallyEquipped
// 0x0001 (0x0001 - 0x0000)
struct UWEBaseEquippable_IsLocallyEquipped final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWECommunalInventorySubsystem.RegisterInventory
// 0x0008 (0x0008 - 0x0000)
struct UWECommunalInventorySubsystem_RegisterInventory final
{
public:
	class UUWEInventoryComponent*                 InventoryComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWECommunalInventorySubsystem.UnregisterInventory
// 0x0008 (0x0008 - 0x0000)
struct UWECommunalInventorySubsystem_UnregisterInventory final
{
public:
	class UUWEInventoryComponent*                 InventoryComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.IsItemTypeTool
// 0x0010 (0x0010 - 0x0000)
struct UWEEquipmentComponent_IsItemTypeTool final
{
public:
	class UUWEItemType*                           ItemType;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEEquipmentComponent.CanEquipFromInventory
// 0x0028 (0x0028 - 0x0000)
struct UWEEquipmentComponent_CanEquipFromInventory final
{
public:
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Reason;                                            // 0x0010(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEInventoryComponent*                 Inventory;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEEquipmentComponent.CanEquipFromWorld
// 0x0018 (0x0018 - 0x0000)
struct UWEEquipmentComponent_CanEquipFromWorld final
{
public:
	class AUWEBaseItem*                           Equippable;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Reason;                                            // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEEquipmentComponent.GetEquippableInSlot
// 0x0010 (0x0010 - 0x0000)
struct UWEEquipmentComponent_GetEquippableInSlot final
{
public:
	struct FGameplayTag                           SlotTag;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AUWEBaseItem*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.GetEquippedTool
// 0x0008 (0x0008 - 0x0000)
struct UWEEquipmentComponent_GetEquippedTool final
{
public:
	class AUWEBaseItem*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.GetOwnerInventory
// 0x0008 (0x0008 - 0x0000)
struct UWEEquipmentComponent_GetOwnerInventory final
{
public:
	class UUWEInventoryComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.GetSocketName
// 0x0010 (0x0010 - 0x0000)
struct UWEEquipmentComponent_GetSocketName final
{
public:
	struct FGameplayTag                           SlotTag;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.HasItemByType
// 0x0010 (0x0010 - 0x0000)
struct UWEEquipmentComponent_HasItemByType final
{
public:
	class UUWEItemType*                           ItemType;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEEquipmentComponent.OnEventVerbEquip
// 0x0028 (0x0028 - 0x0000)
struct UWEEquipmentComponent_OnEventVerbEquip final
{
public:
	struct FUWEEventKey                           EventKey;                                          // 0x0000(0x0020)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OldValue;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewValue;                                          // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.OnItemDestroyed
// 0x0008 (0x0008 - 0x0000)
struct UWEEquipmentComponent_OnItemDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.RemoveItemByType
// 0x0010 (0x0010 - 0x0000)
struct UWEEquipmentComponent_RemoveItemByType final
{
public:
	class UUWEItemType*                           ItemType;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEEquipmentComponent.ServerEquip
// 0x0008 (0x0008 - 0x0000)
struct UWEEquipmentComponent_ServerEquip final
{
public:
	class AUWEBaseItem*                           Equippable;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.ServerEquipFromInventory
// 0x0018 (0x0018 - 0x0000)
struct UWEEquipmentComponent_ServerEquipFromInventory final
{
public:
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEInventoryComponent*                 Inventory;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.ServerReloadTool
// 0x0018 (0x0018 - 0x0000)
struct UWEEquipmentComponent_ServerReloadTool final
{
public:
	class AUWEBaseEquippable*                     Tool;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0008(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.ServerUnequip
// 0x0008 (0x0008 - 0x0000)
struct UWEEquipmentComponent_ServerUnequip final
{
public:
	class AUWEBaseItem*                           Equippable;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.ServerUnequipAndDrop
// 0x0008 (0x0008 - 0x0000)
struct UWEEquipmentComponent_ServerUnequipAndDrop final
{
public:
	class AUWEBaseItem*                           Equippable;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.ServerUnequipToInventory
// 0x0010 (0x0010 - 0x0000)
struct UWEEquipmentComponent_ServerUnequipToInventory final
{
public:
	class AUWEBaseItem*                           Equippable;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNotify;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEEquipmentComponent.ServerUnloadTool
// 0x0008 (0x0008 - 0x0000)
struct UWEEquipmentComponent_ServerUnloadTool final
{
public:
	class AUWEBaseEquippable*                     Tool;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.SetEquipmentHidden
// 0x0001 (0x0001 - 0x0000)
struct UWEEquipmentComponent_SetEquipmentHidden final
{
public:
	bool                                          bHidden;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.GetAttachComponent
// 0x0008 (0x0008 - 0x0000)
struct UWEEquipmentComponent_GetAttachComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEEquipmentComponent.GetOwnerToolbar
// 0x0008 (0x0008 - 0x0000)
struct UWEEquipmentComponent_GetOwnerToolbar final
{
public:
	class UUWEToolbarComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEItemType.GetDefaultCapturedAttributes
// 0x0050 (0x0050 - 0x0000)
struct UWEItemType_GetDefaultCapturedAttributes final
{
public:
	TMap<struct FGameplayTag, class FString>      ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEItemType.GetThumbnailFromAttributeMap
// 0x0058 (0x0058 - 0x0000)
struct UWEItemType_GetThumbnailFromAttributeMap final
{
public:
	TMap<struct FGameplayTag, class FString>      Map;                                               // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	class UTexture2D*                             ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEItemType.GetHeldActorClassLoaded
// 0x0008 (0x0008 - 0x0000)
struct UWEItemType_GetHeldActorClassLoaded final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEItemType.GetItemAnimEquippedAnimBlueprintClass
// 0x0008 (0x0008 - 0x0000)
struct UWEItemType_GetItemAnimEquippedAnimBlueprintClass final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEItemType.GetPreviewMeshData
// 0x0080 (0x0080 - 0x0000)
struct UWEItemType_GetPreviewMeshData final
{
public:
	struct FUWEFabricationPreviewMeshData         ReturnValue;                                       // 0x0000(0x0080)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEItemType.GetTunableData
// 0x0010 (0x0010 - 0x0000)
struct UWEItemType_GetTunableData final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFound;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEItemType.IsEquippable
// 0x0001 (0x0001 - 0x0000)
struct UWEItemType_IsEquippable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEItemType.IsEquippment
// 0x0001 (0x0001 - 0x0000)
struct UWEItemType_IsEquippment final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.AddAsMuchAsPossibleToInventory
// 0x0010 (0x0010 - 0x0000)
struct UWEInventoryComponent_AddAsMuchAsPossibleToInventory final
{
public:
	class UUWEItemType*                           ItemType;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.AddItemByTypeToInventory
// 0x0018 (0x0018 - 0x0000)
struct UWEInventoryComponent_AddItemByTypeToInventory final
{
public:
	int32                                         InInventoryId;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEItemType*                           ItemType;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.AddItemTypeToInventory
// 0x0010 (0x0010 - 0x0000)
struct UWEInventoryComponent_AddItemTypeToInventory final
{
public:
	class UUWEItemType*                           ItemType;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.CanPickUpActor
// 0x0118 (0x0118 - 0x0000)
struct UWEInventoryComponent_CanPickUpActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             HitResult;                                         // 0x0008(0x0100)(ConstParm, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Reason;                                            // 0x0108(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0110(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.CanPickupItemTypeWithQuantity
// 0x0018 (0x0018 - 0x0000)
struct UWEInventoryComponent_CanPickupItemTypeWithQuantity final
{
public:
	class UUWEItemType*                           ItemType;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Reason;                                            // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.DropItem
// 0x0018 (0x0018 - 0x0000)
struct UWEInventoryComponent_DropItem final
{
public:
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEInventoryComponent*                 FromInventory;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.InteractWithInventoryItem
// 0x0018 (0x0018 - 0x0000)
struct UWEInventoryComponent_InteractWithInventoryItem final
{
public:
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEInventoryComponent*                 FromInventory;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.InteractWithInventoryItemIsEnabled
// 0x0030 (0x0030 - 0x0000)
struct UWEInventoryComponent_InteractWithInventoryItemIsEnabled final
{
public:
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   OutNotInteractableReason;                          // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	class AActor*                                 Owner;                                             // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.ItemDroppedMulticastNotify
// 0x0008 (0x0008 - 0x0000)
struct UWEInventoryComponent_ItemDroppedMulticastNotify final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.ItemPickedUpClientNotify
// 0x0008 (0x0008 - 0x0000)
struct UWEInventoryComponent_ItemPickedUpClientNotify final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.ItemPickedUpFailedClientNotify
// 0x0008 (0x0008 - 0x0000)
struct UWEInventoryComponent_ItemPickedUpFailedClientNotify final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.MoveAllInventoryItems
// 0x0010 (0x0010 - 0x0000)
struct UWEInventoryComponent_MoveAllInventoryItems final
{
public:
	class UUWEInventoryComponent*                 ToInventory;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEInventoryComponent*                 FromInventory;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.MoveInventoryItem
// 0x0020 (0x0020 - 0x0000)
struct UWEInventoryComponent_MoveInventoryItem final
{
public:
	class UUWEInventoryComponent*                 ToInventory;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0008(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEInventoryComponent*                 FromInventory;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.MoveItemBetweenInventories
// 0x0018 (0x0018 - 0x0000)
struct UWEInventoryComponent_MoveItemBetweenInventories final
{
public:
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FromInventoryId;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ToInventoryId;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.OnInventoryItemAttributeChanged
// 0x0048 (0x0048 - 0x0000)
struct UWEInventoryComponent_OnInventoryItemAttributeChanged final
{
public:
	int32                                         InInventoryId;                                     // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWEInventoryItem                      Item;                                              // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.OnInventoryUpdated
// 0x0004 (0x0004 - 0x0000)
struct UWEInventoryComponent_OnInventoryUpdated final
{
public:
	int32                                         InInventoryId;                                     // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.OnItemAddedToInventory
// 0x0048 (0x0048 - 0x0000)
struct UWEInventoryComponent_OnItemAddedToInventory final
{
public:
	int32                                         InInventoryId;                                     // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWEInventoryItem                      Item;                                              // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.OnItemRemovedFromInventory
// 0x0048 (0x0048 - 0x0000)
struct UWEInventoryComponent_OnItemRemovedFromInventory final
{
public:
	int32                                         InInventoryId;                                     // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWEInventoryItem                      Item;                                              // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.Pickup
// 0x0010 (0x0010 - 0x0000)
struct UWEInventoryComponent_Pickup final
{
public:
	class AActor*                                 ActorToPickup;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNotify;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.PickupAndGetID
// 0x0020 (0x0020 - 0x0000)
struct UWEInventoryComponent_PickupAndGetID final
{
public:
	class AActor*                                 ActorToPickup;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWEInventoryItemId                    OutItemID;                                         // 0x0008(0x0010)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNotify;                                           // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.PickupItem
// 0x0010 (0x0010 - 0x0000)
struct UWEInventoryComponent_PickupItem final
{
public:
	class AActor*                                 ActorToPickup;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanOverflow;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.PickupItemAndGetID
// 0x0020 (0x0020 - 0x0000)
struct UWEInventoryComponent_PickupItemAndGetID final
{
public:
	class AActor*                                 ActorToPickup;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWEInventoryItemId                    OutItemID;                                         // 0x0008(0x0010)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanOverflow;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.RemoveItem
// 0x0014 (0x0014 - 0x0000)
struct UWEInventoryComponent_RemoveItem final
{
public:
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.RemoveItemByType
// 0x0010 (0x0010 - 0x0000)
struct UWEInventoryComponent_RemoveItemByType final
{
public:
	class UUWEItemType*                           ItemType;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.RemoveItemFromInventory
// 0x0014 (0x0014 - 0x0000)
struct UWEInventoryComponent_RemoveItemFromInventory final
{
public:
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FromInventoryId;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.ServerDropItem
// 0x0020 (0x0020 - 0x0000)
struct UWEInventoryComponent_ServerDropItem final
{
public:
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEInventoryComponent*                 FromInventory;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.SetAllowAddingItems
// 0x0001 (0x0001 - 0x0000)
struct UWEInventoryComponent_SetAllowAddingItems final
{
public:
	bool                                          bAllowAddingItems;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.SetMaxItems
// 0x0004 (0x0004 - 0x0000)
struct UWEInventoryComponent_SetMaxItems final
{
public:
	int32                                         NewMaxItems;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.TryGetItemAtIndex
// 0x0050 (0x0050 - 0x0000)
struct UWEInventoryComponent_TryGetItemAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWEInventoryItem                      Item;                                              // 0x0008(0x0040)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.CanDropItem
// 0x0028 (0x0028 - 0x0000)
struct UWEInventoryComponent_CanDropItem final
{
public:
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Reason;                                            // 0x0010(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UUWEInventoryComponent*           InitiatingInventory;                               // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.FindItemsByGameplayTag
// 0x0030 (0x0030 - 0x0000)
struct UWEInventoryComponent_FindItemsByGameplayTag final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0020)(ConstParm, Parm, NativeAccessSpecifierPublic)
	TArray<struct FUWEInventoryItem>              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.GetIndexOfItem
// 0x0048 (0x0048 - 0x0000)
struct UWEInventoryComponent_GetIndexOfItem final
{
public:
	struct FUWEInventoryItem                      InventoryItem;                                     // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.GetInventorySubsystem
// 0x0008 (0x0008 - 0x0000)
struct UWEInventoryComponent_GetInventorySubsystem final
{
public:
	class UUWEInventorySubsystem*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.GetItem
// 0x0050 (0x0050 - 0x0000)
struct UWEInventoryComponent_GetItem final
{
public:
	struct FUWEInventoryItemId                    ItemId;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWEInventoryItem                      ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.GetItemCountByType
// 0x0010 (0x0010 - 0x0000)
struct UWEInventoryComponent_GetItemCountByType final
{
public:
	class UUWEItemType*                           ItemType;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEInventory.UWEInventoryComponent.GetItemIds
// 0x0010 (0x0010 - 0x0000)
struct UWEInventoryComponent_GetItemIds final
{
public:
	TArray<struct FUWEInventoryItemId>            ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.GetItems
// 0x0010 (0x0010 - 0x0000)
struct UWEInventoryComponent_GetItems final
{
public:
	TArray<struct FUWEInventoryItem>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.GetItemsByItemType
// 0x0018 (0x0018 - 0x0000)
struct UWEInventoryComponent_GetItemsByItemType final
{
public:
	const class UUWEItemType*                     ItemType;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FUWEInventoryItem>              ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEInventory.UWEInventoryComponent.GetItemsByType
// 0x0020 (0x0020 - 0x0000)
struct UWEInventoryComponent_GetItemsByType final
{
public:
