#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWELadder

#include "Basic.hpp"


namespace SDK
{

// Enum UWELadder.EUWEClimbDirection
// NumValues: 0x0003
enum class EUWEClimbDirection : uint8
{
	Up                                       = 0,
	Down                                     = 1,
	EUWEClimbDirection_MAX                   = 2,
};

// ScriptStruct UWELadder.UWELadderClimbData
// 0x0018 (0x0018 - 0x0000)
struct FUWELadderClimbData final
{
public:
	TWeakObjectPtr<class UUWELadderComponent>     LadderComponent;                                   // 0x0000(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  ClimbingActor;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWEClimbDirection                            Direction;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Speed;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

