#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWELeviathan

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class UWELeviathan.UWELeviathanSubsystem
// 0x0030 (0x0070 - 0x0040)
class UUWELeviathanSubsystem final : public UTickableWorldSubsystem
{
public:
	TSoftClassPtr<class UClass>                   LeviathanClass;                                    // 0x0040(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeviathanMoveDistance;                             // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class AActor* OnTriggerAreaTouched(class AUWELeviathanTrigger* Trigger, const TSoftClassPtr<class UClass>& InLeviathanClass);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWELeviathanSubsystem">();
	}
	static class UUWELeviathanSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWELeviathanSubsystem>();
	}
};

// Class UWELeviathan.UWELeviathanTrigger
// 0x0060 (0x0310 - 0x02B0)
class AUWELeviathanTrigger final : public AActor
{
public:
	class USceneComponent*                        SpawnPoint;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USphereComponent*                       Trigger;                                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   TriggeringClass;                                   // 0x02C0(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   LeviathanClass;                                    // 0x02E8(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnLeviathanMoved(class AActor* MovedLeviathan);
	void OnPlayerEntered();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWELeviathanTrigger">();
	}
	static class AUWELeviathanTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWELeviathanTrigger>();
	}
};

}

