#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWELock

#include "Basic.hpp"

#include "UWELock_structs.hpp"


namespace SDK::Params
{

// Function UWELock.UWEBaseLockComponent.TryUnlock
// 0x0010 (0x0010 - 0x0000)
struct UWEBaseLockComponent_TryUnlock final
{
public:
	class APawn*                                  ForPlayer;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWELock.UWEBaseLockComponent.CanUnlock
// 0x0020 (0x0020 - 0x0000)
struct UWEBaseLockComponent_CanUnlock final
{
public:
	struct FUWELockFailedReason                   Reason;                                            // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	class APawn*                                  ForPlayer;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWELock.UWEBaseLockComponent.IsLocked
// 0x0001 (0x0001 - 0x0000)
struct UWEBaseLockComponent_IsLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWELock.UWEGenericLockComponent.OnStoryGoalUnlocked
// 0x0010 (0x0010 - 0x0000)
struct UWEGenericLockComponent_OnStoryGoalUnlocked final
{
public:
	class UUWEStoryGoal*                          StoryGoal;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReceivingActor;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWELock.UWEGenericLockComponent.PlayLockSound
// 0x0001 (0x0001 - 0x0000)
struct UWEGenericLockComponent_PlayLockSound final
{
public:
	bool                                          bIsLocked;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

