#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWELock

#include "Basic.hpp"

#include "UWELock_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class UWELock.UWEBaseLockComponent
// 0x0038 (0x00F8 - 0x00C0)
class UUWEBaseLockComponent : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(bool IsLocked)> OnLockChanged;                                     // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          WasLoaded;                                         // 0x00D8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUWELockState                                 LockState;                                         // 0x00D9(0x0001)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, SaveGame, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEDialogueStoryEvent*                 UnlockedDialogue;                                  // 0x00E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEDialogueStoryEvent*                 UnlockFailedDialogue;                              // 0x00E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWESaveHandle*                         SaveHandle;                                        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Lock();
	void OnRep_LockState();
	void OnRep_WasLoaded();
	bool TryUnlock(class APawn* ForPlayer);

	bool CanUnlock(struct FUWELockFailedReason* Reason, class APawn* ForPlayer) const;
	bool IsLocked() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEBaseLockComponent">();
	}
	static class UUWEBaseLockComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEBaseLockComponent>();
	}
};

// Class UWELock.UWEGenericLockComponent
// 0x0078 (0x0170 - 0x00F8)
class UUWEGenericLockComponent final : public UUWEBaseLockComponent
{
public:
	TArray<TSoftObjectPtr<class UUWEStoryGoal>>   StoryGoalsToUnlock;                                // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UUWEStoryGoal>>   StoryGoalsToLock;                                  // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>              LockSound;                                         // 0x0118(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFMODEvent>              UnlockSound;                                       // 0x0140(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ShouldUnlockAutomatically;                         // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnStoryGoalUnlocked(class UUWEStoryGoal* StoryGoal, class AActor* ReceivingActor);
	void PlayLockSound(bool bIsLocked);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEGenericLockComponent">();
	}
	static class UUWEGenericLockComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEGenericLockComponent>();
	}
};

}

