#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWELighting

#include "Basic.hpp"

#include "UWELighting_structs.hpp"


namespace SDK::Params
{

// Function UWELighting.UWELightingManagerSubsystem.Get
// 0x0010 (0x0010 - 0x0000)
struct UWELightingManagerSubsystem_Get final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWELightingManagerSubsystem*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWELighting.UWELightingManagerSubsystem.GetMaxNumShadowCastingLightsByScalability
// 0x0004 (0x0004 - 0x0000)
struct UWELightingManagerSubsystem_GetMaxNumShadowCastingLightsByScalability final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWELighting.UWELightingManagerSubsystem.GetUpdateFrequencyDelta
// 0x0004 (0x0004 - 0x0000)
struct UWELightingManagerSubsystem_GetUpdateFrequencyDelta final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWELighting.UWELightingManagerSubsystem.SetUpdateFrequency
// 0x0004 (0x0004 - 0x0000)
struct UWELightingManagerSubsystem_SetUpdateFrequency final
{
public:
	float                                         NewUpdateFrequency;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWELighting.UWELightingManagerSubsystem.CollectTopLights
// 0x0010 (0x0010 - 0x0000)
struct UWELightingManagerSubsystem_CollectTopLights final
{
public:
	TArray<struct FLightDebugRowData>             OutDebugRows;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

}

