#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEMercuna

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "Mercuna_classes.hpp"


namespace SDK
{

// Class UWEMercuna.UWEMercunaNavExclusionVolumeComponent
// 0x0050 (0x0110 - 0x00C0)
class UUWEMercunaNavExclusionVolumeComponent final : public UActorComponent
{
public:
	bool                                          RebuildAutomatically;                              // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoundCalculationIncludeNonColliding;               // 0x00C1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoundCalculationIncludeFromChildActors;            // 0x00C2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3[0x3D];                                      // 0x00C3(0x003D)(Fixing Size After Last Property [ Dumper-8 ])
	class AMercunaNavExclusionVolume*             ExclusionVolumeActor;                              // 0x0100(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void CreateVolume();
	void DestroyVolume();
	void RebuildNavigationData();

	class AMercunaNavExclusionVolume* GetExclusionVolumeActor() const;
	bool IsVolumeCreated() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEMercunaNavExclusionVolumeComponent">();
	}
	static class UUWEMercunaNavExclusionVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEMercunaNavExclusionVolumeComponent>();
	}
};

// Class UWEMercuna.UWEMercunaSubsystem
// 0x0000 (0x0030 - 0x0030)
class UUWEMercunaSubsystem final : public UWorldSubsystem
{
public:
	class AMercunaNavGraph2D* FindClosestNavGraph2D(const struct FVector& position, const struct FMercunaAgentType& AgentType, float SearchRadius);
	struct FVector GetClosestPointToVolume(class AMercunaNavVolume* Volume, const struct FVector& Location);
	void RebuildQueriedChangesInAllNavGraphs();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEMercunaSubsystem">();
	}
	static class UUWEMercunaSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEMercunaSubsystem>();
	}
};

// Class UWEMercuna.UWEMercunaSurfaceNavigationComponent
// 0x0000 (0x0400 - 0x0400)
class UUWEMercunaSurfaceNavigationComponent final : public UMercunaSurfaceNavigationComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEMercunaSurfaceNavigationComponent">();
	}
	static class UUWEMercunaSurfaceNavigationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEMercunaSurfaceNavigationComponent>();
	}
};

}

