#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEMercuna

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Mercuna_structs.hpp"


namespace SDK::Params
{

// Function UWEMercuna.UWEMercunaNavExclusionVolumeComponent.GetExclusionVolumeActor
// 0x0008 (0x0008 - 0x0000)
struct UWEMercunaNavExclusionVolumeComponent_GetExclusionVolumeActor final
{
public:
	class AMercunaNavExclusionVolume*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEMercuna.UWEMercunaNavExclusionVolumeComponent.IsVolumeCreated
// 0x0001 (0x0001 - 0x0000)
struct UWEMercunaNavExclusionVolumeComponent_IsVolumeCreated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEMercuna.UWEMercunaSubsystem.FindClosestNavGraph2D
// 0x0030 (0x0030 - 0x0000)
struct UWEMercunaSubsystem_FindClosestNavGraph2D final
{
public:
	struct FVector                                position;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMercunaAgentType                      AgentType;                                         // 0x0018(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SearchRadius;                                      // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMercunaNavGraph2D*                     ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEMercuna.UWEMercunaSubsystem.GetClosestPointToVolume
// 0x0038 (0x0038 - 0x0000)
struct UWEMercunaSubsystem_GetClosestPointToVolume final
{
public:
	class AMercunaNavVolume*                      Volume;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

