#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWENewsfeed

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"
#include "UWESonarAPI_structs.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "UWENewsfeed_structs.hpp"


namespace SDK
{

// Class UWENewsfeed.UWENewsfeedEntryViewModel
// 0x0060 (0x00C8 - 0x0068)
class UUWENewsfeedEntryViewModel final : public UMVVMViewModelBase
{
public:
	class UUWENewsfeedSubsystem*                  NewsfeedSubsystem;                                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 DocId;                                             // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 Title;                                             // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ImageUrl;                                          // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             ThumbnailTexture;                                  // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              Date;                                              // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FSonarNewsfeedContent>          Content;                                           // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          DownloadCompleted;                                 // 0x00C0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ShowNewNotification;                               // 0x00C1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void GetLatestNewsfeedEntry();
	void GetNewsfeedEntry(const class FString& DocumentId);
	bool HasNewEntry();
	bool Initialize(class UObject* WorldContext);
	void OnNewsfeedEntryRequested(bool bSuccess, const struct FSonarNewsfeedEntryResponse& Response);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWENewsfeedEntryViewModel">();
	}
	static class UUWENewsfeedEntryViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWENewsfeedEntryViewModel>();
	}
};

// Class UWENewsfeed.UWENewsfeedListViewModel
// 0x0028 (0x0090 - 0x0068)
class UUWENewsfeedListViewModel final : public UMVVMViewModelBase
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWENewsfeedSubsystem*                  NewsfeedSubsystem;                                 // 0x0070(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UObject>                 CachedWorldContext;                                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UUWENewsfeedEntryViewModel*>     NewsfeedEntries;                                   // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void GetNewsfeedList();
	bool Initialize(class UObject* WorldContext);
	void OnNewsfeedListRequested(bool bSuccess, const TArray<struct FSonarNewsfeedEntryResponse>& Response);
	void OnNewsfeedListStatusUpdated(EFNewsfeedListStatus Status);
	void UpdateLatestRead();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWENewsfeedListViewModel">();
	}
	static class UUWENewsfeedListViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWENewsfeedListViewModel>();
	}
};

// Class UWENewsfeed.UWENewsfeedSubsystem
// 0x0060 (0x0090 - 0x0030)
class UUWENewsfeedSubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(bool Success, const TArray<struct FSonarNewsfeedEntryResponse>& Response)> OnNewsfeedListRequested; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool Success, const struct FSonarNewsfeedEntryResponse& Response)> OnNewsfeedEntryRequested; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTexture2D* ImageTexture, const class UImage* Image)> OnNewsfeedImageRetrieved; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EFNewsfeedListStatus Status)> OnNewsfeedListStatus;                // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EFNewsfeedListStatus                          NewsfeedStatus;                                    // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWENewsfeedListViewModel*              NewsfeedListViewModel;                             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void DownloadImage(const class FString& ImageUrl);
	void GetNewsfeedEntryList();
	void GetSingleNewsfeedEntry(const class FString& DocumentId);
	void OnSonarConnectionChanged(bool bIsConnected);
	void RetrieveImage(const class FString& ImageUrl, const class UImage* Image);
	void RetrieveImageAsync(const class FString& ImageUrl, const class UImage* Image);
	void StartNewsfeedTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWENewsfeedSubsystem">();
	}
	static class UUWENewsfeedSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWENewsfeedSubsystem>();
	}
};

}

