#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWENetworking

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "UWENetworking_structs.hpp"
#include "UWEImGui_classes.hpp"
#include "Engine_classes.hpp"
#include "ReplicationGraph_classes.hpp"


namespace SDK
{

// Class UWENetworking.UWENetworkSmoothingComponent
// 0x02B0 (0x0370 - 0x00C0)
class UUWENetworkSmoothingComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bEnableSmoothingInStandaloneOrListenServer;        // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWENetworkSmoothingMode                      NetworkSmoothingMode;                              // 0x00C9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         NetworkMaxSmoothUpdateDistance;                    // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetworkNoSmoothUpdateDistance;                     // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetworkSimulatedSmoothLocationTime;                // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetworkSimulatedSmoothRotationTime;                // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetFirstFoundMeshAsChildSmoothingTarget;          // 0x00DC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWENetworkSmoothingTarget                    NetworkSmoothingTarget;                            // 0x00DD(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	class USceneComponent*                        VisualComponent;                                   // 0x00E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseAdaptiveSmoothTime;                             // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         AdaptiveSmoothTimeCoefficient;                     // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AdaptiveSmoothTimeSmoothingTime;                   // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableLocationExtrapolation;                       // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         LocationExtrapolationMaxDistanceSqr;               // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SmoothExtrapolationVelocityChange;                 // 0x00FC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseInterpolationPath;                              // 0x00FD(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	uint32                                        InterpolationPathCapacity;                         // 0x0100(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableSweepTest;                                   // 0x0104(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         LastTransformUpdateInterval;                       // 0x0108(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AdaptiveSmoothTime;                                // 0x010C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x260];                                    // 0x0110(0x0260)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetVisualComponent(class USceneComponent* InVisualComponent, bool ResetState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWENetworkSmoothingComponent">();
	}
	static class UUWENetworkSmoothingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWENetworkSmoothingComponent>();
	}
};

// Class UWENetworking.UWERepGraphNode_DynamicSpatialFrequency
// 0x0010 (0x0110 - 0x0100)
class UUWERepGraphNode_DynamicSpatialFrequency final : public UReplicationGraphNode_DynamicSpatialFrequency
{
public:
	uint8                                         Pad_100[0x10];                                     // 0x0100(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWERepGraphNode_DynamicSpatialFrequency">();
	}
	static class UUWERepGraphNode_DynamicSpatialFrequency* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWERepGraphNode_DynamicSpatialFrequency>();
	}
};

// Class UWENetworking.UWEReplicationGraph
// 0x00D8 (0x0620 - 0x0548)
class UUWEReplicationGraph final : public UReplicationGraph
{
public:
	uint8                                         Pad_548[0x30];                                     // 0x0548(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	class UReplicationGraphNode_GridSpatialization2D* GridNode;                                      // 0x0578(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UReplicationGraphNode_ActorListFrequencyBuckets* AlwaysRelevantNode;                       // 0x0580(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FUWEConnectionAlwaysRelevantNodePair> AlwaysRelevantForConnectionList;             // 0x0588(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_598[0x88];                                     // 0x0598(0x0088)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEReplicationGraph">();
	}
	static class UUWEReplicationGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEReplicationGraph>();
	}
};

// Class UWENetworking.UWEReplicationGraphDiagnostic
// 0x0078 (0x0168 - 0x00F0)
class UUWEReplicationGraphDiagnostic final : public UUWEImGuiComponent
{
public:
	uint8                                         Pad_F0[0x78];                                      // 0x00F0(0x0078)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEReplicationGraphDiagnostic">();
	}
	static class UUWEReplicationGraphDiagnostic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEReplicationGraphDiagnostic>();
	}
};

// Class UWENetworking.UWEReplicationGraphNode_AlwaysRelevant_ForConnection
// 0x0000 (0x0140 - 0x0140)
class UUWEReplicationGraphNode_AlwaysRelevant_ForConnection final : public UReplicationGraphNode_AlwaysRelevant_ForConnection
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEReplicationGraphNode_AlwaysRelevant_ForConnection">();
	}
	static class UUWEReplicationGraphNode_AlwaysRelevant_ForConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEReplicationGraphNode_AlwaysRelevant_ForConnection>();
	}
};

// Class UWENetworking.UWEReplicationGraphSettings
// 0x0020 (0x0058 - 0x0038)
class UUWEReplicationGraphSettings final : public UDeveloperSettingsBackedByCVars
{
public:
	bool                                          bEnableFastSharedPath;                             // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         DynamicActorFrequencyBuckets;                      // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpatialGridSize;                                   // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpatialGridWorldSize;                              // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FUWERepGraphActorClassSettings> ClassSettings;                                     // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEReplicationGraphSettings">();
	}
	static class UUWEReplicationGraphSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEReplicationGraphSettings>();
	}
};

}

