#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWENotifications

#include "Basic.hpp"

#include "UWENotifications_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UWEGameplayMessageRuntime_structs.hpp"


namespace SDK::Params
{

// Function UWENotifications.UWEMessageBoxAsync.ShowMessageBox
// 0x0038 (0x0038 - 0x0000)
struct UWEMessageBoxAsync_ShowMessageBox final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Message;                                           // 0x0008(0x0010)(Parm, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0018(0x0010)(Parm, NativeAccessSpecifierPublic)
	EUWEMessageBoxType                            Type;                                              // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEMessageBoxAsync*                    ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWEMessageBoxAsync.Close
// 0x0001 (0x0001 - 0x0000)
struct UWEMessageBoxAsync_Close final
{
public:
	bool                                          bCancel;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWEMessageBoxViewModel.Close
// 0x0001 (0x0001 - 0x0000)
struct UWEMessageBoxViewModel_Close final
{
public:
	bool                                          bCancelled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWENotificationComponent.CanShowNextNotification
// 0x0001 (0x0001 - 0x0000)
struct UWENotificationComponent_CanShowNextNotification final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWENotificationComponent.ClientNotify
// 0x0120 (0x0120 - 0x0000)
struct UWENotificationComponent_ClientNotify final
{
public:
	struct FNotificationData                      Data;                                              // 0x0000(0x0120)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWENotificationComponent.GetNumShownNotifications
// 0x0004 (0x0004 - 0x0000)
struct UWENotificationComponent_GetNumShownNotifications final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWENotificationComponent.OnHUDNotifyReceived
// 0x0058 (0x0058 - 0x0000)
struct UWENotificationComponent_OnHUDNotifyReceived final
{
public:
	struct FGameplayTag                           Channel;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayMessageLocalizedNotify        Message;                                           // 0x0008(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SenderPlayerId;                                    // 0x0050(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWENotifications.UWENotificationComponent.OnHUDNotifyReceivedString
// 0x0020 (0x0020 - 0x0000)
struct UWENotificationComponent_OnHUDNotifyReceivedString final
{
public:
	struct FGameplayTag                           Channel;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayMessageString                 Message;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SenderPlayerId;                                    // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWENotifications.UWENotificationStatics.ArePlayerNotificationsSuppressed
// 0x0010 (0x0010 - 0x0000)
struct UWENotificationStatics_ArePlayerNotificationsSuppressed final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWENotifications.UWENotificationStatics.ClearNotifications
// 0x0008 (0x0008 - 0x0000)
struct UWENotificationStatics_ClearNotifications final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWENotificationStatics.SendNotificationToPlayers
// 0x0138 (0x0138 - 0x0000)
struct UWENotificationStatics_SendNotificationToPlayers final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNotificationData                      Data;                                              // 0x0008(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class APlayerState*>                   Players;                                           // 0x0128(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWENotificationSystemViewModel.AddReasonToHide
// 0x0010 (0x0010 - 0x0000)
struct UWENotificationSystemViewModel_AddReasonToHide final
{
public:
	class FString                                 Reason;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWENotificationSystemViewModel.Initialize
// 0x0008 (0x0008 - 0x0000)
struct UWENotificationSystemViewModel_Initialize final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWENotificationSystemViewModel.OnNotificationStarted
// 0x0120 (0x0120 - 0x0000)
struct UWENotificationSystemViewModel_OnNotificationStarted final
{
public:
	struct FNotificationData                      NotificationData;                                  // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWENotificationSystemViewModel.RemoveReasonToHide
// 0x0010 (0x0010 - 0x0000)
struct UWENotificationSystemViewModel_RemoveReasonToHide final
{
public:
	class FString                                 Reason;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWENotificationSystemViewModel.SetCriticalErrorMode
// 0x0001 (0x0001 - 0x0000)
struct UWENotificationSystemViewModel_SetCriticalErrorMode final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWENotifications.UWENotificationSystemViewModel.ShowNotification
// 0x0120 (0x0120 - 0x0000)
struct UWENotificationSystemViewModel_ShowNotification final
{
public:
	struct FNotificationData                      Data;                                              // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

}

