#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEPhotoTours

#include "Basic.hpp"

#include "UWEPhotoTours_structs.hpp"


namespace SDK::Params
{

// Function UWEPhotoTours.UWEPhotoToursBPLibrary.UWEPhotoToursSampleFunction
// 0x0008 (0x0008 - 0x0000)
struct UWEPhotoToursBPLibrary_UWEPhotoToursSampleFunction final
{
public:
	float                                         Param;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEPhotoTours.UWEPhotoToursStatics.GetPhotoTourCameras
// 0x0018 (0x0018 - 0x0000)
struct UWEPhotoToursStatics_GetPhotoTourCameras final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCameraInfo>                    ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEPhotoTours.UWEPhotoToursSubsystem.Get
// 0x0010 (0x0010 - 0x0000)
struct UWEPhotoToursSubsystem_Get final
{
public:
	const class UWorld*                           InWorld;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEPhotoToursSubsystem*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEPhotoTours.UWEPhotoToursSubsystem.GetDefaultPhotoToursFolder
// 0x0010 (0x0010 - 0x0000)
struct UWEPhotoToursSubsystem_GetDefaultPhotoToursFolder final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEPhotoTours.UWEPhotoToursSubsystem.GetPhotoToursLevels
// 0x0020 (0x0020 - 0x0000)
struct UWEPhotoToursSubsystem_GetPhotoToursLevels final
{
public:
	class FString                                 MapGroup;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEPhotoTours.UWEPhotoToursSubsystem.StartPhotoTourOnCurrentLevel
// 0x0001 (0x0001 - 0x0000)
struct UWEPhotoToursSubsystem_StartPhotoTourOnCurrentLevel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEPhotoTours.UWEPhotoToursSubsystem.StartPhotoToursOnAllLevels
// 0x0040 (0x0040 - 0x0000)
struct UWEPhotoToursSubsystem_StartPhotoToursOnAllLevels final
{
public:
	struct FPhotoTourConfig                       Config;                                            // 0x0000(0x0038)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEPhotoTours.UWEPhotoToursSubsystem.CanStartPhotoTour
// 0x0001 (0x0001 - 0x0000)
struct UWEPhotoToursSubsystem_CanStartPhotoTour final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEPhotoTours.UWEPhotoToursSubsystem.GetIsPhotoTourRunning
// 0x0001 (0x0001 - 0x0000)
struct UWEPhotoToursSubsystem_GetIsPhotoTourRunning final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

