#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEPhysics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UWEVolumeTracker_structs.hpp"
#include "UWEPhysics_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UWEInterfaces_structs.hpp"


namespace SDK
{

// Class UWEPhysics.UUWEPhysicsBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UUUWEPhysicsBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool ApproximateConeTrace(const class UObject* WorldContextObject, const struct FVector& Start, const struct FVector& Direction, const float Distance, const float Angle, const TArray<EObjectTypeQuery>& ObjectTypes, TArray<class AActor*>* OutOverlappingActors, const TArray<class AActor*>& ActorsToIgnore, const TArray<EObjectTypeQuery>& BlockingObjectTypes);
	static bool FindTeleportSpotAroundObstacle(const class UObject* WorldContextObject, class AActor* Target, class AActor* Obstacle, bool TestOnlyObstacleRootCollision, bool TestCurrentTargetLocation, struct FVector* OutTeleportLocation, bool Debug);
	static class UUWEChaosPhysicsController* GetOrAddPhysicsController(class AActor* Target, bool bAddVolumeTracker);
	static bool LineRetraceComplex(const struct FHitResult& InputHit, struct FHitResult* Hit, ECollisionChannel TraceChannel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UUWEPhysicsBPLibrary">();
	}
	static class UUUWEPhysicsBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUUWEPhysicsBPLibrary>();
	}
};

// Class UWEPhysics.UWEChaosPhysicsController
// 0x00B8 (0x0178 - 0x00C0)
class UUWEChaosPhysicsController final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UPrimitiveComponent*                    PhysicsComponent;                                  // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVolumeTrackerComponent*                VolumeTrackerComponent;                            // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWEChaosPhysicsControllerEnvironmentSettings AirSettings;                                // 0x00E0(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FUWEChaosPhysicsControllerEnvironmentSettings WaterSettings;                              // 0x00E8(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x4];                                       // 0x00F0(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	EUWEChaosPhysicsControllerBuoyancyMode        BuoyancyMode;                                      // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F5[0x7];                                       // 0x00F5(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         VolumeMultiplier;                                  // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SetMassOutOfBuoyancyForce;                         // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SetMassOutOfBuoyancyForceGravityMultiplier;        // 0x0104(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WeldedBodiesDoNotAffectRequiredBuoyancy;           // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         BespokeBuoyancyAcceleration;                       // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x68];                                     // 0x0110(0x0068)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AddAcceleration(const struct FVector& Acceleration);
	void AddForce(const struct FVector& Force);
	void AddForceAtPosition(const struct FVector& Force, const struct FVector& position);
	void AddImpulse(const struct FVector& Impulse);
	void AddImpulseAtPosition(const struct FVector& Impulse, const struct FVector& position);
	void AddVelocity(const struct FVector& Velocity);
	void ForceToSleep();
	void OnVolumeTypeChanged(EVolumeType VolumeType);
	void SetEnvironmentSettings(const struct FUWEChaosPhysicsControllerEnvironmentSettings& EnvironmentSetting);
	void SetPhysicsEnabled(bool Enabled);

	struct FBox GetBodyBounds() const;
	struct FVector GetBodySize() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEChaosPhysicsController">();
	}
	static class UUWEChaosPhysicsController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEChaosPhysicsController>();
	}
};

// Class UWEPhysics.UWECollisionImpactComponent
// 0x01B0 (0x0270 - 0x00C0)
class UUWECollisionImpactComponent final : public UActorComponent
{
public:
	bool                                          IsEnabled;                                         // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   ColliderTag;                                       // 0x00C4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BounceOffStaticObjects;                            // 0x00CC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FUWECollisionImpactGameplayCue> ImpactGameplayCues;                                // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         CoefficientOfRestitution;                          // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SelfMassMult;                                      // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SelfVelocityMult;                                  // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(class UPrimitiveComponent* OtherComponent, const struct FUWECollisionImpactObjectData& Payload, const struct FHitResult& Hit)> OnCollisionImpact; // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x170];                                    // 0x0100(0x0170)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnHitCallback(class UPrimitiveComponent* SelfComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComponent, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWECollisionImpactComponent">();
	}
	static class UUWECollisionImpactComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWECollisionImpactComponent>();
	}
};

// Class UWEPhysics.UWEOverlapDetectorComponent
// 0x0020 (0x00E0 - 0x00C0)
class UUWEOverlapDetectorComponent : public UActorComponent
{
public:
	bool                                          DefaultEnabled;                                    // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   OverlapColliderTag;                                // 0x00C4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ProcessOverlapsOnTick;                             // 0x00CC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CD[0x13];                                      // 0x00CD(0x0013)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void Enable(bool Enable_0);
	void OnComponentBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnComponentEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEOverlapDetectorComponent">();
	}
	static class UUWEOverlapDetectorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEOverlapDetectorComponent>();
	}
};

// Class UWEPhysics.UWEOverlapExpellerComponent
// 0x0040 (0x0120 - 0x00E0)
class UUWEOverlapExpellerComponent final : public UUWEOverlapDetectorComponent
{
public:
	EUWEMovementComponentInfluenceType            InfluenceType;                                     // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Magnitude;                                         // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DirectionMask;                                     // 0x00E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveAffectedObjectWithActorVelocity;               // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         ActorVelocityMultiplier;                           // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AffectObjectActorTag;                              // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEOverlapExpellerComponent">();
	}
	static class UUWEOverlapExpellerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEOverlapExpellerComponent>();
	}
};

// Class UWEPhysics.UWEPhysicsHandleComponent
// 0x0018 (0x0520 - 0x0508)
class UUWEPhysicsHandleComponent final : public UPhysicsHandleComponent
{
public:
	class FName                                   SocketName;                                        // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMeshComp;                                  // 0x0510(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_518[0x8];                                      // 0x0518(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPhysicsHandleComponent">();
	}
	static class UUWEPhysicsHandleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPhysicsHandleComponent>();
	}
};

// Class UWEPhysics.UWERestoreRotationComponent
// 0x0028 (0x00E8 - 0x00C0)
class UUWERestoreRotationComponent final : public UActorComponent
{
public:
	EVolumeType                                   OnlyInVolumeType;                                  // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          RestorePitch;                                      // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         PitchAngle;                                        // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          RestoreRoll;                                       // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         RollAngle;                                         // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          RestoreYaw;                                        // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         YawAngle;                                          // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RestoreSpeed;                                      // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisabledWhileAttached;                            // 0x00DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UVolumeTrackerComponent*                VolumeTrackerCache;                                // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWERestoreRotationComponent">();
	}
	static class UUWERestoreRotationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWERestoreRotationComponent>();
	}
};

// Class UWEPhysics.UWESweepTestEnforceComponent
// 0x0000 (0x00E0 - 0x00E0)
class UUWESweepTestEnforceComponent final : public UUWEOverlapDetectorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESweepTestEnforceComponent">();
	}
	static class UUWESweepTestEnforceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESweepTestEnforceComponent>();
	}
};

}

