#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEPerfMon

#include "Basic.hpp"

#include "UWEImGui_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class UWEPerfMon.UWENetworkDiagnostic
// 0x0150 (0x0240 - 0x00F0)
class UUWENetworkDiagnostic final : public UUWEImGuiComponent
{
public:
	uint8                                         Pad_F0[0x150];                                     // 0x00F0(0x0150)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void CaptureData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWENetworkDiagnostic">();
	}
	static class UUWENetworkDiagnostic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWENetworkDiagnostic>();
	}
};

// Class UWEPerfMon.UWENetworkDiagnosticsInfoProvider
// 0x0000 (0x0000 - 0x0000)
class IUWENetworkDiagnosticsInfoProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWENetworkDiagnosticsInfoProvider">();
	}
	static class IUWENetworkDiagnosticsInfoProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUWENetworkDiagnosticsInfoProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class UWEPerfMon.UWEPerfMonDiagnostic
// 0x02A8 (0x0398 - 0x00F0)
class UUWEPerfMonDiagnostic final : public UUWEImGuiComponent
{
public:
	TMap<class UClass*, int64>                    CountByClass;                                      // 0x00F0(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<class UClass*, int64>                    BaseCountByClass;                                  // 0x0140(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<class UClass*, int64>                    PeakCountByClass;                                  // 0x0190(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E0[0x1B8];                                    // 0x01E0(0x01B8)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void CaptureData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPerfMonDiagnostic">();
	}
	static class UUWEPerfMonDiagnostic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPerfMonDiagnostic>();
	}
};

// Class UWEPerfMon.UWEPSODiagnostic
// 0x0000 (0x00F0 - 0x00F0)
class UUWEPSODiagnostic final : public UUWEImGuiComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPSODiagnostic">();
	}
	static class UUWEPSODiagnostic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPSODiagnostic>();
	}
};

// Class UWEPerfMon.UWERenderResourceDiagnostic
// 0x0010 (0x0100 - 0x00F0)
class UUWERenderResourceDiagnostic final : public UUWEImGuiComponent
{
public:
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWERenderResourceDiagnostic">();
	}
	static class UUWERenderResourceDiagnostic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWERenderResourceDiagnostic>();
	}
};

// Class UWEPerfMon.UWETraceDiagnostic
// 0x0000 (0x00F0 - 0x00F0)
class UUWETraceDiagnostic final : public UUWEImGuiComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWETraceDiagnostic">();
	}
	static class UUWETraceDiagnostic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWETraceDiagnostic>();
	}
};

}

