#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEPrototype

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class UWEPrototype.UWEPrototypeActor
// 0x0030 (0x02E0 - 0x02B0)
class AUWEPrototypeActor final : public AActor
{
public:
	class UUWEAbilitySystemComponent*             UWEAbilitySystemComponent;                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEHealthSetComponent*                 HealthSetComponent;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEMechanicalSetComponent*             MechanicalSetComponent;                            // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEMovementSetComponent*               MovementSetComponent;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWESurvivalSetComponent*               SurvivalSetComponent;                              // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWEPhysicalSetComponent*               PhysicalSetComponent;                              // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void UpdateMaxSpeed();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPrototypeActor">();
	}
	static class AUWEPrototypeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEPrototypeActor>();
	}
};

}

