#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEPCG

#include "Basic.hpp"

#include "PCG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UWEPCG.UWEPCGBPLibrary.GetMeshPaintTexture
// 0x0030 (0x0030 - 0x0000)
struct UWEPCGBPLibrary_GetMeshPaintTexture final
{
public:
	const class UStaticMeshComponent*             StaticMeshComponent;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture>                ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEPCG.UWEPCGBPLibrary.PCGAddAssetUserDataArray
// 0x0018 (0x0018 - 0x0000)
struct UWEPCGBPLibrary_PCGAddAssetUserDataArray final
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMeshComponent;                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                 AssetUserDataArray;                                // 0x0008(0x0010)(Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEPCG.UWEPCGBPLibrary.PCGLoadActor
// 0x0028 (0x0028 - 0x0000)
struct UWEPCGBPLibrary_PCGLoadActor final
{
public:
	struct FSoftObjectPath                        InPath;                                            // 0x0000(0x0020)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          ReturnValue;                                       // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEPCG.UWEPCGBPLibrary.PCGPointSetTransform
// 0x0200 (0x0200 - 0x0000)
struct UWEPCGBPLibrary_PCGPointSetTransform final
{
public:
	struct FPCGPoint                              InPoint;                                           // 0x0000(0x00D0)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             InTransform;                                       // 0x00D0(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGPoint                              ReturnValue;                                       // 0x0130(0x00D0)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

}

