#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEPinnedRecipes

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class UWEPinnedRecipes.UWEPinnedRecipesPlayerStateComponent
// 0x0048 (0x0108 - 0x00C0)
class UUWEPinnedRecipesPlayerStateComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x28];                                      // 0x00C0(0x0028)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UUWEPrimaryDataAssetBase*>       PinnedRecipes;                                     // 0x00E8(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	int32                                         MaxNumEntries;                                     // 0x00F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWESaveHandle*                         SaveHandle;                                        // 0x0100(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void PinRecipe(class UUWEPrimaryDataAssetBase* Recipe);
	void ServerPinRecipe(class UUWEPrimaryDataAssetBase* Recipe);
	void ServerUnpinRecipe(class UUWEPrimaryDataAssetBase* Recipe);
	void UnpinRecipe(class UUWEPrimaryDataAssetBase* Recipe);

	bool IsPinned(class UUWEPrimaryDataAssetBase* Recipe) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPinnedRecipesPlayerStateComponent">();
	}
	static class UUWEPinnedRecipesPlayerStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPinnedRecipesPlayerStateComponent>();
	}
};

}

