#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEPingSystem

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "UWEAssetRegistry_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"
#include "UWEPingSystem_structs.hpp"


namespace SDK
{

// Class UWEPingSystem.UWEPingData
// 0x0070 (0x00B8 - 0x0048)
class UUWEPingData final : public UUWEActorDataAsset
{
public:
	struct FGameplayTag                           IdentifierTag;                                     // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  HideWhenPlayerHasTags;                             // 0x0050(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  OnlyShowWhenPlayerHasTags;                         // 0x0070(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UTexture2D*                             Thumbnail;                                         // 0x0090(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SoundCue;                                          // 0x0098(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorPing;                                         // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HideDistance;                                      // 0x00A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverridePingFadeDistance;                          // 0x00A9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         PingFadeStartDistance;                             // 0x00AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PingFadeEndDistance;                               // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPingData">();
	}
	static class UUWEPingData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPingData>();
	}
};

// Class UWEPingSystem.UWEPingDeveloperSettings
// 0x0010 (0x0048 - 0x0038)
class UUWEPingDeveloperSettings final : public UDeveloperSettings
{
public:
	TArray<struct FLinearColor>                   PingThumbnailColors;                               // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPingDeveloperSettings">();
	}
	static class UUWEPingDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPingDeveloperSettings>();
	}
};

// Class UWEPingSystem.UWEPingMarker
// 0x0070 (0x0320 - 0x02B0)
class AUWEPingMarker final : public AActor
{
public:
	class FText                                   FriendlyName;                                      // 0x02B0(0x0010)(Edit, BlueprintVisible, Net, SaveGame, NativeAccessSpecifierPublic)
	class FText                                   OriginalName;                                      // 0x02C0(0x0010)(Edit, BlueprintVisible, Net, SaveGame, NativeAccessSpecifierPublic)
	bool                                          AllowDuplicates;                                   // 0x02D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class UUWEPingData>            PingData;                                          // 0x02D8(0x0028)(Edit, Net, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWESaveComponent*                      SaveComponent;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  UniqueID;                                          // 0x0308(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        RootComp;                                          // 0x0318(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	struct FGuid GetUniqueId();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPingMarker">();
	}
	static class AUWEPingMarker* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEPingMarker>();
	}
};

// Class UWEPingSystem.UWEPingMarkerComponent
// 0x0078 (0x05E0 - 0x0568)
class UUWEPingMarkerComponent final : public UBoxComponent
{
public:
	uint8                                         Pad_568[0x20];                                     // 0x0568(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(const struct FUWEPing& Ping)> OnPingChanged;                       // 0x0588(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  PingID;                                            // 0x0598(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   OriginalName;                                      // 0x05A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          EnableVisibilityToggling;                          // 0x05B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEPingData*                           PingData;                                          // 0x05C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWESaveHandle*                         SaveHandle;                                        // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D0[0x10];                                     // 0x05D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class FText GetPingDisplayName();
	void OnDynamicItemFullyRegistered();
	void OnPingsChanged();
	void OnProfanityFilterChanged(bool bProfanityFilterEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPingMarkerComponent">();
	}
	static class UUWEPingMarkerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPingMarkerComponent>();
	}
};

// Class UWEPingSystem.UWEPingPlayerStateComponent
// 0x0000 (0x00C0 - 0x00C0)
class UUWEPingPlayerStateComponent final : public UActorComponent
{
public:
	void ServerSetPingVisibilityForPlayer(class APlayerState* PlayerState, const struct FGuid& UniqueID, bool bNewValue);
	void SetPingVisibilityForPlayer(class APlayerState* PlayerState, const struct FGuid& UniqueID, bool bNewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPingPlayerStateComponent">();
	}
	static class UUWEPingPlayerStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPingPlayerStateComponent>();
	}
};

// Class UWEPingSystem.UWEPingSystemCommandComponent
// 0x0010 (0x00D0 - 0x00C0)
class UUWEPingSystemCommandComponent final : public UActorComponent
{
public:
	struct FGuid                                  PingUniqueId;                                      // 0x00C0(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ServerAddPing(const struct FVector& Location, const class FText& DisplayName, float Lifetime, class UUWEPingData* PingData);
	void ServerAddPlayerPing(const struct FVector& Location, const class FText& DisplayName, float Lifetime, class UUWEPingData* PingData, class AActor* TrackingActor);
	void ServerRemovePing(const struct FGuid& UniqueID);
	void ServerSetPingDisplayName(const struct FGuid& UniqueID, const class FText& NewDisplayName);
	void ServerSetThumbnailColor(const struct FGuid& UniqueID, const struct FLinearColor& NewThumbnailColor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPingSystemCommandComponent">();
	}
	static class UUWEPingSystemCommandComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPingSystemCommandComponent>();
	}
};

// Class UWEPingSystem.UWEPingSystemComponent
// 0x00B8 (0x0178 - 0x00C0)
class UUWEPingSystemComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnPingsChanged;                                    // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FUWEPing>                       ActivePings;                                       // 0x00D8(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	class UUWEPingData*                           BeaconPingData;                                    // 0x00E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWESaveHandle*                         SaveHandle;                                        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          DefaultHiddenPings;                                // 0x00F8(0x0010)(Net, ZeroConstructor, SaveGame, RepNotify, NativeAccessSpecifierPrivate)
	TArray<struct FUWEPing>                       SavedPings;                                        // 0x0108(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPrivate)
	TArray<struct FUWEPingSettingsStruct>         PingSettings;                                      // 0x0118(0x0010)(Net, ZeroConstructor, SaveGame, NativeAccessSpecifierPrivate)
	TMap<struct FGuid, int32>                     BeaconNumberMap;                                   // 0x0128(0x0050)(SaveGame, NativeAccessSpecifierPrivate)

public:
	void AddPing(const struct FVector& Location, const class FText& DisplayName, class UUWEPingData* PingData, float Lifetime, class AActor* Owner, class AActor* TrackingActor, struct FGuid* OutUniqueId, bool bAllowDuplicatePings, bool bDestroyOnTrackingActorDespawn, const struct FLinearColor& PingColor);
	class FText GetPingDisplayName(bool* bOutPingFound, const struct FGuid& UniqueID);
	struct FVector GetPingLocation(bool* bOutPingFound, const struct FGuid& UniqueID);
	bool IsPingHiddenForPlayer(const struct FGuid& Guid, const class APlayerState* PlayerState);
	bool IsPingIDAlreadyRegistered(const struct FGuid& UniqueID);
	void OnRep_ActivePings();
	void OnRep_DefaultHiddenPings();
	void RemoveAllPings();
	void RemovePing(const struct FGuid& UniqueID);
	void SetDefaultPingVisibility(const struct FGuid& UniqueID, bool bNewValue);
	void SetPingDisplayName(const struct FGuid& UniqueID, const class FText& NewDisplayName);
	void SetPingLocation(const struct FGuid& UniqueID, const struct FVector& NewLocation);
	void SetPingThumbnailColor(const struct FGuid& UniqueID, const struct FLinearColor& NewThumbnailColor);
	void SetPingVisibilityForPlayer(class APlayerState* PlayerState, const struct FGuid& UniqueID, bool bNewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPingSystemComponent">();
	}
	static class UUWEPingSystemComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPingSystemComponent>();
	}
};

// Class UWEPingSystem.UWEPingSystemStatics
// 0x0000 (0x0028 - 0x0028)
class UUWEPingSystemStatics final : public UBlueprintFunctionLibrary
{
public:
	static class UUWEPingData* GetPingDataByType(const struct FGameplayTag& PingTypeTag);
	static class UUWEPingSystemComponent* GetPingSystemComponent(class UObject* WorldContextObject);
	static bool IsPingVisibleToPlayer(class UObject* WorldContextObject, const struct FGuid& UniqueID, const class APlayerState* PlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPingSystemStatics">();
	}
	static class UUWEPingSystemStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPingSystemStatics>();
	}
};

}

