#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWERenderingRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Niagara_classes.hpp"


namespace SDK
{

// Class UWERenderingRuntime.MaterialExpressionNormalAlphaBlendOutput
// 0x0028 (0x00D8 - 0x00B0)
class UMaterialExpressionNormalAlphaBlendOutput final : public UMaterialExpressionCustomOutput
{
public:
	struct FExpressionInput                       NormalAlphaBlend;                                  // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionNormalAlphaBlendOutput">();
	}
	static class UMaterialExpressionNormalAlphaBlendOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionNormalAlphaBlendOutput>();
	}
};

// Class UWERenderingRuntime.MaterialExpressionMetallicSpecularRoughnessAlphaBlendOutput
// 0x0028 (0x00D8 - 0x00B0)
class UMaterialExpressionMetallicSpecularRoughnessAlphaBlendOutput final : public UMaterialExpressionCustomOutput
{
public:
	struct FExpressionInput                       MetallicSpecularRoughnessAlphaBlend;               // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMetallicSpecularRoughnessAlphaBlendOutput">();
	}
	static class UMaterialExpressionMetallicSpecularRoughnessAlphaBlendOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMetallicSpecularRoughnessAlphaBlendOutput>();
	}
};

// Class UWERenderingRuntime.MaterialExpressionClipOutput
// 0x0028 (0x00D8 - 0x00B0)
class UMaterialExpressionClipOutput final : public UMaterialExpressionCustomOutput
{
public:
	struct FExpressionInput                       ClipPixel;                                         // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionClipOutput">();
	}
	static class UMaterialExpressionClipOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionClipOutput>();
	}
};

// Class UWERenderingRuntime.MaterialExpressionDistanceToNearestMediaVolume
// 0x0028 (0x00D8 - 0x00B0)
class UMaterialExpressionDistanceToNearestMediaVolume final : public UMaterialExpression
{
public:
	struct FExpressionInput                       position;                                          // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionDistanceToNearestMediaVolume">();
	}
	static class UMaterialExpressionDistanceToNearestMediaVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionDistanceToNearestMediaVolume>();
	}
};

// Class UWERenderingRuntime.MaterialExpressionInsideMediaVolume
// 0x0058 (0x0108 - 0x00B0)
class UMaterialExpressionInsideMediaVolume final : public UMaterialExpression
{
public:
	struct FExpressionInput                       position;                                          // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Bias;                                              // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         BiasValue;                                         // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionInsideMediaVolume">();
	}
	static class UMaterialExpressionInsideMediaVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionInsideMediaVolume>();
	}
};

// Class UWERenderingRuntime.MaterialExpressionLightFunctionDomainReplace
// 0x0050 (0x0100 - 0x00B0)
class UMaterialExpressionLightFunctionDomainReplace final : public UMaterialExpression
{
public:
	struct FExpressionInput                       DirectLightingPath;                                // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       VolumetricPath;                                    // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionLightFunctionDomainReplace">();
	}
	static class UMaterialExpressionLightFunctionDomainReplace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionLightFunctionDomainReplace>();
	}
};

// Class UWERenderingRuntime.MaterialExpressionVolumetricFogBlendOutput
// 0x0028 (0x00D8 - 0x00B0)
class UMaterialExpressionVolumetricFogBlendOutput final : public UMaterialExpressionCustomOutput
{
public:
	struct FExpressionInput                       BlendAlpha;                                        // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionVolumetricFogBlendOutput">();
	}
	static class UMaterialExpressionVolumetricFogBlendOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionVolumetricFogBlendOutput>();
	}
};

// Class UWERenderingRuntime.UWENiagaraDataInterfaceMediaVolume
// 0x0000 (0x0038 - 0x0038)
class UUWENiagaraDataInterfaceMediaVolume final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWENiagaraDataInterfaceMediaVolume">();
	}
	static class UUWENiagaraDataInterfaceMediaVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWENiagaraDataInterfaceMediaVolume>();
	}
};

}

