#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWERangeTracker

#include "Basic.hpp"

#include "UWEImGui_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UWERangeTracker_structs.hpp"
#include "UWEMath_structs.hpp"


namespace SDK
{

// Class UWERangeTracker.UWEListenPlayerInRange
// 0x0058 (0x0088 - 0x0030)
class UUWEListenPlayerInRange final : public UBlueprintAsyncActionBase
{
public:
	class AActor*                                 Peer;                                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              InRangeCallback;                                   // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OutOfRangeCallback;                                // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UUWEListenPlayerInRange* ListenPlayerInRange(class AActor* InPeer, const struct FUWERangeTrackerPeerRangeConfig& InRangeConfig);

	void OnPeerEndPlay(class AActor* InPeer, EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEListenPlayerInRange">();
	}
	static class UUWEListenPlayerInRange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEListenPlayerInRange>();
	}
};

// Class UWERangeTracker.UWERangeTracker
// 0x0038 (0x0078 - 0x0040)
class UUWERangeTracker : public UTickableWorldSubsystem
{
public:
	TArray<class USceneComponent*>                Targets;                                           // 0x0040(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FUWERangeTrackerPeerDataList           Peers;                                             // 0x0050(0x0010)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	int32 GetPeerCount();
	void RegisterPeerActor(class AActor* Peer, const struct FUWERangeTrackerPeerRangeConfig& RangeConfig, const struct FUWERangeTrackerPeerRangeCallbacks& Callbacks);
	void RegisterTargetActor(class AActor* Target);
	void UnregisterPeerActor(class AActor* Peer);
	void UnregisterPeerActorWithRangeConfig(class AActor* Peer, const struct FUWERangeTrackerPeerRangeConfig& RangeConfig);
	void UnregisterPeerActorWithRangeConfigTag(class AActor* Peer, const struct FGameplayTag& RangeConfigTag);
	void UnregisterTargetActor(class AActor* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWERangeTracker">();
	}
	static class UUWERangeTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWERangeTracker>();
	}
};

// Class UWERangeTracker.UWEPlayerRangeTracker
// 0x0000 (0x0078 - 0x0078)
class UUWEPlayerRangeTracker final : public UUWERangeTracker
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPlayerRangeTracker">();
	}
	static class UUWEPlayerRangeTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPlayerRangeTracker>();
	}
};

// Class UWERangeTracker.UWESimpleShapeTriggerComponent
// 0x0090 (0x0150 - 0x00C0)
class UUWESimpleShapeTriggerComponent : public UActorComponent
{
public:
	struct FUWESimpleShape                        Shape;                                             // 0x00C0(0x0070)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          ActorsInRange;                                     // 0x0130(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0x10];                                     // 0x0140(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESimpleShapeTriggerComponent">();
	}
	static class UUWESimpleShapeTriggerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESimpleShapeTriggerComponent>();
	}
};

// Class UWERangeTracker.UWERangeBasedGameplayEffect
// 0x0030 (0x0180 - 0x0150)
class UUWERangeBasedGameplayEffect final : public UUWESimpleShapeTriggerComponent
{
public:
	TSoftClassPtr<class UClass>                   GameplayEffect;                                    // 0x0150(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWERangeBasedGameplayEffect">();
	}
	static class UUWERangeBasedGameplayEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWERangeBasedGameplayEffect>();
	}
};

// Class UWERangeTracker.UWERangeTrackerDebugger
// 0x0000 (0x00F0 - 0x00F0)
class UUWERangeTrackerDebugger final : public UUWEImGuiComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWERangeTrackerDebugger">();
	}
	static class UUWERangeTrackerDebugger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWERangeTrackerDebugger>();
	}
};

// Class UWERangeTracker.UWEWaitDistanceExceeded
// 0x0040 (0x0070 - 0x0030)
class UUWEWaitDistanceExceeded final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnDistanceExceeded;                                // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCancelled;                                       // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         OtherSceneComponent;                               // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UUWEWaitDistanceExceeded* WaitDistanceExceeded(class AActor* InActor, class USceneComponent* InOtherSceneComponent, float InDeltaDistance);

	void OnActorDestroyed(class AActor* DestroyedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEWaitDistanceExceeded">();
	}
	static class UUWEWaitDistanceExceeded* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEWaitDistanceExceeded>();
	}
};

}

