#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWESpawnSystems

#include "Basic.hpp"

#include "UWEUtilities_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UWESpawnSystems_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "UWESaveSystem_classes.hpp"


namespace SDK
{

// Class UWESpawnSystems.UWEBuilderItemRemovalHandlerInterface
// 0x0000 (0x0000 - 0x0000)
class IUWEBuilderItemRemovalHandlerInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEBuilderItemRemovalHandlerInterface">();
	}
	static class IUWEBuilderItemRemovalHandlerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUWEBuilderItemRemovalHandlerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class UWESpawnSystems.UWEBuilderItemsCullingComponent
// 0x0060 (0x0120 - 0x00C0)
class UUWEBuilderItemsCullingComponent final : public UActorComponent
{
public:
	TArray<class AActor*>                         ActorsRegisteredForCulling;                        // 0x00C0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class AActor*, struct FUWEActorStreamedOutState> ActorStreamedOutState;                     // 0x00D0(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEBuilderItemsCullingComponent">();
	}
	static class UUWEBuilderItemsCullingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEBuilderItemsCullingComponent>();
	}
};

// Class UWESpawnSystems.UWEBuilderItemsSaveUpgrader
// 0x0000 (0x0030 - 0x0030)
class UUWEBuilderItemsSaveUpgrader final : public UUWESaveHandleUpgrader
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEBuilderItemsSaveUpgrader">();
	}
	static class UUWEBuilderItemsSaveUpgrader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEBuilderItemsSaveUpgrader>();
	}
};

// Class UWESpawnSystems.UWEBuilderItemsStub
// 0x0050 (0x0078 - 0x0028)
class UUWEBuilderItemsStub final : public UObject
{
public:
	struct FUWEBuilderItemsSave_Old               BuilderItemsSave;                                  // 0x0028(0x0050)(SaveGame, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEBuilderItemsStub">();
	}
	static class UUWEBuilderItemsStub* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEBuilderItemsStub>();
	}
};

// Class UWESpawnSystems.UWEBuilderItemsSpawnManager
// 0x0240 (0x0288 - 0x0048)
class UUWEBuilderItemsSpawnManager final : public UUWEServerWorldSubsystem
{
public:
	class UUWESaveHandle*                         SaveHandle;                                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUWEBuilderItemsSave                   BuilderItemsSave;                                  // 0x0050(0x00A0)(SaveGame, NativeAccessSpecifierPrivate)
	TMap<struct FGuid, class AActor*>             ActorFindById;                                     // 0x00F0(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class AActor*, struct FGuid>             IdFindByActor;                                     // 0x0140(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TSet<struct FSoftObjectPath>                  PathsBeingLoaded;                                  // 0x0190(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TSet<struct FGuid>                            ActiveItems;                                       // 0x01E0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<TSoftClassPtr<class UClass>, bool>       DestroyActorsWhenStreaming;                        // 0x0230(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnActorDestroyed(class AActor* DestroyedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEBuilderItemsSpawnManager">();
	}
	static class UUWEBuilderItemsSpawnManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEBuilderItemsSpawnManager>();
	}
};

// Class UWESpawnSystems.UWEBuilderItemsSpawnManagerSettings
// 0x0030 (0x0068 - 0x0038)
class UUWEBuilderItemsSpawnManagerSettings final : public UDeveloperSettings
{
public:
	TArray<TSoftClassPtr<class UClass>>           ExpectedComponents;                                // 0x0038(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           BuilderItemsThatCannotBeStreamed;                  // 0x0048(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           ComponentsThatShouldNotBeStreamed;                 // 0x0058(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEBuilderItemsSpawnManagerSettings">();
	}
	static class UUWEBuilderItemsSpawnManagerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEBuilderItemsSpawnManagerSettings>();
	}
};

// Class UWESpawnSystems.UWEManagedBuilderItemComponent
// 0x0000 (0x00C0 - 0x00C0)
class UUWEManagedBuilderItemComponent final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEManagedBuilderItemComponent">();
	}
	static class UUWEManagedBuilderItemComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEManagedBuilderItemComponent>();
	}
};

// Class UWESpawnSystems.UWESpawnSystemStatics
// 0x0000 (0x0028 - 0x0028)
class UUWESpawnSystemStatics final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESpawnSystemStatics">();
	}
	static class UUWESpawnSystemStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESpawnSystemStatics>();
	}
};

}

