#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWESculpturalBase

#include "Basic.hpp"

#include "UWEMath_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UWEActorUID_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum UWESculpturalBase.EUWECellOccupancyOverride
// NumValues: 0x0004
enum class EUWECellOccupancyOverride : uint8
{
	NotOverridden                            = 0,
	Overridden_Unoccupied                    = 1,
	Overridden_Occupied                      = 2,
	EUWECellOccupancyOverride_MAX            = 3,
};

// Enum UWESculpturalBase.EUWEProxyUpdateType
// NumValues: 0x0006
enum class EUWEProxyUpdateType : uint8
{
	None                                     = 0,
	InitializeProxy                          = 1,
	InitializeStaticProxy                    = 2,
	ApplyEdit                                = 3,
	ShowFeedback                             = 4,
	EUWEProxyUpdateType_MAX                  = 5,
};

// Enum UWESculpturalBase.EUWEMeshType
// NumValues: 0x0004
enum class EUWEMeshType : uint8
{
	None                                     = 0,
	Internal                                 = 1,
	External                                 = 2,
	EUWEMeshType_MAX                         = 3,
};

// Enum UWESculpturalBase.EUWESculptLocation
// NumValues: 0x0006
enum class EUWESculptLocation : uint8
{
	None                                     = 0,
	Floor                                    = 1,
	Wall                                     = 2,
	Ceiling                                  = 4,
	Floating                                 = 8,
	EUWESculptLocation_MAX                   = 9,
};

// Enum UWESculpturalBase.EUWEEditActionLegality
// NumValues: 0x0010
enum class EUWEEditActionLegality : uint8
{
	Illegal_NoValidCells                     = 0,
	Illegal_BlockedByLock                    = 1,
	Illegal_BlockedByHardLock                = 2,
	Illegal_BrushTypeMismatch                = 3,
	Illegal_BlockedByCollision               = 4,
	Illegal_EmptySelection                   = 5,
	Illegal_OversizedSelection               = 6,
	Illegal_ExceedsGlobalMaxCellCount        = 7,
	Illegal_BlockedByOccupancyChange         = 8,
	Illegal_BlockedByUnsupportedCells        = 9,
	Illegal_ModifyingArchivedCellsNoValidCells = 10,
	Illegal_ModifyingArchivedCells           = 11,
	Illegal_InvalidSupports                  = 12,
	Invalid_NotYetCalculated                 = 13,
	Success                                  = 14,
	EUWEEditActionLegality_MAX               = 15,
};

// Enum UWESculpturalBase.EUWEEditActionDisplayMethod
// NumValues: 0x0004
enum class EUWEEditActionDisplayMethod : uint8
{
	ShowChangedAsResultant                   = 0,
	ShowEditedAsCurrent                      = 1,
	ShowChangedAsCurrent                     = 2,
	EUWEEditActionDisplayMethod_MAX          = 3,
};

// Enum UWESculpturalBase.EEditActionSolveState
// NumValues: 0x0004
enum class EEditActionSolveState : uint8
{
	None                                     = 0,
	InProgress                               = 1,
	Complete                                 = 2,
	EEditActionSolveState_MAX                = 3,
};

// Enum UWESculpturalBase.EUWEModuleGhostShowCondition
// NumValues: 0x0006
enum class EUWEModuleGhostShowCondition : uint8
{
	None                                     = 0,
	Grow                                     = 1,
	Shrink                                   = 2,
	BuiltFromInside                          = 4,
	Persistent                               = 8,
	EUWEModuleGhostShowCondition_MAX         = 9,
};

// Enum UWESculpturalBase.EUWECellOccupancyRequirement
// NumValues: 0x0004
enum class EUWECellOccupancyRequirement : uint8
{
	Empty                                    = 0,
	Occupied                                 = 1,
	Any                                      = 2,
	EUWECellOccupancyRequirement_MAX         = 3,
};

// Enum UWESculpturalBase.EUWECellOccupancyRequirements
// NumValues: 0x0006
enum class EUWECellOccupancyRequirements : uint8
{
	MustNotExist                             = 0,
	MustExistCanBeOccupied                   = 1,
	MustExistMustBeOccupied                  = 2,
	MustExistMustNotBeOccupied               = 3,
	None                                     = 4,
	EUWECellOccupancyRequirements_MAX        = 5,
};

// Enum UWESculpturalBase.EUWEBuilderRemovalMode
// NumValues: 0x0004
enum class EUWEBuilderRemovalMode : uint8
{
	None                                     = 0,
	Creature                                 = 1,
	Prop                                     = 2,
	EUWEBuilderRemovalMode_MAX               = 3,
};

// Enum UWESculpturalBase.EUWESelectionAxisBitflag
// NumValues: 0x0004
enum class EUWESelectionAxisBitflag : uint8
{
	None                                     = 0,
	X                                        = 1,
	Y                                        = 2,
	EUWESelectionAxisBitflag_MAX             = 3,
};

// Enum UWESculpturalBase.EUWESelectionNormal
// NumValues: 0x0005
enum class EUWESelectionNormal : uint8
{
	ExteriorNormal                           = 0,
	InteriorNormal                           = 1,
	PlayerLookDirAlignedNormal               = 2,
	PlayerLookDirOpposedNormal               = 3,
	EUWESelectionNormal_MAX                  = 4,
};

// Enum UWESculpturalBase.EUWESelectionYAxis
// NumValues: 0x0003
enum class EUWESelectionYAxis : uint8
{
	GridAlignedPlayerUp                      = 0,
	WorldUp                                  = 1,
	EUWESelectionYAxis_MAX                   = 2,
};

// Enum UWESculpturalBase.EUWEBaseLockFlags
// NumValues: 0x0006
enum class EUWEBaseLockFlags : uint8
{
	UWEBaseLockFlags_None                    = 0,
	UWEBaseLockFlags_ShouldHide              = 1,
	UWEBaseLockFlags_Hard                    = 2,
	UWEBaseLockFlags_EmbeddedActor           = 4,
	UWEBaseLockFlags_ShowLockedDecoratorsAsGhost = 8,
	UWEBaseLockFlags_MAX                     = 9,
};

// Enum UWESculpturalBase.ESculpturalCellFlags
// NumValues: 0x0006
enum class ESculpturalCellFlags : uint8
{
	ESCF_None                                = 0,
	ESCF_Deleted                             = 1,
	ESCF_Occupied                            = 2,
	ESCF_IgnoreBrushTypeForDeconstruct       = 4,
	ESCF_Archived                            = 8,
	ESCF_MAX                                 = 9,
};

// Enum UWESculpturalBase.EUWECellBorderShowMode
// NumValues: 0x000C
enum class EUWECellBorderShowMode : uint8
{
	DoNotShow                                = 0,
	Simple                                   = 1,
	BrushType                                = 2,
	Section                                  = 3,
	Occupancy                                = 4,
	Structure                                = 5,
	Locked                                   = 6,
	RenderProxyHandle                        = 7,
	ISMAssignment                            = 8,
	InteriorCorners                          = 9,
	Archive                                  = 10,
	EUWECellBorderShowMode_MAX               = 11,
};

// Enum UWESculpturalBase.EUWECellRotationShowMode
// NumValues: 0x0004
enum class EUWECellRotationShowMode : uint8
{
	DoNotShow                                = 0,
	Final                                    = 1,
	FacingDirection                          = 2,
	EUWECellRotationShowMode_MAX             = 3,
};

// ScriptStruct UWESculpturalBase.UWESculpturalBaseCellCost
// 0x0030 (0x0030 - 0x0000)
struct FUWESculpturalBaseCellCost final
{
public:
	TSoftObjectPtr<class UUWEItemType>            ItemType;                                          // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cost;                                              // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.BrushTypeCost
// 0x0010 (0x0010 - 0x0000)
struct FBrushTypeCost final
{
public:
	TArray<struct FUWESculpturalBaseCellCost>     Costs;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWEPlacementArrowOffsets
// 0x0030 (0x0030 - 0x0000)
struct FUWEPlacementArrowOffsets final
{
public:
	struct FVector                                ExteriorOffset;                                    // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InteriorOffset;                                    // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWEBrushTypeSettings
// 0x0070 (0x0070 - 0x0000)
struct FUWEBrushTypeSettings final
{
public:
	struct FBrushTypeCost                         BrushTypeCost;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                         TimePerCell;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   NounText;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         SnappedPlacementFloorOffset;                       // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FlexibleFloorHeight;                               // 0x002C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         CeilingOffset;                                     // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IgnoreFloorBoundariesForSolve;                     // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWEPlacementArrowOffsets              PlacementArrowOffsets;                             // 0x0038(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ShowFeedbackWhenInvalid;                           // 0x0068(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowAutomaticPreviewArrows;                        // 0x0069(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AlwaysUseFullCellForOverlap;                       // 0x006A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsesFacingDirectionsForSolve;                      // 0x006B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableDefaultOverlap;                             // 0x006C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAdditive;                                        // 0x006D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWERemovedProp
// 0x0020 (0x0020 - 0x0000)
struct FUWERemovedProp final
{
public:
	class FString                                 LevelName;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorName;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWENonGenerativeBaseModuleVariant
// 0x0010 (0x0010 - 0x0000)
struct FUWENonGenerativeBaseModuleVariant final
{
public:
	TArray<class UStaticMesh*>                    Meshes;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWEBaseModuleHeightVariant
// 0x0018 (0x0018 - 0x0000)
struct FUWEBaseModuleHeightVariant final
{
public:
	int32                                         HeightWithinLevel;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MainLevelRoom;                                     // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FUWENonGenerativeBaseModuleVariant> VariantMeshes;                                 // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWEStructure
// 0x0010 (0x0010 - 0x0000)
struct FUWEStructure final
{
public:
	uint32                                        StructureId;                                       // 0x0000(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CellCount;                                         // 0x0004(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEPowerSystemComponent*               PowerSystem;                                       // 0x0008(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWEDecoratorMatch
// 0x0040 (0x0040 - 0x0000)
struct FUWEDecoratorMatch final
{
public:
	uint32                                        ID;                                                // 0x0000(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEBaseDecorator*                      DecoratorData;                                     // 0x0008(0x0008)(ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWERightAngleRotator                  MatchRotation;                                     // 0x0010(0x0004)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             OriginCell;                                        // 0x0014(0x000C)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FIntVector>                     MatchCells;                                        // 0x0020(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	struct FUWEActorUID                           ActorID;                                           // 0x0030(0x0010)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWESupportOverride
// 0x0060 (0x0060 - 0x0000)
struct FUWESupportOverride final
{
public:
	TSoftClassPtr<class UClass>                   SupportActor;                                      // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  RelativeRotation;                                  // 0x0040(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWESupportOverrides
// 0x0010 (0x0010 - 0x0000)
struct FUWESupportOverrides final
{
public:
	TArray<struct FUWESupportOverride>            Overrides;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWEBaseMaterialOverride
// 0x0068 (0x0068 - 0x0000)
struct FUWEBaseMaterialOverride final
{
public:
	TSet<struct FIntVector>                       Cells;                                             // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	bool                                          Hide;                                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     Material;                                          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     OverlayMaterial;                                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWEBaseMaterialOverrideList
// 0x0020 (0x0020 - 0x0000)
struct FUWEBaseMaterialOverrideList final
{
public:
	TArray<struct FUWEBaseMaterialOverride>       Overrides;                                         // 0x0000(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWESculpturalEditGhostMaterialGroup
// 0x0080 (0x0080 - 0x0000)
struct FUWESculpturalEditGhostMaterialGroup final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      ExteriorMaterial;                                  // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      InteriorMaterial;                                  // 0x0028(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      OverlayMaterial;                                   // 0x0050(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldHighlightOnHover;                            // 0x0078(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWEGridPartitionHandle
// 0x0080 (0x0080 - 0x0000)
struct FUWEGridPartitionHandle final
{
public:
	uint8                                         Pad_0[0x80];                                       // 0x0000(0x0080)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWEDeconstructGroupKey
// 0x0014 (0x0014 - 0x0000)
struct FUWEDeconstructGroupKey final
{
public:
	struct FGameplayTag                           BrushType;                                         // 0x0000(0x0008)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FloorID;                                           // 0x0008(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeconstructID;                                     // 0x000C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsArchived;                                        // 0x0010(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWEGreedyMeshPartition
// 0x0020 (0x0020 - 0x0000)
struct FUWEGreedyMeshPartition final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWEDeconstructGroup
// 0x0018 (0x0018 - 0x0000)
struct FUWEDeconstructGroup final
{
public:
	struct FUWECoordinateSet                      Cells;                                             // 0x0000(0x0010)(SaveGame, NativeAccessSpecifierPublic)
	uint32                                        ID;                                                // 0x0010(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWEDeconstructGroups
// 0x0010 (0x0010 - 0x0000)
struct FUWEDeconstructGroups final
{
public:
	TArray<struct FUWEDeconstructGroup>           Groups;                                            // 0x0000(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWESelectionSize
// 0x000C (0x000C - 0x0000)
struct FUWESelectionSize final
{
public:
	int32                                         X;                                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Y;                                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EditDepth;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWESelectionOverride
// 0x0060 (0x0060 - 0x0000)
struct FUWESelectionOverride final
{
public:
	bool                                          OverrideHitCoords;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FIntVector                             HitCoords;                                         // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideNormal;                                    // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FIntVector                             Normal;                                            // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideSelectionSize;                             // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWESelectionSize                      SelectionSizeOverride;                             // 0x0024(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          OverridePieceRotation;                             // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRotator                               PieceRotation;                                     // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          OverridePieceOrigin;                               // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FIntVector                             PieceOriginCoords;                                 // 0x0054(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.LockedCellGroup
// 0x0068 (0x0068 - 0x0000)
struct FLockedCellGroup final
{
public:
	TSet<struct FIntVector>                       LockedCells;                                       // 0x0000(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	uint8                                         Flags;                                             // 0x0050(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGuid                                  LockOwner;                                         // 0x0054(0x0010)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssociatedInventoryID;                             // 0x0064(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.PropList
// 0x0010 (0x0010 - 0x0000)
struct FPropList final
{
public:
	TArray<class FString>                         PropNames;                                         // 0x0000(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWEModuleGhostMesh
// 0x00A0 (0x00A0 - 0x0000)
struct FUWEModuleGhostMesh final
{
public:
	TSoftObjectPtr<class UStaticMesh>             Mesh;                                              // 0x0000(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             Transform;                                         // 0x0030(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ShowCondition;                                     // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0xF];                                       // 0x0091(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWEBaseModulePieceID
// 0x0018 (0x0018 - 0x0000)
struct FUWEBaseModulePieceID final
{
public:
	class UUWEBaseModule*                         Module;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             Coords;                                            // 0x0008(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWEModuleMatch
// 0x0030 (0x0030 - 0x0000)
struct FUWEModuleMatch final
{
public:
	struct FUWEBaseModulePieceID                  PieceId;                                           // 0x0000(0x0018)(Edit, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct UWESculpturalBase.UWEAdjacentModuleRules
// 0x0028 (0x0028 - 0x0000)
struct FUWEAdjacentModuleRules final
{
public:
	EUWECellOccupancyRequirements                 OccupancyRequirements;                             // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FUWEModuleMatch>                AllowedMatches;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FUWEModuleMatch>                ProhibitedMatches;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWECellSerializationContext
// 0x00B8 (0x00B8 - 0x0000)
struct FUWECellSerializationContext final
{
public:
	TArray<class UUWEBaseModule*>                 ModuleArray;                                       // 0x0000(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, uint16>             BrushTypeTagIds;                                   // 0x0010(0x0050)(SaveGame, NativeAccessSpecifierPrivate)
	TMap<uint16, struct FGameplayTag>             BrushTypeIdTags;                                   // 0x0060(0x0050)(SaveGame, NativeAccessSpecifierPrivate)
	uint32                                        Version;                                           // 0x00B0(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWEBaseModulePiece
// 0x0080 (0x0080 - 0x0000)
struct FUWEBaseModulePiece final
{
public:
	struct FUWEBaseModulePieceID                  ID;                                                // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           BrushType;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeconstructID;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             FacingDirection;                                   // 0x0024(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FIntVector, struct FUWEAdjacentModuleRules> Rules;                                   // 0x0030(0x0050)(NativeAccessSpecifierPrivate)
};

// ScriptStruct UWESculpturalBase.UWERuntimeBaseModulePieceID
// 0x0018 (0x0018 - 0x0000)
struct FUWERuntimeBaseModulePieceID final
{
public:
	class UUWEBaseModule*                         Module;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntVector                             Coords;                                            // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        ComputedHash;                                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct UWESculpturalBase.UWERuntimeModuleMatch
// 0x0020 (0x0020 - 0x0000)
struct FUWERuntimeModuleMatch final
{
public:
	struct FUWERuntimeBaseModulePieceID           PieceId;                                           // 0x0000(0x0018)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUWERightAngleRotator                  Rotation;                                          // 0x0018(0x0004)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        ComputedHash;                                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct UWESculpturalBase.UWESculpturalBaseCell
// 0x0060 (0x0060 - 0x0000)
struct FUWESculpturalBaseCell final
{
public:
	struct FIntVector                             Coords;                                            // 0x0000(0x000C)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           BrushType;                                         // 0x000C(0x0008)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FGameplayTag>                   BaseBrushType;                                     // 0x0018(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	uint8                                         Flags;                                             // 0x0028(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         StructureId;                                       // 0x0029(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         VariantIndex;                                      // 0x002A(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         DeconstructIDOverride;                             // 0x002B(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWECellOccupancyOverride                     OccupancyOverride;                                 // 0x002C(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWERuntimeModuleMatch                 ModuleMatch;                                       // 0x0030(0x0020)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             FacingDirection;                                   // 0x0050(0x000C)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SupportAmount;                                     // 0x005C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWERuntimeAdjacentModuleRules
// 0x0028 (0x0028 - 0x0000)
struct FUWERuntimeAdjacentModuleRules final
{
public:
	EUWECellOccupancyRequirements                 OccupancyRequirements;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FUWERuntimeModuleMatch>         AllowedMatches;                                    // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FUWERuntimeModuleMatch>         ProhibitedMatches;                                 // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.SerializedSlotRules
// 0x0038 (0x0038 - 0x0000)
struct FSerializedSlotRules final
{
public:
	struct FIntVector                             Slot;                                              // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWERuntimeAdjacentModuleRules         Rules;                                             // 0x0010(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.SerializedEditAction
// 0x0028 (0x0028 - 0x0000)
struct FSerializedEditAction final
{
public:
	TSubclassOf<class UObject>                    EditActionClass;                                   // 0x0000(0x0008)(ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  BaseGUID;                                          // 0x0008(0x0010)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 BinaryData;                                        // 0x0018(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWESelectionBrush
// 0x0078 (0x0078 - 0x0000)
struct FUWESelectionBrush final
{
public:
	TArray<struct FIntVector>                     BrushSizes;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ForwardOffset;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseWorldUpForZ;                                    // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseTraceDirForX;                                   // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RequireFullSelectionX;                             // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RequireFullSelectionY;                             // 0x0017(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RequireFullSelectionZ;                             // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LimitToFlatSurfaces;                               // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LimitToSameBrushType;                              // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LimitToSameSection;                                // 0x001B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LimitToSameOccupancy;                              // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LimitToSpecifiedHeightInFloor;                     // 0x001D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	TSet<int32>                                   SpecifiedHeights;                                  // 0x0020(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          UseHitAsXCenter;                                   // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PlaceInitialPiece;                                 // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWESelectionData
// 0x00D0 (0x00D0 - 0x0000)
struct FUWESelectionData final
{
public:
	TWeakObjectPtr<class AUWESculpturalBaseActor> base;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWESelectionBrush                     Brush;                                             // 0x0008(0x0078)(NativeAccessSpecifierPublic)
	int32                                         BrushSizeIndex;                                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BiasRight;                                         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BiasUp;                                            // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BiasFwd;                                           // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	struct FIntVector                             UnsnappedOriginCoords;                             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             OriginCoords;                                      // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Version;                                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             RightAxis;                                         // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             UpAxis;                                            // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             OutsideNormalAxis;                                 // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWEStableIndexISM
// 0x0020 (0x0020 - 0x0000)
struct FUWEStableIndexISM final
{
public:
	class UInstancedStaticMeshComponent*          ISM;                                               // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8[0x18];                                       // 0x0008(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWECellUpdateList
// 0x0148 (0x0148 - 0x0000)
struct FUWECellUpdateList final
{
public:
	TSet<struct FIntVector>                       DirtyCells;                                        // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TSet<struct FIntVector>                       ModifiedCells;                                     // 0x0050(0x0050)(NativeAccessSpecifierPublic)
	TSet<struct FIntVector>                       AddedCells;                                        // 0x00A0(0x0050)(NativeAccessSpecifierPublic)
	TSet<struct FIntVector>                       RemovedCells;                                      // 0x00F0(0x0050)(NativeAccessSpecifierPublic)
	bool                                          DisconnectedStructure;                             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWESelectionParams
// 0x0048 (0x0048 - 0x0000)
struct FUWESelectionParams final
{
public:
	TArray<struct FUWESelectionSize>              SelectionSizes;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         DefaultSelectionSizeIndex;                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWESelectionNormal                           UsedNormal;                                        // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWESelectionYAxis                            UsedYAxis;                                         // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         RequireFullSelection;                              // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LimitToFlatSurfaces;                               // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ExcludeInteriorCorners;                            // 0x001D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ExcludeSpecifiedModules;                           // 0x001E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UUWEBaseModule*>                 ExcludedModules;                                   // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          LimitToOccupied;                                   // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LimitToSameBrushType;                              // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LimitToSameFloor;                                  // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LimitToSpecifiedHeightInFloor;                     // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<int32>                                 SpecifiedHeights;                                  // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWEUnsupportedIndicator
// 0x0090 (0x0090 - 0x0000)
struct FUWEUnsupportedIndicator final
{
public:
	TSoftObjectPtr<class UStaticMesh>             Mesh;                                              // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             Transform;                                         // 0x0030(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWESculpturalBase.UWEAllowedPieces
// 0x0028 (0x0028 - 0x0000)
struct FUWEAllowedPieces final
{
public:
	TArray<struct FUWEModuleMatch>                ValidMatches;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          AllowEmpty;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           AllowAnyOfBrushType;                               // 0x0014(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DecoratorCell;                                     // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         ModuleMeshesToHide;                                // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWESculpturalBase.UWEDecoratorMesh
// 0x0060 (0x0060 - 0x0000)
struct FUWEDecoratorMesh final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideHoldingCell;                               // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FIntVector                             HoldingCell;                                       // 0x000C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Translation;                                       // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  Rotation;                                          // 0x0030(0x0020)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowInGhost;                                       // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

