#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWESkeletalMeshScalability

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UWESkeletalMeshScalability_structs.hpp"
#include "AnimationBudgetAllocator_classes.hpp"
#include "UWETickAggregation_classes.hpp"


namespace SDK
{

// Class UWESkeletalMeshScalability.UWESkeletalMeshComponentManaged
// 0x0028 (0x1050 - 0x1028)
class UUWESkeletalMeshComponentManaged final : public USkeletalMeshComponentBudgeted
{
public:
	int32                                         RelevancyPriorityBias;                             // 0x1028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESkeletalMeshScalabilityGroup                 ScalabilityGroup;                                  // 0x102C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_102D[0x3];                                     // 0x102D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         SkeletalMeshMaxDrawSignificanceTreshold;           // 0x1030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoingReducedWork;                                 // 0x1034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1035[0x3];                                     // 0x1035(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         ReducedWork_ComponentTicksPerSecond;               // 0x1038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReducedWork_UpdateRate;                            // 0x103C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReducedWork_EvaluationRate;                        // 0x1040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReducedWork_BaseNonRenderedUpdateRate;             // 0x1044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReducedWork_SimulatePhysics;                       // 0x1048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1049[0x7];                                     // 0x1049(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool IsShowingSkeletal() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESkeletalMeshComponentManaged">();
	}
	static class UUWESkeletalMeshComponentManaged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESkeletalMeshComponentManaged>();
	}
};

// Class UWESkeletalMeshScalability.UWESkeletalMeshComponentTicker
// 0x0058 (0x0388 - 0x0330)
class AUWESkeletalMeshComponentTicker final : public AUWEAggregatedComponentTickerBase
{
public:
	TSet<class UUWESkeletalMeshComponentManaged*> Components;                                        // 0x0330(0x0050)(ExportObject, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESkeletalMeshComponentTicker">();
	}
	static class AUWESkeletalMeshComponentTicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWESkeletalMeshComponentTicker>();
	}
};

// Class UWESkeletalMeshScalability.UWESkeletalMeshScalabilityInterface
// 0x0000 (0x0000 - 0x0000)
class IUWESkeletalMeshScalabilityInterface final
{
public:
	void HideSkeletalMesh();
	void ShowSkeletalMesh();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESkeletalMeshScalabilityInterface">();
	}
	static class IUWESkeletalMeshScalabilityInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUWESkeletalMeshScalabilityInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

}

