#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWESubmarine

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "UWEAlerts_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class UWESubmarine.UWECompartmentConnector
// 0x0038 (0x02E8 - 0x02B0)
class AUWECompartmentConnector final : public AActor
{
public:
	class UBoxComponent*                          Connection;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnConnectionChanged;                               // 0x02B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         WaterThroughPut;                                   // 0x02C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UUWESubmarineCompartment*>       ConnectingCompartments;                            // 0x02D0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bIsOpen;                                           // 0x02E0(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRep_IsOpen();
	void SetIsOpen(bool bInIsOpen);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWECompartmentConnector">();
	}
	static class AUWECompartmentConnector* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWECompartmentConnector>();
	}
};

// Class UWESubmarine.UWESubmarine
// 0x0078 (0x0328 - 0x02B0)
class AUWESubmarine : public AActor
{
public:
	class UUWESubmarineAlertStatusHandler*        SubmarineAlertStatusHandler;                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   HullMesh;                                          // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEAISpeakerComponent*                 AISpeakerComponent;                                // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWESubmarineMovementComponent*         SubmarineMovement;                                 // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEMovementSetComponent*               MovementSetComponent;                              // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEMechanicalSetComponent*             MechanicalSetComponent;                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWESubmarinePilotComponent*            PilotComponent;                                    // 0x02E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UUWESubmarinePilotComponent* PilotComponent)> OnPilotChanged; // 0x02E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bControlled;                                       // 0x02F8(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bControllingAllowed;                               // 0x02F9(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEPawnAttachmentOwner*                AttachmentOwnerComponent;                          // 0x0300(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   MovementCollision;                                 // 0x0308(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVolumeTrackerComponent*                VolumeTracker;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWENetworkSmoothingComponent*          NetworkSmoothingComponent;                         // 0x0318(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PilotAttachSlot;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void AttachPilot(class APawn* Pilot);
	void DefloodAll();
	void DetachPilot(class APawn* Pilot);
	void OnEnergyEmpty(class AActor* Who);
	void OnEnergyRefilled(class AActor* Who);
	void RepairAll();
	void UpdateMaxSpeed();
	void Wreck();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESubmarine">();
	}
	static class AUWESubmarine* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWESubmarine>();
	}
};

// Class UWESubmarine.UWESubmarineAlertStatusHandler
// 0x0008 (0x00C8 - 0x00C0)
class UUWESubmarineAlertStatusHandler final : public UUWEAlertStatusHandler
{
public:
	class UUWESubmarineMovementComponent*         SubmarineMovement;                                 // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnCollisionImminent(bool bNewCollisionImminent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESubmarineAlertStatusHandler">();
	}
	static class UUWESubmarineAlertStatusHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESubmarineAlertStatusHandler>();
	}
};

// Class UWESubmarine.UWESubmarineCompartment
// 0x0088 (0x05F0 - 0x0568)
class UUWESubmarineCompartment final : public UBoxComponent
{
public:
	struct FGameplayTag                           SubsystemTag;                                      // 0x0568(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AUWECompartmentConnector*>       Connectors;                                        // 0x0570(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bOverrideLeaking;                                  // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(float NewFloodLevel)> OnFloodLevelChanged;                         // 0x0588(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	double                                        CompartmentVolume;                                 // 0x0598(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        WaterVolume;                                       // 0x05A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WaterThroughPut;                                   // 0x05A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FloodLevel;                                        // 0x05AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BaseLightIntensity;                                // 0x05B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEMechanicalSetComponent*             MechanicalComponent;                               // 0x05B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ULightComponent*>                Lights;                                            // 0x05C0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class ULightComponent*>                SubmergedLights;                                   // 0x05D0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class AActor*                                 WaterVolumeActor;                                  // 0x05E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5E8[0x8];                                      // 0x05E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	float AddWaterVolume(float InWaterVolume);
	void OnEnergyEmpty(class AActor* Who);
	void OnEnergyRefilled(class AActor* Who);
	void OnRep_FloodLevel();
	void SetFloodLevel(float InFloodLevel);
	void SetWaterVolume(float InWaterVolume);

	float GetCompartmentVolume() const;
	float GetFloodLevel() const;
	float GetWaterVolume() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESubmarineCompartment">();
	}
	static class UUWESubmarineCompartment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESubmarineCompartment>();
	}
};

// Class UWESubmarine.UWESubmarineModuleSettings
// 0x0028 (0x0050 - 0x0028)
class UUWESubmarineModuleSettings final : public UObject
{
public:
	TSoftClassPtr<class UClass>                   InteriorWaterVolumeClass;                          // 0x0028(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESubmarineModuleSettings">();
	}
	static class UUWESubmarineModuleSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESubmarineModuleSettings>();
	}
};

// Class UWESubmarine.UWESubmarinePilotComponent
// 0x0050 (0x0110 - 0x00C0)
class UUWESubmarinePilotComponent final : public UActorComponent
{
public:
	class UUWESubmarineMovementComponent*         SubmarineMovement;                                 // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x40];                                      // 0x00C8(0x0040)(Fixing Size After Last Property [ Dumper-8 ])
	class AUWESubmarine*                          Submarine;                                         // 0x0108(0x0008)(Edit, Net, ZeroConstructor, EditConst, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_Submarine(class AUWESubmarine* OldSubmarine);
	void RequestartPiloting(class AUWESubmarine* InSubmarine);
	void RequestStopPiloting(const TArray<struct FVector>& RequestedEjectLocations);
	void SubmitControl(int8 InYawControl, const struct FVector& InDirectionControl);

	class AUWESubmarine* GetSubmarine() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESubmarinePilotComponent">();
	}
	static class UUWESubmarinePilotComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESubmarinePilotComponent>();
	}
};

}

