#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWESaveSystem

#include "Basic.hpp"

#include "UWESaveSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UWESonarAPI_structs.hpp"


namespace SDK::Params
{

// Function UWESaveSystem.UWESaveCommunicationComponent.AsyncSaveGameCompleted
// 0x0001 (0x0001 - 0x0000)
struct UWESaveCommunicationComponent_AsyncSaveGameCompleted final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveCommunicationComponent.AutoSaveCompleted
// 0x0001 (0x0001 - 0x0000)
struct UWESaveCommunicationComponent_AutoSaveCompleted final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveCommunicationComponent.CheckIsSavingBlocked
// 0x0010 (0x0010 - 0x0000)
struct UWESaveCommunicationComponent_CheckIsSavingBlocked final
{
public:
	TDelegate<void(bool Result)>                  InDelegate;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveCommunicationComponent.ClientReceiveDoesSaveGameExist
// 0x0001 (0x0001 - 0x0000)
struct UWESaveCommunicationComponent_ClientReceiveDoesSaveGameExist final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveCommunicationComponent.ClientReceiveIsSavingBlocked
// 0x0001 (0x0001 - 0x0000)
struct UWESaveCommunicationComponent_ClientReceiveIsSavingBlocked final
{
public:
	bool                                          IsBlocked;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveCommunicationComponent.ClientReceiveSaveSlotsMatchingCurrentContext
// 0x0010 (0x0010 - 0x0000)
struct UWESaveCommunicationComponent_ClientReceiveSaveSlotsMatchingCurrentContext final
{
public:
	TArray<struct FUWESlotInfoSimple>             SaveSlots;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveCommunicationComponent.OnMetaDataScanComplete
// 0x0010 (0x0010 - 0x0000)
struct UWESaveCommunicationComponent_OnMetaDataScanComplete final
{
public:
	TArray<struct FUWESaveGameCollectionInfo>     SaveInfos;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveCommunicationComponent.ServerRequestDoesSaveGameExist
// 0x0010 (0x0010 - 0x0000)
struct UWESaveCommunicationComponent_ServerRequestDoesSaveGameExist final
{
public:
	class FString                                 SaveSlot;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveCommunicationComponent.ServerRequestLoadForSaveId
// 0x0010 (0x0010 - 0x0000)
struct UWESaveCommunicationComponent_ServerRequestLoadForSaveId final
{
public:
	class FString                                 SaveId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveCommunicationComponent.ServerRequestStoreForSaveId
// 0x0010 (0x0010 - 0x0000)
struct UWESaveCommunicationComponent_ServerRequestStoreForSaveId final
{
public:
	class FString                                 SaveId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveCommunicationComponent.TriggerAsyncAutoSaveGame
// 0x0001 (0x0001 - 0x0000)
struct UWESaveCommunicationComponent_TriggerAsyncAutoSaveGame final
{
public:
	bool                                          bForce;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveCommunicationComponent.TriggerAsyncSaveGame
// 0x0001 (0x0001 - 0x0000)
struct UWESaveCommunicationComponent_TriggerAsyncSaveGame final
{
public:
	EUWESaveGameCollectionIndex                   Index_0;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGame.GetLatestVersion
// 0x0004 (0x0004 - 0x0000)
struct UWESaveGame_GetLatestVersion final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGame.GetMinSupportedVersion
// 0x0004 (0x0004 - 0x0000)
struct UWESaveGame_GetMinSupportedVersion final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGame.GetTimeStamp
// 0x0008 (0x0008 - 0x0000)
struct UWESaveGame_GetTimeStamp final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGame.GetValidityFromVersion
// 0x0008 (0x0008 - 0x0000)
struct UWESaveGame_GetValidityFromVersion final
{
public:
	int32                                         Version;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWESaveGameValidity                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveGame.SetIsMultiplayer
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGame_SetIsMultiplayer final
{
public:
	bool                                          IsMultiplayer;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGame.GetIsMultiplayer
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGame_GetIsMultiplayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGame.GetSlotName
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGame_GetSlotName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollection.GetLatestVersion
// 0x0004 (0x0004 - 0x0000)
struct UWESaveGameCollection_GetLatestVersion final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollection.GetMinSupportedVersion
// 0x0004 (0x0004 - 0x0000)
struct UWESaveGameCollection_GetMinSupportedVersion final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollection.GetValidityFromVersion
// 0x0008 (0x0008 - 0x0000)
struct UWESaveGameCollection_GetValidityFromVersion final
{
public:
	int32                                         Version;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWESaveGameValidity                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveGameCollectionInfoListViewModel.DeleteGame
// 0x0020 (0x0020 - 0x0000)
struct UWESaveGameCollectionInfoListViewModel_DeleteGame final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SaveId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollectionInfoListViewModel.RefreshAsync
// 0x0020 (0x0020 - 0x0000)
struct UWESaveGameCollectionInfoListViewModel_RefreshAsync final
{
public:
	class FString                                 LevelName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnRefreshCompleted;                                // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollectionInfoListViewModel.GetLatestSaveSlot
// 0x0028 (0x0028 - 0x0000)
struct UWESaveGameCollectionInfoListViewModel_GetLatestSaveSlot final
{
public:
	class FString                                 LevelName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SlotName;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWESaveGameValidity                          IsValid;                                           // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMultiplayer;                                    // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveGameCollectionInfoListViewModel.GetNumAllSaveEntries
// 0x0004 (0x0004 - 0x0000)
struct UWESaveGameCollectionInfoListViewModel_GetNumAllSaveEntries final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollectionInfoListViewModel.GetNumMultiPlayerEntries
// 0x0004 (0x0004 - 0x0000)
struct UWESaveGameCollectionInfoListViewModel_GetNumMultiPlayerEntries final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollectionInfoListViewModel.GetNumSaveEntries
// 0x0008 (0x0008 - 0x0000)
struct UWESaveGameCollectionInfoListViewModel_GetNumSaveEntries final
{
public:
	bool                                          bIsMultiplayer;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollectionInfoListViewModel.GetNumSinglePlayerEntries
// 0x0004 (0x0004 - 0x0000)
struct UWESaveGameCollectionInfoListViewModel_GetNumSinglePlayerEntries final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollectionInfoListViewModel.GetSlotPostFix
// 0x0008 (0x0008 - 0x0000)
struct UWESaveGameCollectionInfoListViewModel_GetSlotPostFix final
{
public:
	bool                                          bIsMultiplayer;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollectionInfoViewModel.AsyncSetCustomDisplayName
// 0x0020 (0x0020 - 0x0000)
struct UWESaveGameCollectionInfoViewModel_AsyncSetCustomDisplayName final
{
public:
	class FString                                 CustomName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSuccess, const class FString& Name)> OnSetNameComplete;                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollectionInfoViewModel.GetDefaultSaveInfo
// 0x0008 (0x0008 - 0x0000)
struct UWESaveGameCollectionInfoViewModel_GetDefaultSaveInfo final
{
public:
	class UUWESaveGameInfoViewModel*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollectionInfoViewModel.GetSaveInfoByIndex
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameCollectionInfoViewModel_GetSaveInfoByIndex final
{
public:
	EUWESaveGameCollectionIndex                   Index_0;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWESaveGameInfoViewModel*              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollectionInfoViewModel.GetNumSaves
// 0x0004 (0x0004 - 0x0000)
struct UWESaveGameCollectionInfoViewModel_GetNumSaves final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCollectionInfoViewModel.HasOnlyDefaultSave
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGameCollectionInfoViewModel_HasOnlyDefaultSave final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameCustomInfoBase.K2_GetLookupId
// 0x0008 (0x0008 - 0x0000)
struct UWESaveGameCustomInfoBase_K2_GetLookupId final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameDiagnostic.OnSaveCompleted
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGameDiagnostic_OnSaveCompleted final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameDownloadViewModel.Initialize
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameDownloadViewModel_Initialize final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveGameDownloadViewModel.OnDownloadCompleted
// 0x00B0 (0x00B0 - 0x0000)
struct UWESaveGameDownloadViewModel_OnDownloadCompleted final
{
public:
	struct FUWESaveGameDownloadStatus             Status;                                            // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FString                                 InSlotName;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSonarSaveUploadMetadata               InSaveMetaData;                                    // 0x0028(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameDownloadViewModel.OnDownloadProgress
// 0x0018 (0x0018 - 0x0000)
struct UWESaveGameDownloadViewModel_OnDownloadProgress final
{
public:
	float                                         InProgress;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	uint64                                        Sent;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Total;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameDownloadViewModel.StartDownload
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameDownloadViewModel_StartDownload final
{
public:
	class FString                                 SaveId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameInfoViewModel.GetCustomInfoViewModel
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameInfoViewModel_GetCustomInfoViewModel final
{
public:
	TSubclassOf<class UUWESaveGameCustomInfoBaseViewModel> ViewModelClass;                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWESaveGameCustomInfoBaseViewModel*    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameInfoViewModel.SetDisplayName
// 0x0018 (0x0018 - 0x0000)
struct UWESaveGameInfoViewModel_SetDisplayName final
{
public:
	class FString                                 InDisplayName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveGameInfoViewModel.GetDisplayName
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameInfoViewModel_GetDisplayName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameInfoViewModel.GetLastModified
// 0x0008 (0x0008 - 0x0000)
struct UWESaveGameInfoViewModel_GetLastModified final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameInfoViewModel.GetLevelName
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameInfoViewModel_GetLevelName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameInfoViewModel.GetSlotName
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameInfoViewModel_GetSlotName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameInfoViewModel.IsMultiplayerSave
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGameInfoViewModel_IsMultiplayerSave final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSharingSubsystem.DownloadSaveGameFromCloud
// 0x0108 (0x0108 - 0x0000)
struct UWESaveGameSharingSubsystem_DownloadSaveGameFromCloud final
{
public:
	struct FSonarSaveGameResponse                 DownloadResponse;                                  // 0x0000(0x00F8)(Parm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x00F8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSharingSubsystem.InternalDownloadAndImportCompleted
// 0x0128 (0x0128 - 0x0000)
struct UWESaveGameSharingSubsystem_InternalDownloadAndImportCompleted final
{
public:
	bool                                          bDownloadSucceeded;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSonarSaveGameResponse                 DownloadResponse;                                  // 0x0008(0x00F8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EUWEImportSaveGameResult                      ImportResult;                                      // 0x0100(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 SlotName;                                          // 0x0108(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SaveId;                                            // 0x0118(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSharingSubsystem.IsOperationPending
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGameSharingSubsystem_IsOperationPending final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSharingSubsystem.OnCancelSaveGameTransferCommand
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameSharingSubsystem_OnCancelSaveGameTransferCommand final
{
public:
	TArray<class FString>                         Args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSharingSubsystem.OnDownloadSaveGameCommand
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameSharingSubsystem_OnDownloadSaveGameCommand final
{
public:
	TArray<class FString>                         Args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSharingSubsystem.OnUploadSaveGameCommand
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameSharingSubsystem_OnUploadSaveGameCommand final
{
public:
	TArray<class FString>                         Args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSharingSubsystem.StartSaveGameDownload
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameSharingSubsystem_StartSaveGameDownload final
{
public:
	class FString                                 SaveId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSharingSubsystem.StartSaveGameUpload
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameSharingSubsystem_StartSaveGameUpload final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSharingSubsystem.UploadSaveGameToCloud
// 0x0108 (0x0108 - 0x0000)
struct UWESaveGameSharingSubsystem_UploadSaveGameToCloud final
{
public:
	struct FSonarSaveGameResponse                 UploadResponse;                                    // 0x0000(0x00F8)(Parm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x00F8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.AddSaveComponent
// 0x0018 (0x0018 - 0x0000)
struct UWESaveGameStatics_AddSaveComponent final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckAlreadyAdded;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWESaveComponent*                      ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.BlockSaving
// 0x0008 (0x0008 - 0x0000)
struct UWESaveGameStatics_BlockSaving final
{
public:
	bool                                          bShouldTrySaveBeforeBlocking;                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWESaveBlockingHandle                 ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.CalculateDisplayBytes
// 0x0020 (0x0020 - 0x0000)
struct UWESaveGameStatics_CalculateDisplayBytes final
{
public:
	int64                                         NumBytes;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutBytes;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 OutAbbrev;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.DataExistsForSaveHandle
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameStatics_DataExistsForSaveHandle final
{
public:
	const class UUWESaveHandle*                   Handle;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveGameStatics.EnableAutoSaveForTests
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGameStatics_EnableAutoSaveForTests final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.GetAllExistingSaveGames
// 0x0018 (0x0018 - 0x0000)
struct UWESaveGameStatics_GetAllExistingSaveGames final
{
public:
	TArray<class FString>                         SaveGames;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveGameStatics.GetCheckpointIndexAsString
// 0x0018 (0x0018 - 0x0000)
struct UWESaveGameStatics_GetCheckpointIndexAsString final
{
public:
	EUWESaveGameCollectionIndex                   Index_0;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.GetDisplayNameForSlot
// 0x0028 (0x0028 - 0x0000)
struct UWESaveGameStatics_GetDisplayNameForSlot final
{
public:
	class FString                                 InSlotName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWESaveSlotFilter                            Match;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.GetMaxSaveSlots
// 0x0004 (0x0004 - 0x0000)
struct UWESaveGameStatics_GetMaxSaveSlots final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.IsAutoSaveEnabled
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGameStatics_IsAutoSaveEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.IsAutoSaveEnabledForTests
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGameStatics_IsAutoSaveEnabledForTests final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.IsSaveSystemInitialized
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGameStatics_IsSaveSystemInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.IsSavingBlocked
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGameStatics_IsSavingBlocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.RegisterCustomSaveGameInfo
// 0x0010 (0x0010 - 0x0000)
struct UWESaveGameStatics_RegisterCustomSaveGameInfo final
{
public:
	class UUWESaveGameCustomInfoBase*             InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveGameStatics.SetAutoSaveEnabled
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGameStatics_SetAutoSaveEnabled final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.UnblockSaving
// 0x0008 (0x0008 - 0x0000)
struct UWESaveGameStatics_UnblockSaving final
{
public:
	struct FUWESaveBlockingHandle                 InHandle;                                          // 0x0000(0x0004)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bShouldTrySaveAfterUnblocking;                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveGameStatics.UnblockSavingWithDelegate
// 0x0018 (0x0018 - 0x0000)
struct UWESaveGameStatics_UnblockSavingWithDelegate final
{
public:
	struct FUWESaveBlockingHandle                 Handle;                                            // 0x0000(0x0004)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             Delegate;                                          // 0x0004(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldTrySaveAfterUnblocking;                     // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveGameStatics.UpdateCustomSaveGameInfo
// 0x0008 (0x0008 - 0x0000)
struct UWESaveGameStatics_UpdateCustomSaveGameInfo final
{
public:
	class UUWESaveGameCustomInfoBase*             InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameStatics.UpgradeSaveGameCollectionToLatest
// 0x00C0 (0x00C0 - 0x0000)
struct UWESaveGameStatics_UpgradeSaveGameCollectionToLatest final
{
public:
	struct FUWESaveGameCollectionInfo             Info;                                              // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(bool Result)>                  CompletedDelegate;                                 // 0x00B0(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSubsystem.GetLastSaveToDiscTimeStamp
// 0x0008 (0x0008 - 0x0000)
struct UWESaveGameSubsystem_GetLastSaveToDiscTimeStamp final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSubsystem.GetSaveInfoForSlot
// 0x00F0 (0x00F0 - 0x0000)
struct UWESaveGameSubsystem_GetSaveInfoForSlot final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWESaveSlotMetaData                   OutSaveGameInfo;                                   // 0x0010(0x00D8)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveGameSubsystem.GetAllSaveInfoForLevel
// 0x0020 (0x0020 - 0x0000)
struct UWESaveGameSubsystem_GetAllSaveInfoForLevel final
{
public:
	class FString                                 LevelName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FUWESaveGameCollectionInfo>     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSubsystem.GetLastModifiedSaveForLevel
// 0x0020 (0x0020 - 0x0000)
struct UWESaveGameSubsystem_GetLastModifiedSaveForLevel final
{
public:
	class FString                                 LevelName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameSubsystem.IsCurrentSaveDirty
// 0x0001 (0x0001 - 0x0000)
struct UWESaveGameSubsystem_IsCurrentSaveDirty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameUploadViewModel.Initialize
// 0x0018 (0x0018 - 0x0000)
struct UWESaveGameUploadViewModel_Initialize final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWESaveGameCollectionInfoViewModel*    ViewModel;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveGameUploadViewModel.OnUploadCompleted
// 0x0100 (0x0100 - 0x0000)
struct UWESaveGameUploadViewModel_OnUploadCompleted final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSonarSaveGameResponse                 Response;                                          // 0x0008(0x00F8)(Parm, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveGameUploadViewModel.OnUploadProgress
// 0x0018 (0x0018 - 0x0000)
struct UWESaveGameUploadViewModel_OnUploadProgress final
{
public:
	float                                         InProgress;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	uint64                                        Sent;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Total;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveHandle.HasData
// 0x0001 (0x0001 - 0x0000)
struct UWESaveHandle_HasData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveInProgressViewModel.OnAutoSaveFinished
// 0x0001 (0x0001 - 0x0000)
struct UWESaveInProgressViewModel_OnAutoSaveFinished final
{
public:
	bool                                          bInSaveResult;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveInProgressViewModel.OnManualSaveFinished
// 0x0001 (0x0001 - 0x0000)
struct UWESaveInProgressViewModel_OnManualSaveFinished final
{
public:
	bool                                          bInSaveResult;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveInProgressViewModel.ShouldPromptToSave
// 0x0010 (0x0010 - 0x0000)
struct UWESaveInProgressViewModel_ShouldPromptToSave final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWESaveSystem.UWESaveInProgressViewModel.IsAnySaveInProgress
// 0x0001 (0x0001 - 0x0000)
struct UWESaveInProgressViewModel_IsAnySaveInProgress final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveObject.SetHandle
// 0x0008 (0x0008 - 0x0000)
struct UWESaveObject_SetHandle final
{
public:
	class UUWESaveHandle*                         InSaveHandle;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESaveSystem.UWESaveSystemSettings.GetDurationInSecondsToWaitAfterLastSavePromptSaveOnExit
// 0x0004 (0x0004 - 0x0000)
struct UWESaveSystemSettings_GetDurationInSecondsToWaitAfterLastSavePromptSaveOnExit final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

