#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEStoryGoals

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UWEStoryGoals.UWEStoryGoal.IsUnlockingRequirementsSatisfied
// 0x0010 (0x0010 - 0x0000)
struct UWEStoryGoal_IsUnlockingRequirementsSatisfied final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEStoryGoals.UWEStoryGoalCommandComponent.UnlockPlayerStoryGoal
// 0x0008 (0x0008 - 0x0000)
struct UWEStoryGoalCommandComponent_UnlockPlayerStoryGoal final
{
public:
	class UUWEStoryGoal*                          StoryGoal;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEStoryGoals.UWEStoryGoalCommandComponent.UnlockWorldStoryGoal
// 0x0008 (0x0008 - 0x0000)
struct UWEStoryGoalCommandComponent_UnlockWorldStoryGoal final
{
public:
	class UUWEStoryGoal*                          StoryGoal;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEStoryGoals.UWEStoryGoalContainerComponent.GetNumStoryGoals
// 0x0004 (0x0004 - 0x0000)
struct UWEStoryGoalContainerComponent_GetNumStoryGoals final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEStoryGoals.UWEStoryGoalContainerComponent.HasStoryGoal
// 0x0010 (0x0010 - 0x0000)
struct UWEStoryGoalContainerComponent_HasStoryGoal final
{
public:
	class UUWEStoryGoal*                          StoryGoal;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEStoryGoals.UWEStoryGoalRule.IsRuleSatisfied
// 0x0010 (0x0010 - 0x0000)
struct UWEStoryGoalRule_IsRuleSatisfied final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEStoryGoals.UWEStoryGoalsStatics.IsStoryGoalUnlocked
// 0x0020 (0x0020 - 0x0000)
struct UWEStoryGoalsStatics_IsStoryGoalUnlocked final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEStoryGoal*                          StoryGoal;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           ForPlayerState;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEStoryGoals.UWEStoryGoalsStatics.UnlockPlayerStoryGoal
// 0x0018 (0x0018 - 0x0000)
struct UWEStoryGoalsStatics_UnlockPlayerStoryGoal final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEStoryGoal*                          StoryGoal;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           PlayerState;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEStoryGoals.UWEStoryGoalsStatics.UnlockPlayerStoryGoalForPawn
// 0x0018 (0x0018 - 0x0000)
struct UWEStoryGoalsStatics_UnlockPlayerStoryGoalForPawn final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEStoryGoal*                          StoryGoal;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  Pawn;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEStoryGoals.UWEStoryGoalsStatics.UnlockWorldStoryGoal
// 0x0010 (0x0010 - 0x0000)
struct UWEStoryGoalsStatics_UnlockWorldStoryGoal final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEStoryGoal*                          StoryGoal;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEStoryGoals.UWEStoryGoalsWorldSubsystem.StartTimedStoryGoalSequence
// 0x0008 (0x0008 - 0x0000)
struct UWEStoryGoalsWorldSubsystem_StartTimedStoryGoalSequence final
{
public:
	class UUWETimedStoryGoalSequenceDataAsset*    sequence;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEStoryGoals.UWEStoryGoalsWorldSubsystem.StopTimedStoryGoalSequence
// 0x0008 (0x0008 - 0x0000)
struct UWEStoryGoalsWorldSubsystem_StopTimedStoryGoalSequence final
{
public:
	class UUWETimedStoryGoalSequenceDataAsset*    sequence;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEStoryGoals.UWEStoryGoalsWorldSubsystem.UnlockStoryGoal
// 0x0018 (0x0018 - 0x0000)
struct UWEStoryGoalsWorldSubsystem_UnlockStoryGoal final
{
public:
	class UUWEStoryGoal*                          StoryGoal;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InitTarget;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IgnorePrerequisites;                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEStoryGoals.UWEStoryGoalTriggerComponent.OnBeginOverlap
// 0x0120 (0x0120 - 0x0000)
struct UWEStoryGoalTriggerComponent_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEStoryGoals.UWEStoryGoalTriggerComponent.OnEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct UWEStoryGoalTriggerComponent_OnEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

