#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWESubmarine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UWESubmarine.UWECompartmentConnector.SetIsOpen
// 0x0001 (0x0001 - 0x0000)
struct UWECompartmentConnector_SetIsOpen final
{
public:
	bool                                          bInIsOpen;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarine.AttachPilot
// 0x0008 (0x0008 - 0x0000)
struct UWESubmarine_AttachPilot final
{
public:
	class APawn*                                  Pilot;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarine.DetachPilot
// 0x0008 (0x0008 - 0x0000)
struct UWESubmarine_DetachPilot final
{
public:
	class APawn*                                  Pilot;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarine.OnEnergyEmpty
// 0x0008 (0x0008 - 0x0000)
struct UWESubmarine_OnEnergyEmpty final
{
public:
	class AActor*                                 Who;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarine.OnEnergyRefilled
// 0x0008 (0x0008 - 0x0000)
struct UWESubmarine_OnEnergyRefilled final
{
public:
	class AActor*                                 Who;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarineAlertStatusHandler.OnCollisionImminent
// 0x0001 (0x0001 - 0x0000)
struct UWESubmarineAlertStatusHandler_OnCollisionImminent final
{
public:
	bool                                          bNewCollisionImminent;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarineCompartment.AddWaterVolume
// 0x0008 (0x0008 - 0x0000)
struct UWESubmarineCompartment_AddWaterVolume final
{
public:
	float                                         InWaterVolume;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarineCompartment.OnEnergyEmpty
// 0x0008 (0x0008 - 0x0000)
struct UWESubmarineCompartment_OnEnergyEmpty final
{
public:
	class AActor*                                 Who;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarineCompartment.OnEnergyRefilled
// 0x0008 (0x0008 - 0x0000)
struct UWESubmarineCompartment_OnEnergyRefilled final
{
public:
	class AActor*                                 Who;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarineCompartment.SetFloodLevel
// 0x0004 (0x0004 - 0x0000)
struct UWESubmarineCompartment_SetFloodLevel final
{
public:
	float                                         InFloodLevel;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarineCompartment.SetWaterVolume
// 0x0004 (0x0004 - 0x0000)
struct UWESubmarineCompartment_SetWaterVolume final
{
public:
	float                                         InWaterVolume;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarineCompartment.GetCompartmentVolume
// 0x0004 (0x0004 - 0x0000)
struct UWESubmarineCompartment_GetCompartmentVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarineCompartment.GetFloodLevel
// 0x0004 (0x0004 - 0x0000)
struct UWESubmarineCompartment_GetFloodLevel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarineCompartment.GetWaterVolume
// 0x0004 (0x0004 - 0x0000)
struct UWESubmarineCompartment_GetWaterVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarinePilotComponent.OnRep_Submarine
// 0x0008 (0x0008 - 0x0000)
struct UWESubmarinePilotComponent_OnRep_Submarine final
{
public:
	class AUWESubmarine*                          OldSubmarine;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarinePilotComponent.RequestartPiloting
// 0x0008 (0x0008 - 0x0000)
struct UWESubmarinePilotComponent_RequestartPiloting final
{
public:
	class AUWESubmarine*                          InSubmarine;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarinePilotComponent.RequestStopPiloting
// 0x0010 (0x0010 - 0x0000)
struct UWESubmarinePilotComponent_RequestStopPiloting final
{
public:
	TArray<struct FVector>                        RequestedEjectLocations;                           // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarinePilotComponent.SubmitControl
// 0x0020 (0x0020 - 0x0000)
struct UWESubmarinePilotComponent_SubmitControl final
{
public:
	int8                                          InYawControl;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                InDirectionControl;                                // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESubmarine.UWESubmarinePilotComponent.GetSubmarine
// 0x0008 (0x0008 - 0x0000)
struct UWESubmarinePilotComponent_GetSubmarine final
{
public:
	class AUWESubmarine*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

