#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UWESonarAPI

#include "Basic.hpp"

#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// Class UWESonarAPI.UWESonarAPISubsystem
// 0x0150 (0x0180 - 0x0030)
class UUWESonarAPISubsystem final : public UGameInstanceSubsystem
{
public:
	class FString                                 UWESonarAPIUrl;                                    // 0x0030(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UWESonarLoginXSTSEndpoint;                         // 0x0040(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x100];                                     // 0x0050(0x0100)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BearerToken;                                       // 0x0150(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_160[0x20];                                     // 0x0160(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UWESonarAPISubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UWESonarAPISubsystem")
	}
	static class UUWESonarAPISubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESonarAPISubsystem>();
	}
};
DUMPER7_ASSERTS_UUWESonarAPISubsystem;

SDK_NAMESPACE_END
