#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWESpline

#include "Basic.hpp"

#include "UWESpline_structs.hpp"


namespace SDK::Params
{

// Function UWESpline.UWESplineComponent.AddSplineDataAtPosition
// 0x0040 (0x0040 - 0x0000)
struct UWESplineComponent_AddSplineDataAtPosition final
{
public:
	float                                         InPosition;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWESplinePointData                    InPointData;                                       // 0x0008(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWESpline.UWESplineComponent.SetAbsolutePositionAtSplinePoint
// 0x0008 (0x0008 - 0x0000)
struct UWESplineComponent_SetAbsolutePositionAtSplinePoint final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESpline.UWESplineComponent.SetFadeExtentAtSplinePoint
// 0x0008 (0x0008 - 0x0000)
struct UWESplineComponent_SetFadeExtentAtSplinePoint final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESpline.UWESplineComponent.GetFadeExtentAtSplineInputKey
// 0x0008 (0x0008 - 0x0000)
struct UWESplineComponent_GetFadeExtentAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESpline.UWESplineComponent.GetFadeExtentAtSplinePoint
// 0x0008 (0x0008 - 0x0000)
struct UWESplineComponent_GetFadeExtentAtSplinePoint final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESpline.UWESplineComponent.GetInputKeyAtPosition
// 0x0008 (0x0008 - 0x0000)
struct UWESplineComponent_GetInputKeyAtPosition final
{
public:
	float                                         InPosition;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWESpline.UWESplineComponent.GetSplineDataAtPosition
// 0x0040 (0x0040 - 0x0000)
struct UWESplineComponent_GetSplineDataAtPosition final
{
public:
	float                                         InPosition;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWESplinePointData                    ReturnValue;                                       // 0x0008(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

}

