#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEStoryGoals

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "UWEStoryGoals_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UWEAssetRegistry_classes.hpp"
#include "UWEStoryEvents_classes.hpp"


namespace SDK
{

// Class UWEStoryGoals.UWEStoryGoal
// 0x0098 (0x00E0 - 0x0048)
class UUWEStoryGoal final : public UUWEPrimaryDataAssetBase
{
public:
	EStoryGoalTargetType                          StoryGoalType;                                     // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FStoryGoalUnlock>               StoryGoalUnlocks;                                  // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UUWEStoryGoalRule*                      UnlockingRequirements;                             // 0x0060(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UnlockOnRequirementsMet;                           // 0x0068(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEDialogueStoryEvent*                 TriggeredDialogue;                                 // 0x0070(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWENotificationStoryEvent*             TriggeredNotification;                             // 0x0078(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWETagStoryEvent*                      TriggeredTagStoryEvent;                            // 0x0080(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           StoryGroupTag;                                     // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, int32>              PlayerCurrencyRewards;                             // 0x0090(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	bool IsUnlockingRequirementsSatisfied(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoal">();
	}
	static class UUWEStoryGoal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoal>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalCommandComponent
// 0x0000 (0x00C0 - 0x00C0)
class UUWEStoryGoalCommandComponent final : public UActorComponent
{
public:
	void UnlockPlayerStoryGoal(class UUWEStoryGoal* StoryGoal);
	void UnlockWorldStoryGoal(class UUWEStoryGoal* StoryGoal);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalCommandComponent">();
	}
	static class UUWEStoryGoalCommandComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalCommandComponent>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalContainerComponent
// 0x01A8 (0x0268 - 0x00C0)
class UUWEStoryGoalContainerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FStoryGoalUnlockRecord>         UnlockRecords;                                     // 0x00C8(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         MaxUnlockRecordsKept;                              // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUWEStoryGoalArray                     StoryGoals;                                        // 0x00E0(0x0128)(Edit, Net, EditConst, SaveGame, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSet<class UUWEStoryGoal*>                    CachedStoryGoals;                                  // 0x0208(0x0050)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWESaveHandle*                         SaveHandle;                                        // 0x0260(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void TestOnlyClearAllUnlocked();

	int32 GetNumStoryGoals() const;
	bool HasStoryGoal(class UUWEStoryGoal* StoryGoal) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalContainerComponent">();
	}
	static class UUWEStoryGoalContainerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalContainerComponent>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalPollingPlayerStateComponent
// 0x0020 (0x00E0 - 0x00C0)
class UUWEStoryGoalPollingPlayerStateComponent final : public UActorComponent
{
public:
	TArray<class UUWEStoryGoal*>                  AutoUnlockableStoryGoals;                          // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void PollStoryGoals();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalPollingPlayerStateComponent">();
	}
	static class UUWEStoryGoalPollingPlayerStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalPollingPlayerStateComponent>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalRule
// 0x0000 (0x0030 - 0x0030)
class UUWEStoryGoalRule : public UPrimaryDataAsset
{
public:
	bool IsRuleSatisfied(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalRule">();
	}
	static class UUWEStoryGoalRule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalRule>();
	}
};

// Class UWEStoryGoals.UWERequiredStoryGoalRule
// 0x0008 (0x0038 - 0x0030)
class UUWERequiredStoryGoalRule final : public UUWEStoryGoalRule
{
public:
	class UUWEStoryGoal*                          RequiredStoryGoalRef;                              // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWERequiredStoryGoalRule">();
	}
	static class UUWERequiredStoryGoalRule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWERequiredStoryGoalRule>();
	}
};

// Class UWEStoryGoals.UWEEventTrackerWorldCountRule
// 0x0020 (0x0050 - 0x0030)
class UUWEEventTrackerWorldCountRule final : public UUWEStoryGoalRule
{
public:
	struct FGameplayTag                           EventVerb;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EventTag;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEPrimaryDataAssetBase*               EventAsset;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinimumCount;                                      // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEEventTrackerWorldCountRule">();
	}
	static class UUWEEventTrackerWorldCountRule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEEventTrackerWorldCountRule>();
	}
};

// Class UWEStoryGoals.UWEEventTrackerPlayerCountRule
// 0x0020 (0x0050 - 0x0030)
class UUWEEventTrackerPlayerCountRule final : public UUWEStoryGoalRule
{
public:
	struct FGameplayTag                           EventVerb;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EventTag;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEPrimaryDataAssetBase*               EventAsset;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinimumCount;                                      // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEEventTrackerPlayerCountRule">();
	}
	static class UUWEEventTrackerPlayerCountRule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEEventTrackerPlayerCountRule>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalRuleAnd
// 0x0010 (0x0040 - 0x0030)
class UUWEStoryGoalRuleAnd final : public UUWEStoryGoalRule
{
public:
	TArray<class UUWEStoryGoalRule*>              Rules;                                             // 0x0030(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalRuleAnd">();
	}
	static class UUWEStoryGoalRuleAnd* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalRuleAnd>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalRuleOr
// 0x0010 (0x0040 - 0x0030)
class UUWEStoryGoalRuleOr final : public UUWEStoryGoalRule
{
public:
	TArray<class UUWEStoryGoalRule*>              Rules;                                             // 0x0030(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalRuleOr">();
	}
	static class UUWEStoryGoalRuleOr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalRuleOr>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalRuleNegate
// 0x0008 (0x0038 - 0x0030)
class UUWEStoryGoalRuleNegate final : public UUWEStoryGoalRule
{
public:
	class UUWEStoryGoalRule*                      RuleToNegate;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalRuleNegate">();
	}
	static class UUWEStoryGoalRuleNegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalRuleNegate>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalRuleCount
// 0x0018 (0x0048 - 0x0030)
class UUWEStoryGoalRuleCount final : public UUWEStoryGoalRule
{
public:
	TArray<class UUWEStoryGoalRule*>              Rules;                                             // 0x0030(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         MinimumCount;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalRuleCount">();
	}
	static class UUWEStoryGoalRuleCount* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalRuleCount>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalSchedule
// 0x0010 (0x0058 - 0x0048)
class UUWEStoryGoalSchedule final : public UUWEPrimaryDataAssetBase
{
public:
	TArray<struct FScheduledStoryGoal>            ScheduledStoryGoals;                               // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalSchedule">();
	}
	static class UUWEStoryGoalSchedule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalSchedule>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalsStatics
// 0x0000 (0x0028 - 0x0028)
class UUWEStoryGoalsStatics final : public UBlueprintFunctionLibrary
{
public:
	static bool IsStoryGoalUnlocked(class UObject* WorldContext, class UUWEStoryGoal* StoryGoal, class APlayerState* ForPlayerState);
	static void UnlockPlayerStoryGoal(class UObject* WorldContext, class UUWEStoryGoal* StoryGoal, class APlayerState* PlayerState);
	static void UnlockPlayerStoryGoalForPawn(class UObject* WorldContext, class UUWEStoryGoal* StoryGoal, class APawn* Pawn);
	static void UnlockWorldStoryGoal(class UObject* WorldContext, class UUWEStoryGoal* StoryGoal);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalsStatics">();
	}
	static class UUWEStoryGoalsStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalsStatics>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalStoryEvent
// 0x0008 (0x0058 - 0x0050)
class UUWEStoryGoalStoryEvent final : public UUWEStoryEvent
{
public:
	class UUWEStoryGoal*                          StoryGoalToUnlockRef;                              // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalStoryEvent">();
	}
	static class UUWEStoryGoalStoryEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalStoryEvent>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalsWorldSubsystem
// 0x0068 (0x00A8 - 0x0040)
class UUWEStoryGoalsWorldSubsystem final : public UTickableWorldSubsystem
{
public:
	TMulticastInlineDelegate<void(class UUWEStoryGoal* UnlockedStoryGoal, class AActor* ReceivingActor)> OnStoryGoalUnlocked; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnStoryGoalsChanged;                               // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FUWEPendingStoryGoalUnlock>     PendingUnlocks;                                    // 0x0060(0x0010)(ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	class UUWESaveHandle*                         SaveHandle;                                        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TOptional<struct FUWETimedStoryGoalSequence>  CurrentTimedStoryGoalSequence;                     // 0x0078(0x0030)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void StartTimedStoryGoalSequence(class UUWETimedStoryGoalSequenceDataAsset* sequence);
	void StopTimedStoryGoalSequence(class UUWETimedStoryGoalSequenceDataAsset* sequence);
	void UnlockStoryGoal(class UUWEStoryGoal* StoryGoal, class AActor* InitTarget, bool IgnorePrerequisites);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalsWorldSubsystem">();
	}
	static class UUWEStoryGoalsWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalsWorldSubsystem>();
	}
};

// Class UWEStoryGoals.WEStoryGoalTestHelpers
// 0x0000 (0x0028 - 0x0028)
class UWEStoryGoalTestHelpers final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WEStoryGoalTestHelpers">();
	}
	static class UWEStoryGoalTestHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWEStoryGoalTestHelpers>();
	}
};

// Class UWEStoryGoals.UWEStoryGoalTriggerComponent
// 0x0028 (0x0590 - 0x0568)
class UUWEStoryGoalTriggerComponent final : public UBoxComponent
{
public:
	TArray<class UUWEStoryGoal*>                  StoryGoalsRefToUnlock;                             // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UUWEStoryGoal*>                  StoryGoalsRefToUnlockOnEnd;                        // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_588[0x8];                                      // 0x0588(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEStoryGoalTriggerComponent">();
	}
	static class UUWEStoryGoalTriggerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEStoryGoalTriggerComponent>();
	}
};

// Class UWEStoryGoals.UWETimedStoryGoalSequenceDataAsset
// 0x0028 (0x0070 - 0x0048)
class UUWETimedStoryGoalSequenceDataAsset final : public UUWEPrimaryDataAssetBase
{
public:
	struct FUWETimedStoryGoalSequence             sequence;                                          // 0x0048(0x0028)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWETimedStoryGoalSequenceDataAsset">();
	}
	static class UUWETimedStoryGoalSequenceDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWETimedStoryGoalSequenceDataAsset>();
	}
};

}

