#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWETrigger

#include "Basic.hpp"

#include "UWETrigger_structs.hpp"


namespace SDK::Params
{

// Function UWETrigger.UWEPlayerTriggerAction.HandlePlayerJoined
// 0x0008 (0x0008 - 0x0000)
struct UWEPlayerTriggerAction_HandlePlayerJoined final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWETrigger.UWEActionCondition.CheckCondition
// 0x0010 (0x0010 - 0x0000)
struct UWEActionCondition_CheckCondition final
{
public:
	class AActor*                                 TriggeringActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWETrigger.UWETriggerBase.Trigger
// 0x0010 (0x0010 - 0x0000)
struct UWETriggerBase_Trigger final
{
public:
	EFUWETriggerOverlapType                       OverlapType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 ForActor;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWETrigger.UWETriggerBase.CanTrigger
// 0x0010 (0x0010 - 0x0000)
struct UWETriggerBase_CanTrigger final
{
public:
	class AActor*                                 ForActor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWETrigger.UWETriggerBase.TryExecuteActions
// 0x0010 (0x0010 - 0x0000)
struct UWETriggerBase_TryExecuteActions final
{
public:
	class AActor*                                 ForActor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFUWETriggerOverlapType                       OverlapType;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWETrigger.UWEGenericButton.BroadcastButtonPressed
// 0x0008 (0x0008 - 0x0000)
struct UWEGenericButton_BroadcastButtonPressed final
{
public:
	class APawn*                                  InteractingPawn;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWETrigger.UWEGenericButton.IsAlreadyTriggeredForPlayer
// 0x0010 (0x0010 - 0x0000)
struct UWEGenericButton_IsAlreadyTriggeredForPlayer final
{
public:
	class AActor*                                 Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWETrigger.UWEGenericButton.IsInteractable
// 0x0001 (0x0001 - 0x0000)
struct UWEGenericButton_IsInteractable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

