#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWETickAggregation

#include "Basic.hpp"

#include "UWEImGui_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class UWETickAggregation.UWEAggregatedTickerBase
// 0x0080 (0x0330 - 0x02B0)
class AUWEAggregatedTickerBase : public AActor
{
public:
	uint8                                         Pad_2B0[0x80];                                     // 0x02B0(0x0080)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAggregatedTickerBase">();
	}
	static class AUWEAggregatedTickerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEAggregatedTickerBase>();
	}
};

// Class UWETickAggregation.UWEAggregatedActorTickerBase
// 0x0000 (0x0330 - 0x0330)
class AUWEAggregatedActorTickerBase : public AUWEAggregatedTickerBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAggregatedActorTickerBase">();
	}
	static class AUWEAggregatedActorTickerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEAggregatedActorTickerBase>();
	}
};

// Class UWETickAggregation.UWEAggregatedActorTicker
// 0x0058 (0x0388 - 0x0330)
class AUWEAggregatedActorTicker final : public AUWEAggregatedActorTickerBase
{
public:
	TSet<class AActor*>                           Actors;                                            // 0x0330(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAggregatedActorTicker">();
	}
	static class AUWEAggregatedActorTicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEAggregatedActorTicker>();
	}
};

// Class UWETickAggregation.UWEAggregatedComponentTickerBase
// 0x0000 (0x0330 - 0x0330)
class AUWEAggregatedComponentTickerBase : public AUWEAggregatedTickerBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAggregatedComponentTickerBase">();
	}
	static class AUWEAggregatedComponentTickerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEAggregatedComponentTickerBase>();
	}
};

// Class UWETickAggregation.UWEAggregatedComponentTicker
// 0x00A8 (0x03D8 - 0x0330)
class AUWEAggregatedComponentTicker final : public AUWEAggregatedComponentTickerBase
{
public:
	TSet<class UActorComponent*>                  Components;                                        // 0x0330(0x0050)(ExportObject, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<class UActorComponent*>                  ComponentsRemovedDuringTicking;                    // 0x0380(0x0050)(ExportObject, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D0[0x8];                                      // 0x03D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAggregatedComponentTicker">();
	}
	static class AUWEAggregatedComponentTicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEAggregatedComponentTicker>();
	}
};

// Class UWETickAggregation.UWEAsyncSpawnActor
// 0x0020 (0x0050 - 0x0030)
class UUWEAsyncSpawnActor final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class AActor* SpawnedActor)> OnSpawnFinished;                      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSpawnFailed;                                     // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UUWEAsyncSpawnActor* AsyncSpawnActor(class AActor* Owner, TSubclassOf<class AActor> ActorClass, const struct FTransform& Transform, ESpawnActorCollisionHandlingMethod CollisionHandlingOverride);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEAsyncSpawnActor">();
	}
	static class UUWEAsyncSpawnActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEAsyncSpawnActor>();
	}
};

// Class UWETickAggregation.UWETickAggregationDiagnostic
// 0x0000 (0x00F0 - 0x00F0)
class UUWETickAggregationDiagnostic final : public UUWEImGuiComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWETickAggregationDiagnostic">();
	}
	static class UUWETickAggregationDiagnostic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWETickAggregationDiagnostic>();
	}
};

// Class UWETickAggregation.UWETickAggregationSubsystem
// 0x00A0 (0x00D0 - 0x0030)
class UUWETickAggregationSubsystem : public UWorldSubsystem
{
public:
	TMap<class UClass*, class AUWEAggregatedComponentTickerBase*> ComponentTickers;                  // 0x0030(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class UClass*, class AUWEAggregatedActorTickerBase*> ActorTickers;                          // 0x0080(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWETickAggregationSubsystem">();
	}
	static class UUWETickAggregationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWETickAggregationSubsystem>();
	}
};

// Class UWETickAggregation.UWETimeSlicedTaskDiagnostic
// 0x0020 (0x0110 - 0x00F0)
class UUWETimeSlicedTaskDiagnostic final : public UUWEImGuiComponent
{
public:
	uint8                                         Pad_F0[0x20];                                      // 0x00F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWETimeSlicedTaskDiagnostic">();
	}
	static class UUWETimeSlicedTaskDiagnostic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWETimeSlicedTaskDiagnostic>();
	}
};

// Class UWETickAggregation.UWETimeSlicedTaskSubsystem
// 0x0030 (0x0070 - 0x0040)
class UUWETimeSlicedTaskSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x30];                                      // 0x0040(0x0030)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWETimeSlicedTaskSubsystem">();
	}
	static class UUWETimeSlicedTaskSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWETimeSlicedTaskSubsystem>();
	}
};

}

