#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWETrigger

#include "Basic.hpp"

#include "UWETrigger_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class UWETrigger.UWEPlayerTriggerAction
// 0x0040 (0x0290 - 0x0250)
class UUWEPlayerTriggerAction : public USceneComponent
{
public:
	uint8                                         Pad_250[0x8];                                      // 0x0250(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Delay;                                             // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BypassConditionActions;                            // 0x025C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFUWETriggerOverlapType                       ReactsTo;                                          // 0x025D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25E[0x2];                                      // 0x025E(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWESaveHandle*                         SaveHandle;                                        // 0x0260(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FUWEPendingTriggerAction>       PendingActions;                                    // 0x0268(0x0010)(Edit, ZeroConstructor, EditConst, SaveGame, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_278[0x18];                                     // 0x0278(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandlePlayerJoined(class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPlayerTriggerAction">();
	}
	static class UUWEPlayerTriggerAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPlayerTriggerAction>();
	}
};

// Class UWETrigger.UWEActionCondition
// 0x0040 (0x02D0 - 0x0290)
class UUWEActionCondition final : public UUWEPlayerTriggerAction
{
public:
	class FString                                 ConditionToCheck;                                  // 0x0290(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class AActor>                  TargetActor;                                       // 0x02A0(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUWECallFunctionContext                       Context;                                           // 0x02C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool CheckCondition(class AActor* TriggeringActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEActionCondition">();
	}
	static class UUWEActionCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEActionCondition>();
	}
};

// Class UWETrigger.UWECallFunctionAction
// 0x0040 (0x02D0 - 0x0290)
class UUWECallFunctionAction final : public UUWEPlayerTriggerAction
{
public:
	class FString                                 FunctionToCall;                                    // 0x0290(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class AActor>                  TargetActor;                                       // 0x02A0(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUWECallFunctionContext                       Context;                                           // 0x02C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWECallFunctionAction">();
	}
	static class UUWECallFunctionAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWECallFunctionAction>();
	}
};

// Class UWETrigger.UWEDestroyActorAction
// 0x0030 (0x02C0 - 0x0290)
class UUWEDestroyActorAction final : public UUWEPlayerTriggerAction
{
public:
	TSoftObjectPtr<class AActor>                  ActorToDestroy;                                    // 0x0290(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEDestroyActorAction">();
	}
	static class UUWEDestroyActorAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEDestroyActorAction>();
	}
};

// Class UWETrigger.UWEEventTrackerAction
// 0x0040 (0x02D0 - 0x0290)
class UUWEEventTrackerAction final : public UUWEPlayerTriggerAction
{
public:
	TSoftObjectPtr<class UUWEPrimaryDataAssetBase> DataAsset;                                        // 0x0290(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           Verb;                                              // 0x02B8(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           NotifyTag;                                         // 0x02C0(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEEventTrackerAction">();
	}
	static class UUWEEventTrackerAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEEventTrackerAction>();
	}
};

// Class UWETrigger.UWEExecuteCueAction
// 0x0040 (0x02D0 - 0x0290)
class UUWEExecuteCueAction final : public UUWEPlayerTriggerAction
{
public:
	struct FGameplayTag                           CueTag;                                            // 0x0290(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUWECueActionTarget                           TargetType;                                        // 0x0298(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TSoftObjectPtr<class AActor>                  TargetActor;                                       // 0x02A0(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEExecuteCueAction">();
	}
	static class UUWEExecuteCueAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEExecuteCueAction>();
	}
};

// Class UWETrigger.UWEExecuteTriggerAction
// 0x0030 (0x02C0 - 0x0290)
class UUWEExecuteTriggerAction final : public UUWEPlayerTriggerAction
{
public:
	TSoftObjectPtr<class AUWETriggerBase>         Trigger;                                           // 0x0290(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEExecuteTriggerAction">();
	}
	static class UUWEExecuteTriggerAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEExecuteTriggerAction>();
	}
};

// Class UWETrigger.UWEGameplayEffectAction
// 0x0030 (0x02C0 - 0x0290)
class UUWEGameplayEffectAction final : public UUWEPlayerTriggerAction
{
public:
	TSoftClassPtr<class UClass>                   GameplayEffect;                                    // 0x0290(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          Remove;                                            // 0x02B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEGameplayEffectAction">();
	}
	static class UUWEGameplayEffectAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEGameplayEffectAction>();
	}
};

// Class UWETrigger.UWEGameplayTagAction
// 0x0040 (0x02D0 - 0x0290)
class UUWEGameplayTagAction final : public UUWEPlayerTriggerAction
{
public:
	struct FGameplayTagContainer                  GrantTags;                                         // 0x0290(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RemoveTags;                                        // 0x02B0(0x0020)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEGameplayTagAction">();
	}
	static class UUWEGameplayTagAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEGameplayTagAction>();
	}
};

// Class UWETrigger.UWETriggerBase
// 0x0018 (0x02C8 - 0x02B0)
class AUWETriggerBase : public AActor
{
public:
	EUWEPlayerTriggerPolicy                       TriggerPolicy;                                     // 0x02B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(class AActor* TriggeringActor, bool TriggerWasSuccessful)> OnTrigger; // 0x02B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void Trigger(EFUWETriggerOverlapType OverlapType, class AActor* ForActor);

	bool CanTrigger(class AActor* ForActor) const;
	bool TryExecuteActions(class AActor* ForActor, EFUWETriggerOverlapType OverlapType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWETriggerBase">();
	}
	static class AUWETriggerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWETriggerBase>();
	}
};

// Class UWETrigger.UWEGenericButton
// 0x00A8 (0x0370 - 0x02C8)
class AUWEGenericButton : public AUWETriggerBase
{
public:
	uint8                                         Pad_2C8[0x10];                                     // 0x02C8(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnTimeLastTriggeredChanged;                        // 0x02D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnToggled;                                         // 0x02E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool NewState)> OnInteractabilityToggled;                          // 0x02F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 DisplayTextKey;                                    // 0x0308(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InteractType;                                      // 0x0318(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cooldown;                                          // 0x0320(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UUWEDialogueNode*>               DialogueToPlayOnSuccess;                           // 0x0328(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         MaxInteractionDistance;                            // 0x0338(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTriggered;                                        // 0x033C(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTurnedOn;                                         // 0x033D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, RepNotify, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUWEButtonInteractabilityState                InteractableState;                                 // 0x033E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, SaveGame, IsPlainOldData, RepNotify, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33F[0x1];                                      // 0x033F(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<int32>                                 TriggeredPlayerIds;                                // 0x0340(0x0010)(Edit, Net, ZeroConstructor, EditConst, SaveGame, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	float                                         TimeLastTriggered;                                 // 0x0350(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, RepNotify, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWESaveHandle*                         SaveHandle;                                        // 0x0358(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUWESaveComponent*                      SaveComponent;                                     // 0x0360(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        ClientTimeLastTriggered;                           // 0x0368(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BroadcastButtonPressed(class APawn* InteractingPawn);
	void OnButtonPressed();
	void OnRep_InteractableState();
	void OnRep_TimeLastTriggered();
	void OnRep_TurnedOn();
	void SetInteractabilityOff();
	void SetInteractabilityOn();

	bool IsAlreadyTriggeredForPlayer(class AActor* Player) const;
	bool IsInteractable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEGenericButton">();
	}
	static class AUWEGenericButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEGenericButton>();
	}
};

// Class UWETrigger.UWELoopingAudioTrigger
// 0x0038 (0x02E8 - 0x02B0)
class AUWELoopingAudioTrigger final : public AActor
{
public:
	TSoftObjectPtr<class UFMODEvent>              Event;                                             // 0x02B0(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                          BoxComponent;                                      // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWELoopingAudioTrigger">();
	}
	static class AUWELoopingAudioTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWELoopingAudioTrigger>();
	}
};

// Class UWETrigger.UWEPlayCameraShakeAction
// 0x0030 (0x02C0 - 0x0290)
class UUWEPlayCameraShakeAction final : public UUWEPlayerTriggerAction
{
public:
	TSoftClassPtr<class UClass>                   CameraShake;                                       // 0x0290(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InnerAttenuationRadius;                            // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         OuterAttenuationRadius;                            // 0x02BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPlayCameraShakeAction">();
	}
	static class UUWEPlayCameraShakeAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPlayCameraShakeAction>();
	}
};

// Class UWETrigger.UWEPlayDialogueAction
// 0x0030 (0x02C0 - 0x0290)
class UUWEPlayDialogueAction final : public UUWEPlayerTriggerAction
{
public:
	TSoftObjectPtr<class UUWEDialogueNode>        Dialogue;                                          // 0x0290(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPlayDialogueAction">();
	}
	static class UUWEPlayDialogueAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPlayDialogueAction>();
	}
};

// Class UWETrigger.UWEPlayerTrigger
// 0x0058 (0x0320 - 0x02C8)
class AUWEPlayerTrigger final : public AUWETriggerBase
{
public:
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWESaveComponent*                      SaveComponent;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBoxComponent*                          BoxComponent;                                      // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOnEnterTriggered;                                 // 0x02E0(0x0001)(Edit, Net, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bOnExitTriggered;                                  // 0x02E1(0x0001)(Edit, Net, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<int32>                                 EnteredPlayerIds;                                  // 0x02E8(0x0010)(Edit, Net, ZeroConstructor, EditConst, SaveGame, AdvancedDisplay, NativeAccessSpecifierPrivate)
	TArray<int32>                                 ExitedPlayerIds;                                   // 0x02F8(0x0010)(Edit, Net, ZeroConstructor, EditConst, SaveGame, AdvancedDisplay, NativeAccessSpecifierPrivate)
	class UUWESaveHandle*                         SaveHandle;                                        // 0x0308(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_310[0x10];                                     // 0x0310(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnRep_Triggered();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPlayerTrigger">();
	}
	static class AUWEPlayerTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEPlayerTrigger>();
	}
};

// Class UWETrigger.UWEPlaySequenceAction
// 0x0030 (0x02C0 - 0x0290)
class UUWEPlaySequenceAction final : public UUWEPlayerTriggerAction
{
public:
	TSoftObjectPtr<class ALevelSequenceActor>     SequenceActor;                                     // 0x0290(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StartTime;                                         // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPlaySequenceAction">();
	}
	static class UUWEPlaySequenceAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPlaySequenceAction>();
	}
};

// Class UWETrigger.UWEPlaySoundAction
// 0x0030 (0x02C0 - 0x0290)
class UUWEPlaySoundAction final : public UUWEPlayerTriggerAction
{
public:
	TSoftObjectPtr<class UFMODEvent>              Event;                                             // 0x0290(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEPlaySoundAction">();
	}
	static class UUWEPlaySoundAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEPlaySoundAction>();
	}
};

// Class UWETrigger.UWESpawnActorAction
// 0x0030 (0x02C0 - 0x0290)
class UUWESpawnActorAction final : public UUWEPlayerTriggerAction
{
public:
	TSoftClassPtr<class UClass>                   ActorToSpawn;                                      // 0x0290(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWESpawnActorAction">();
	}
	static class UUWESpawnActorAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWESpawnActorAction>();
	}
};

// Class UWETrigger.UWEUnlockStoryGoalAction
// 0x0030 (0x02C0 - 0x0290)
class UUWEUnlockStoryGoalAction final : public UUWEPlayerTriggerAction
{
public:
	TSoftObjectPtr<class UUWEStoryGoal>           StoryGoal;                                         // 0x0290(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEUnlockStoryGoalAction">();
	}
	static class UUWEUnlockStoryGoalAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEUnlockStoryGoalAction>();
	}
};

}

