#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWETemperatureRegions

#include "Basic.hpp"

#include "UWETemperatureRegions_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UWETemperatureRegions.UWETemperatureProviderInterface.GetTemperatureAlphaAtLocation
// 0x0020 (0x0020 - 0x0000)
struct UWETemperatureProviderInterface_GetTemperatureAlphaAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWETemperatureRegions.UWETemperatureProviderInterface.GetTemperatureContributionType
// 0x0001 (0x0001 - 0x0000)
struct UWETemperatureProviderInterface_GetTemperatureContributionType final
{
public:
	ETemperatureContributionType                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWETemperatureRegions.UWETemperatureProviderInterface.GetTemperatureContributionValue
// 0x0004 (0x0004 - 0x0000)
struct UWETemperatureProviderInterface_GetTemperatureContributionValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWETemperatureRegions.UWETemperatureRegionStatics.GetDefaultWorldTemperature
// 0x0004 (0x0004 - 0x0000)
struct UWETemperatureRegionStatics_GetDefaultWorldTemperature final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWETemperatureRegions.UWETemperatureRegionStatics.GetTemperatureAtLocation
// 0x0030 (0x0030 - 0x0000)
struct UWETemperatureRegionStatics_GetTemperatureAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        Sources;                                           // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWETemperatureRegions.UWETemperatureRegionTracker.GetTemperature
// 0x0004 (0x0004 - 0x0000)
struct UWETemperatureRegionTracker_GetTemperature final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

