#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEUserGeneratedContent

#include "Basic.hpp"

#include "UWEUserGeneratedContent_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class UWEUserGeneratedContent.UWEUGCComponent
// 0x0030 (0x00F0 - 0x00C0)
class UUWEUGCComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnPlayerTextChanged;                               // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UUWESaveHandle*                         SaveHandle;                                        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FUWEPlayerText>                 PlayerTexts;                                       // 0x00E0(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, RepNotify, NativeAccessSpecifierPublic)

public:
	class FText GetPlayerText(const struct FGameplayTag& TextKey, const class FText& DefaultText);
	void OnProfanityFilterChanged(bool bProfanityFilterEnabled);
	void OnRep_PlayerTexts();
	void ServerSetPlayerText(const struct FGameplayTag& TextKey, const class FString& PlayerText);

	bool HasUserGeneratedContent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEUGCComponent">();
	}
	static class UUWEUGCComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEUGCComponent>();
	}
};

// Class UWEUserGeneratedContent.UWEUGCSubsystem
// 0x0028 (0x0058 - 0x0030)
class UUWEUGCSubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(bool bProfanityFilterEnabled)> OnProfanityFilterChanged;           // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class FString>                         BannedWords;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bProfanityFilterEnabled;                           // 0x0050(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUGCDisabled;                                      // 0x0051(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class FText FilterUGCText(const class FText& InText, const class FText& FallbackText);
	void SetProfanityFilterEnabled(bool bEnabled);
	void SetUGCDisabled(bool bNewDisabled);

	bool IsProfanityFilterEnabled() const;
	bool IsUGCDisabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEUGCSubsystem">();
	}
	static class UUWEUGCSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEUGCSubsystem>();
	}
};

// Class UWEUserGeneratedContent.UWEUserGeneratedContentStatics
// 0x0000 (0x0028 - 0x0028)
class UUWEUserGeneratedContentStatics final : public UBlueprintFunctionLibrary
{
public:
	static bool GameHasUGC(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEUserGeneratedContentStatics">();
	}
	static class UUWEUserGeneratedContentStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEUserGeneratedContentStatics>();
	}
};

}

