#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEUserGeneratedContent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function UWEUserGeneratedContent.UWEUGCComponent.GetPlayerText
// 0x0028 (0x0028 - 0x0000)
struct UWEUGCComponent_GetPlayerText final
{
public:
	struct FGameplayTag                           TextKey;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DefaultText;                                       // 0x0008(0x0010)(Parm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEUserGeneratedContent.UWEUGCComponent.OnProfanityFilterChanged
// 0x0001 (0x0001 - 0x0000)
struct UWEUGCComponent_OnProfanityFilterChanged final
{
public:
	bool                                          bProfanityFilterEnabled;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEUserGeneratedContent.UWEUGCComponent.ServerSetPlayerText
// 0x0018 (0x0018 - 0x0000)
struct UWEUGCComponent_ServerSetPlayerText final
{
public:
	struct FGameplayTag                           TextKey;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayerText;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEUserGeneratedContent.UWEUGCComponent.HasUserGeneratedContent
// 0x0001 (0x0001 - 0x0000)
struct UWEUGCComponent_HasUserGeneratedContent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEUserGeneratedContent.UWEUGCSubsystem.FilterUGCText
// 0x0030 (0x0030 - 0x0000)
struct UWEUGCSubsystem_FilterUGCText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	class FText                                   FallbackText;                                      // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEUserGeneratedContent.UWEUGCSubsystem.SetProfanityFilterEnabled
// 0x0001 (0x0001 - 0x0000)
struct UWEUGCSubsystem_SetProfanityFilterEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEUserGeneratedContent.UWEUGCSubsystem.SetUGCDisabled
// 0x0001 (0x0001 - 0x0000)
struct UWEUGCSubsystem_SetUGCDisabled final
{
public:
	bool                                          bNewDisabled;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEUserGeneratedContent.UWEUGCSubsystem.IsProfanityFilterEnabled
// 0x0001 (0x0001 - 0x0000)
struct UWEUGCSubsystem_IsProfanityFilterEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEUserGeneratedContent.UWEUGCSubsystem.IsUGCDisabled
// 0x0001 (0x0001 - 0x0000)
struct UWEUGCSubsystem_IsUGCDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEUserGeneratedContent.UWEUserGeneratedContentStatics.GameHasUGC
// 0x0010 (0x0010 - 0x0000)
struct UWEUserGeneratedContentStatics_GameHasUGC final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

