#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEUnlockables

#include "Basic.hpp"

#include "UWEUnlockables_structs.hpp"


namespace SDK::Params
{

// Function UWEUnlockables.UWEUnlockableAsset.GetNotificationPackage
// 0x0070 (0x0070 - 0x0000)
struct UWEUnlockableAsset_GetNotificationPackage final
{
public:
	struct FUWEUnlockNotificationPackage          ReturnValue;                                       // 0x0000(0x0070)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEUnlockables.UWEUnlockableAsset.GetUnlockableAssetName
// 0x0010 (0x0010 - 0x0000)
struct UWEUnlockableAsset_GetUnlockableAssetName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEUnlockables.UWEUnlockableStatics.GetNotificationPackage
// 0x0078 (0x0078 - 0x0000)
struct UWEUnlockableStatics_GetNotificationPackage final
{
public:
	class UUWEPrimaryDataAssetBase*               Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUWEUnlockNotificationPackage          ReturnValue;                                       // 0x0008(0x0070)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEUnlockables.UWEUnlockableStatics.IsAssetUnlockedThroughUnlockComponent
// 0x0018 (0x0018 - 0x0000)
struct UWEUnlockableStatics_IsAssetUnlockedThroughUnlockComponent final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUWEPrimaryDataAssetBase*               UnlockableAsset;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

}

