#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEVolumeTracker

#include "Basic.hpp"

#include "UWEMath_structs.hpp"
#include "UWEVolumeTracker_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UWEVolumeTracker.ShapeVolumeComponent.IsSphereFullyInside
// 0x0080 (0x0080 - 0x0000)
struct ShapeVolumeComponent_IsSphereFullyInside final
{
public:
	struct FUWESphereTransformed                  Sphere;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.ShapeVolumeComponent.GetBounds
// 0x0038 (0x0038 - 0x0000)
struct ShapeVolumeComponent_GetBounds final
{
public:
	struct FBoxSphereBounds                       ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.ShapeVolumeComponent.GetTrackedVolumeData
// 0x0090 (0x0090 - 0x0000)
struct ShapeVolumeComponent_GetTrackedVolumeData final
{
public:
	struct FTrackedVolumeData                     ReturnValue;                                       // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.BoxVolumeComponent.SetBoxExtent
// 0x0020 (0x0020 - 0x0000)
struct BoxVolumeComponent_SetBoxExtent final
{
public:
	struct FVector                                InBoxExtent;                                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateOverlaps;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.BoxVolumeComponent.GetScaledBoxExtent
// 0x0018 (0x0018 - 0x0000)
struct BoxVolumeComponent_GetScaledBoxExtent final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.BoxVolumeComponent.GetUnscaledBoxExtent
// 0x0018 (0x0018 - 0x0000)
struct BoxVolumeComponent_GetUnscaledBoxExtent final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.BrushVolumeComponent.IsSphereFullyInside
// 0x0080 (0x0080 - 0x0000)
struct BrushVolumeComponent_IsSphereFullyInside final
{
public:
	struct FUWESphereTransformed                  Sphere;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.BrushVolumeComponent.GetBounds
// 0x0038 (0x0038 - 0x0000)
struct BrushVolumeComponent_GetBounds final
{
public:
	struct FBoxSphereBounds                       ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.BrushVolumeComponent.GetTrackedVolumeData
// 0x0090 (0x0090 - 0x0000)
struct BrushVolumeComponent_GetTrackedVolumeData final
{
public:
	struct FTrackedVolumeData                     ReturnValue;                                       // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.CapsuleVolumeComponent.SetCapsuleHalfHeight
// 0x0008 (0x0008 - 0x0000)
struct CapsuleVolumeComponent_SetCapsuleHalfHeight final
{
public:
	float                                         HalfHeight;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateOverlaps;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.CapsuleVolumeComponent.SetCapsuleRadius
// 0x0008 (0x0008 - 0x0000)
struct CapsuleVolumeComponent_SetCapsuleRadius final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateOverlaps;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.CapsuleVolumeComponent.SetCapsuleSize
// 0x000C (0x000C - 0x0000)
struct CapsuleVolumeComponent_SetCapsuleSize final
{
public:
	float                                         InRadius;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InHalfHeight;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateOverlaps;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.CapsuleVolumeComponent.GetScaledCapsuleHalfHeight
// 0x0004 (0x0004 - 0x0000)
struct CapsuleVolumeComponent_GetScaledCapsuleHalfHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.CapsuleVolumeComponent.GetScaledCapsuleRadius
// 0x0004 (0x0004 - 0x0000)
struct CapsuleVolumeComponent_GetScaledCapsuleRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.InstancedMeshVolumeComponent.IsSphereFullyInside
// 0x0080 (0x0080 - 0x0000)
struct InstancedMeshVolumeComponent_IsSphereFullyInside final
{
public:
	struct FUWESphereTransformed                  Sphere;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.InstancedMeshVolumeComponent.GetBounds
// 0x0038 (0x0038 - 0x0000)
struct InstancedMeshVolumeComponent_GetBounds final
{
public:
	struct FBoxSphereBounds                       ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.InstancedMeshVolumeComponent.GetTrackedVolumeData
// 0x0090 (0x0090 - 0x0000)
struct InstancedMeshVolumeComponent_GetTrackedVolumeData final
{
public:
	struct FTrackedVolumeData                     ReturnValue;                                       // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.SphereVolumeComponent.SetSphereRadius
// 0x0008 (0x0008 - 0x0000)
struct SphereVolumeComponent_SetSphereRadius final
{
public:
	float                                         InSphereRadius;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateOverlaps;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.SphereVolumeComponent.GetScaledSphereRadius
// 0x0004 (0x0004 - 0x0000)
struct SphereVolumeComponent_GetScaledSphereRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.SphereVolumeComponent.GetShapeScale
// 0x0004 (0x0004 - 0x0000)
struct SphereVolumeComponent_GetShapeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.SphereVolumeComponent.GetUnscaledSphereRadius
// 0x0004 (0x0004 - 0x0000)
struct SphereVolumeComponent_GetUnscaledSphereRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.SplineMeshVolumeComponent.IsSphereFullyInside
// 0x0080 (0x0080 - 0x0000)
struct SplineMeshVolumeComponent_IsSphereFullyInside final
{
public:
	struct FUWESphereTransformed                  Sphere;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.SplineMeshVolumeComponent.GetBounds
// 0x0038 (0x0038 - 0x0000)
struct SplineMeshVolumeComponent_GetBounds final
{
public:
	struct FBoxSphereBounds                       ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.SplineMeshVolumeComponent.GetTrackedVolumeData
// 0x0090 (0x0090 - 0x0000)
struct SplineMeshVolumeComponent_GetTrackedVolumeData final
{
public:
	struct FTrackedVolumeData                     ReturnValue;                                       // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.StaticMeshVolumeComponent.IsSphereFullyInside
// 0x0080 (0x0080 - 0x0000)
struct StaticMeshVolumeComponent_IsSphereFullyInside final
{
public:
	struct FUWESphereTransformed                  Sphere;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.StaticMeshVolumeComponent.GetBounds
// 0x0038 (0x0038 - 0x0000)
struct StaticMeshVolumeComponent_GetBounds final
{
public:
	struct FBoxSphereBounds                       ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.StaticMeshVolumeComponent.GetTrackedVolumeData
// 0x0090 (0x0090 - 0x0000)
struct StaticMeshVolumeComponent_GetTrackedVolumeData final
{
public:
	struct FTrackedVolumeData                     ReturnValue;                                       // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.TrackedVolume.IsSphereFullyInside
// 0x0080 (0x0080 - 0x0000)
struct TrackedVolume_IsSphereFullyInside final
{
public:
	struct FUWESphereTransformed                  Sphere;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.TrackedVolume.GetBounds
// 0x0038 (0x0038 - 0x0000)
struct TrackedVolume_GetBounds final
{
public:
	struct FBoxSphereBounds                       ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.TrackedVolume.GetTrackedVolumeData
// 0x0090 (0x0090 - 0x0000)
struct TrackedVolume_GetTrackedVolumeData final
{
public:
	struct FTrackedVolumeData                     ReturnValue;                                       // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeActor.GetTrackedVolumeData
// 0x0090 (0x0090 - 0x0000)
struct UWEVolumeActor_GetTrackedVolumeData final
{
public:
	struct FTrackedVolumeData                     ReturnValue;                                       // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeActor.IsPointInVolume
// 0x0020 (0x0020 - 0x0000)
struct UWEVolumeActor_IsPointInVolume final
{
public:
	struct FVector                                Point;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.UWEVolumeActorComponent.IsSphereFullyInside
// 0x0080 (0x0080 - 0x0000)
struct UWEVolumeActorComponent_IsSphereFullyInside final
{
public:
	struct FUWESphereTransformed                  Sphere;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.UWEVolumeActorComponent.GetBounds
// 0x0038 (0x0038 - 0x0000)
struct UWEVolumeActorComponent_GetBounds final
{
public:
	struct FBoxSphereBounds                       ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeActorComponent.GetTrackedVolumeData
// 0x0090 (0x0090 - 0x0000)
struct UWEVolumeActorComponent_GetTrackedVolumeData final
{
public:
	struct FTrackedVolumeData                     ReturnValue;                                       // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetCurrentTagsAtLocation
// 0x0048 (0x0048 - 0x0000)
struct UWEVolumeTrackerStatics_GetCurrentTagsAtLocation final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0028(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetDepth
// 0x0090 (0x0090 - 0x0000)
struct UWEVolumeTrackerStatics_GetDepth final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0070(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0088(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetDepthAtLocation
// 0x0028 (0x0028 - 0x0000)
struct UWEVolumeTrackerStatics_GetDepthAtLocation final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetDepthInOcean
// 0x0090 (0x0090 - 0x0000)
struct UWEVolumeTrackerStatics_GetDepthInOcean final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0070(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0088(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetDepthInOceanAtLocation
// 0x0028 (0x0028 - 0x0000)
struct UWEVolumeTrackerStatics_GetDepthInOceanAtLocation final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetVolumeQueryResultCurrentTags
// 0x0090 (0x0090 - 0x0000)
struct UWEVolumeTrackerStatics_GetVolumeQueryResultCurrentTags final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0070(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetVolumeQueryResultCurrentVolume
// 0x0080 (0x0080 - 0x0000)
struct UWEVolumeTrackerStatics_GetVolumeQueryResultCurrentVolume final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TScriptInterface<class ITrackedVolume>        ReturnValue;                                       // 0x0070(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetVolumeQueryResultCurrentVolumeObject
// 0x0078 (0x0078 - 0x0000)
struct UWEVolumeTrackerStatics_GetVolumeQueryResultCurrentVolumeObject final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetVolumeQueryResultOceanVolume
// 0x0080 (0x0080 - 0x0000)
struct UWEVolumeTrackerStatics_GetVolumeQueryResultOceanVolume final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TScriptInterface<class ITrackedVolume>        ReturnValue;                                       // 0x0070(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetVolumeQueryResultOuterVolume
// 0x0080 (0x0080 - 0x0000)
struct UWEVolumeTrackerStatics_GetVolumeQueryResultOuterVolume final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TScriptInterface<class ITrackedVolume>        ReturnValue;                                       // 0x0070(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetVolumeQueryResultVolumes
// 0x0080 (0x0080 - 0x0000)
struct UWEVolumeTrackerStatics_GetVolumeQueryResultVolumes final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<TScriptInterface<class ITrackedVolume>> ReturnValue;                                      // 0x0070(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetVolumeQueryResultVolumesObjects
// 0x0080 (0x0080 - 0x0000)
struct UWEVolumeTrackerStatics_GetVolumeQueryResultVolumesObjects final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0070(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.GetWaterLine
// 0x0088 (0x0088 - 0x0000)
struct UWEVolumeTrackerStatics_GetWaterLine final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.HasAirVolume
// 0x0078 (0x0078 - 0x0000)
struct UWEVolumeTrackerStatics_HasAirVolume final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.IsInWater
// 0x0078 (0x0078 - 0x0000)
struct UWEVolumeTrackerStatics_IsInWater final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.IsInWaterCurrent
// 0x0078 (0x0078 - 0x0000)
struct UWEVolumeTrackerStatics_IsInWaterCurrent final
{
public:
	struct FVolumeQueryResult                     Result;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.IsLocationInBase
// 0x0028 (0x0028 - 0x0000)
struct UWEVolumeTrackerStatics_IsLocationInBase final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.IsLocationInWaterCurrent
// 0x0028 (0x0028 - 0x0000)
struct UWEVolumeTrackerStatics_IsLocationInWaterCurrent final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.IsLocationUnderwater
// 0x0028 (0x0028 - 0x0000)
struct UWEVolumeTrackerStatics_IsLocationUnderwater final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.UWEVolumeTrackerStatics.QueryVolumes
// 0x00A0 (0x00A0 - 0x0000)
struct UWEVolumeTrackerStatics_QueryVolumes final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVolumeQueryResult                     Result;                                            // 0x0008(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
	const class AActor*                           IgnoreActor;                                       // 0x0078(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0080(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0098(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.VolumeTrackerComponent.OnBeginOverlap
// 0x0120 (0x0120 - 0x0000)
struct VolumeTrackerComponent_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComponent;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.VolumeTrackerComponent.OnEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct VolumeTrackerComponent_OnEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComponent;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function UWEVolumeTracker.VolumeTrackerComponent.GetCurrentVolumeType
// 0x0001 (0x0001 - 0x0000)
struct VolumeTrackerComponent_GetCurrentVolumeType final
{
public:
	EVolumeType                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.VolumeTrackerComponent.GetDepth
// 0x0004 (0x0004 - 0x0000)
struct VolumeTrackerComponent_GetDepth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.VolumeTrackerComponent.GetDepthInOcean
// 0x0004 (0x0004 - 0x0000)
struct VolumeTrackerComponent_GetDepthInOcean final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.VolumeTrackerComponent.GetWaterLine
// 0x0018 (0x0018 - 0x0000)
struct VolumeTrackerComponent_GetWaterLine final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.VolumeTrackerComponent.IsInWater
// 0x0001 (0x0001 - 0x0000)
struct VolumeTrackerComponent_IsInWater final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEVolumeTracker.VolumeTrackerComponent.IsInWaterCurrent
// 0x0001 (0x0001 - 0x0000)
struct VolumeTrackerComponent_IsInWaterCurrent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

