#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEVolumeTracker

#include "Basic.hpp"

#include "UWEVolumeTracker_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class UWEVolumeTracker.ShapeVolumeComponent
// 0x0098 (0x05E8 - 0x0550)
#pragma pack(push, 0x1)
class alignas(0x08) UShapeVolumeComponent : public UShapeComponent
{
public:
	uint8                                         Pad_550[0x8];                                      // 0x0550(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTrackedVolumeData                     VolumeData;                                        // 0x0558(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	bool IsSphereFullyInside(const struct FUWESphereTransformed& Sphere);

	struct FBoxSphereBounds GetBounds() const;
	const struct FTrackedVolumeData GetTrackedVolumeData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ShapeVolumeComponent">();
	}
	static class UShapeVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShapeVolumeComponent>();
	}
};
#pragma pack(pop)

// Class UWEVolumeTracker.BoxVolumeComponent
// 0x0028 (0x0610 - 0x05E8)
class UBoxVolumeComponent : public UShapeVolumeComponent
{
public:
	struct FVector                                BoxExtent;                                         // 0x05E8(0x0018)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     Material;                                          // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_608[0x8];                                      // 0x0608(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetBoxExtent(const struct FVector& InBoxExtent, bool bUpdateOverlaps);

	struct FVector GetScaledBoxExtent() const;
	struct FVector GetUnscaledBoxExtent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoxVolumeComponent">();
	}
	static class UBoxVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoxVolumeComponent>();
	}
};

// Class UWEVolumeTracker.BrushVolumeComponent
// 0x00A0 (0x05E0 - 0x0540)
class UBrushVolumeComponent final : public UBrushComponent
{
public:
	uint8                                         Pad_540[0x8];                                      // 0x0540(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTrackedVolumeData                     VolumeData;                                        // 0x0548(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FColor                                 WireColor;                                         // 0x05D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool IsSphereFullyInside(const struct FUWESphereTransformed& Sphere);

	struct FBoxSphereBounds GetBounds() const;
	const struct FTrackedVolumeData GetTrackedVolumeData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BrushVolumeComponent">();
	}
	static class UBrushVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBrushVolumeComponent>();
	}
};

// Class UWEVolumeTracker.CapsuleVolumeComponent
// 0x0008 (0x05F0 - 0x05E8)
class UCapsuleVolumeComponent : public UShapeVolumeComponent
{
public:
	float                                         CapsuleHalfHeight;                                 // 0x05E8(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CapsuleRadius;                                     // 0x05EC(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetCapsuleHalfHeight(float HalfHeight, bool bUpdateOverlaps);
	void SetCapsuleRadius(float Radius, bool bUpdateOverlaps);
	void SetCapsuleSize(float InRadius, float InHalfHeight, bool bUpdateOverlaps);

	float GetScaledCapsuleHalfHeight() const;
	float GetScaledCapsuleRadius() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CapsuleVolumeComponent">();
	}
	static class UCapsuleVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCapsuleVolumeComponent>();
	}
};

// Class UWEVolumeTracker.InstancedMeshVolumeComponent
// 0x00A0 (0x0A60 - 0x09C0)
class UInstancedMeshVolumeComponent final : public UInstancedStaticMeshComponent
{
public:
	uint8                                         Pad_9C0[0x8];                                      // 0x09C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTrackedVolumeData                     VolumeData;                                        // 0x09C8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_A58[0x8];                                      // 0x0A58(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool IsSphereFullyInside(const struct FUWESphereTransformed& Sphere);

	struct FBoxSphereBounds GetBounds() const;
	const struct FTrackedVolumeData GetTrackedVolumeData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedMeshVolumeComponent">();
	}
	static class UInstancedMeshVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedMeshVolumeComponent>();
	}
};

// Class UWEVolumeTracker.SphereVolumeComponent
// 0x0008 (0x05F0 - 0x05E8)
class USphereVolumeComponent : public UShapeVolumeComponent
{
public:
	float                                         SphereRadius;                                      // 0x05E8(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetSphereRadius(float InSphereRadius, bool bUpdateOverlaps);

	float GetScaledSphereRadius() const;
	float GetShapeScale() const;
	float GetUnscaledSphereRadius() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SphereVolumeComponent">();
	}
	static class USphereVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USphereVolumeComponent>();
	}
};

// Class UWEVolumeTracker.SplineMeshVolumeComponent
// 0x0090 (0x07F0 - 0x0760)
class USplineMeshVolumeComponent final : public USplineMeshComponent
{
public:
	struct FTrackedVolumeData                     VolumeData;                                        // 0x0760(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	bool IsSphereFullyInside(const struct FUWESphereTransformed& Sphere);

	struct FBoxSphereBounds GetBounds() const;
	const struct FTrackedVolumeData GetTrackedVolumeData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SplineMeshVolumeComponent">();
	}
	static class USplineMeshVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplineMeshVolumeComponent>();
	}
};

// Class UWEVolumeTracker.StaticMeshVolumeComponent
// 0x0098 (0x06C0 - 0x0628)
class UStaticMeshVolumeComponent final : public UStaticMeshComponent
{
public:
	uint8                                         Pad_628[0x8];                                      // 0x0628(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTrackedVolumeData                     VolumeData;                                        // 0x0630(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	bool IsSphereFullyInside(const struct FUWESphereTransformed& Sphere);

	struct FBoxSphereBounds GetBounds() const;
	const struct FTrackedVolumeData GetTrackedVolumeData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StaticMeshVolumeComponent">();
	}
	static class UStaticMeshVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStaticMeshVolumeComponent>();
	}
};

// Class UWEVolumeTracker.TrackedVolume
// 0x0000 (0x0000 - 0x0000)
class ITrackedVolume final
{
public:
	bool IsSphereFullyInside(const struct FUWESphereTransformed& Sphere);

	struct FBoxSphereBounds GetBounds() const;
	const struct FTrackedVolumeData GetTrackedVolumeData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TrackedVolume">();
	}
	static class ITrackedVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITrackedVolume>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class UWEVolumeTracker.UWEVolumeActor
// 0x0008 (0x02F0 - 0x02E8)
class AUWEVolumeActor final : public AVolume
{
public:
	class UUWEVolumeActorComponent*               VolumeActorComponent;                              // 0x02E8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	const struct FTrackedVolumeData GetTrackedVolumeData() const;
	bool IsPointInVolume(const struct FVector& Point, float Radius) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEVolumeActor">();
	}
	static class AUWEVolumeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUWEVolumeActor>();
	}
};

// Class UWEVolumeTracker.UWEVolumeActorComponent
// 0x00B0 (0x0170 - 0x00C0)
class UUWEVolumeActorComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void()>              OnVolumeDataChanged;                               // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	struct FTrackedVolumeData                     VolumeData;                                        // 0x00D8(0x0090)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                    TargetComponent;                                   // 0x0168(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool IsSphereFullyInside(const struct FUWESphereTransformed& Sphere);

	struct FBoxSphereBounds GetBounds() const;
	const struct FTrackedVolumeData GetTrackedVolumeData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEVolumeActorComponent">();
	}
	static class UUWEVolumeActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEVolumeActorComponent>();
	}
};

// Class UWEVolumeTracker.UWEVolumeTrackerSettings
// 0x0008 (0x0040 - 0x0038)
class UUWEVolumeTrackerSettings final : public UDeveloperSettings
{
public:
	class FName                                   CollisionProfile;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEVolumeTrackerSettings">();
	}
	static class UUWEVolumeTrackerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEVolumeTrackerSettings>();
	}
};

// Class UWEVolumeTracker.UWEVolumeTrackerStatics
// 0x0000 (0x0028 - 0x0028)
class UUWEVolumeTrackerStatics final : public UBlueprintFunctionLibrary
{
public:
	static struct FGameplayTagContainer GetCurrentTagsAtLocation(const class UObject* WorldContextObject, const struct FVector& Location, float Radius);
	static float GetDepth(const struct FVolumeQueryResult& Result, const struct FVector& Location);
	static float GetDepthAtLocation(const class UObject* WorldContextObject, const struct FVector& Location, float Radius);
	static float GetDepthInOcean(const struct FVolumeQueryResult& Result, const struct FVector& Location);
	static float GetDepthInOceanAtLocation(const class UObject* WorldContextObject, const struct FVector& Location, float Radius);
	static struct FGameplayTagContainer GetVolumeQueryResultCurrentTags(const struct FVolumeQueryResult& Result);
	static TScriptInterface<class ITrackedVolume> GetVolumeQueryResultCurrentVolume(const struct FVolumeQueryResult& Result);
	static class UObject* GetVolumeQueryResultCurrentVolumeObject(const struct FVolumeQueryResult& Result);
	static TScriptInterface<class ITrackedVolume> GetVolumeQueryResultOceanVolume(const struct FVolumeQueryResult& Result);
	static TScriptInterface<class ITrackedVolume> GetVolumeQueryResultOuterVolume(const struct FVolumeQueryResult& Result);
	static TArray<TScriptInterface<class ITrackedVolume>> GetVolumeQueryResultVolumes(const struct FVolumeQueryResult& Result);
	static TArray<class UObject*> GetVolumeQueryResultVolumesObjects(const struct FVolumeQueryResult& Result);
	static struct FVector GetWaterLine(const struct FVolumeQueryResult& Result);
	static bool HasAirVolume(const struct FVolumeQueryResult& Result);
	static bool IsInWater(const struct FVolumeQueryResult& Result);
	static bool IsInWaterCurrent(const struct FVolumeQueryResult& Result);
	static bool IsLocationInBase(const class UObject* WorldContextObject, const struct FVector& Location, float Radius);
	static bool IsLocationInWaterCurrent(const class UObject* WorldContextObject, const struct FVector& Location, float Radius);
	static bool IsLocationUnderwater(const class UObject* WorldContextObject, const struct FVector& Location, float Radius);
	static void QueryVolumes(const class UObject* WorldContextObject, struct FVolumeQueryResult* Result, const class AActor* IgnoreActor, const struct FVector& Location, float Radius);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UWEVolumeTrackerStatics">();
	}
	static class UUWEVolumeTrackerStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUWEVolumeTrackerStatics>();
	}
};

// Class UWEVolumeTracker.VolumeTester
// 0x0010 (0x02C0 - 0x02B0)
class AVolumeTester final : public AActor
{
public:
	class UVolumeTrackerComponent*                VolumeTracker;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVolumeType                                   ExpectedType;                                      // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VolumeTester">();
	}
	static class AVolumeTester* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVolumeTester>();
	}
};

// Class UWEVolumeTracker.VolumeTrackerComponent
// 0x0110 (0x0360 - 0x0250)
class UVolumeTrackerComponent final : public USceneComponent
{
public:
	uint8                                         Pad_250[0x48];                                     // 0x0250(0x0048)(Fixing Size After Last Property [ Dumper-8 ])
	EUWEVolumeTrackerQueryMode                    QueryMode;                                         // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUWEVolumeTrackerUpdateVolumesMode            UpdateVolumesMode;                                 // 0x0299(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EmulateNativeOverlapEventsForRootComponent;        // 0x029A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29B[0x1];                                      // 0x029B(0x0001)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         TrackerRadius;                                     // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EVolumeType VolumeType)> OnVolumeTypeChanged;                      // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EVolumeType VolumeType)> OnVolumeEnterEvent;                       // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EVolumeType VolumeType)> OnVolumeExitEvent;                        // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCurrentVolumeChanged;                            // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FVolumeQueryResult                     VolumeQueryResult;                                 // 0x02E0(0x0070)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	bool                                          IsDefaultEnabled;                                  // 0x0350(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_351[0xF];                                      // 0x0351(0x000F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComponent, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComponent, int32 OtherBodyIndex);
	void UpdateVolumes();

	EVolumeType GetCurrentVolumeType() const;
	float GetDepth() const;
	float GetDepthInOcean() const;
	struct FVector GetWaterLine() const;
	bool IsInWater() const;
	bool IsInWaterCurrent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VolumeTrackerComponent">();
	}
	static class UVolumeTrackerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVolumeTrackerComponent>();
	}
};

}

