#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEWeather

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum UWEWeather.EForecastMode
// NumValues: 0x0003
enum class EForecastMode : uint8
{
	Randomised                               = 0,
	Sequential                               = 1,
	EForecastMode_MAX                        = 2,
};

// ScriptStruct UWEWeather.MaterialParameterPair
// 0x0018 (0x0018 - 0x0000)
struct FMaterialParameterPair final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UWEWeather.ParsedVariables
// 0x0040 (0x0040 - 0x0000)
struct FParsedVariables final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct UWEWeather.WeatherForecastEntry
// 0x0010 (0x0010 - 0x0000)
struct FWeatherForecastEntry final
{
public:
	float                                         Chance;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEWeatherTypeBase*                    WeatherType;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

