#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEWeather

#include "Basic.hpp"

#include "UWEWeather_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UWEWeather.UWEWeatherGameStatics.GetFloatIntervalVariables
// 0x0090 (0x0090 - 0x0000)
struct UWEWeatherGameStatics_GetFloatIntervalVariables final
{
public:
	struct FParsedVariables                       ParsedVariables;                                   // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FFloatInterval>      ReturnValue;                                       // 0x0040(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherGameStatics.GetFloatVariables
// 0x0090 (0x0090 - 0x0000)
struct UWEWeatherGameStatics_GetFloatVariables final
{
public:
	struct FParsedVariables                       ParsedVariables;                                   // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      ReturnValue;                                       // 0x0040(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherGameStatics.GetLinearColorVariables
// 0x0090 (0x0090 - 0x0000)
struct UWEWeatherGameStatics_GetLinearColorVariables final
{
public:
	struct FParsedVariables                       ParsedVariables;                                   // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FLinearColor>        ReturnValue;                                       // 0x0040(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherGameStatics.GetVector2Variables
// 0x0090 (0x0090 - 0x0000)
struct UWEWeatherGameStatics_GetVector2Variables final
{
public:
	struct FParsedVariables                       ParsedVariables;                                   // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVector2D>           ReturnValue;                                       // 0x0040(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherGameStatics.InterpolateStructs
// 0x0010 (0x0010 - 0x0000)
struct UWEWeatherGameStatics_InterpolateStructs final
{
public:
	int32                                         A;                                                 // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         B;                                                 // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         alpha;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutResult;                                         // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherGameStatics.PackMaterialProperties
// 0x0090 (0x0090 - 0x0000)
struct UWEWeatherGameStatics_PackMaterialProperties final
{
public:
	struct FParsedVariables                       A;                                                 // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FParsedVariables                       B;                                                 // 0x0040(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FMaterialParameterPair>         ReturnValue;                                       // 0x0080(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherGameStatics.ParseStructVariables
// 0x0048 (0x0048 - 0x0000)
struct UWEWeatherGameStatics_ParseStructVariables final
{
public:
	int32                                         Struct;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FParsedVariables                       ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherGameStatics.UpdateMaterialAndRenderOnTarget
// 0x0028 (0x0028 - 0x0000)
struct UWEWeatherGameStatics_UpdateMaterialAndRenderOnTarget final
{
public:
	class UMaterialInstanceDynamic*               DynamicMaterialInstance;                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMaterialParameterPair>         MaterialParameterList;                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherSyncComponent.SetCurrentWeather
// 0x0008 (0x0008 - 0x0000)
struct UWEWeatherSyncComponent_SetCurrentWeather final
{
public:
	class UUWEWeatherTypeBase*                    Weather;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherSyncComponent.SetIsWeatherEnabled
// 0x0001 (0x0001 - 0x0000)
struct UWEWeatherSyncComponent_SetIsWeatherEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherSyncComponent.SetNextWeather
// 0x0008 (0x0008 - 0x0000)
struct UWEWeatherSyncComponent_SetNextWeather final
{
public:
	class UUWEWeatherTypeBase*                    Weather;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherSyncComponent.GetCurrentWeather
// 0x0008 (0x0008 - 0x0000)
struct UWEWeatherSyncComponent_GetCurrentWeather final
{
public:
	class UUWEWeatherTypeBase*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherSyncComponent.GetIsWeatherEnabled
// 0x0001 (0x0001 - 0x0000)
struct UWEWeatherSyncComponent_GetIsWeatherEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherSyncComponent.GetNextWeather
// 0x0008 (0x0008 - 0x0000)
struct UWEWeatherSyncComponent_GetNextWeather final
{
public:
	class UUWEWeatherTypeBase*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherSyncComponent.GetRandomWeather
// 0x0008 (0x0008 - 0x0000)
struct UWEWeatherSyncComponent_GetRandomWeather final
{
public:
	class UUWEWeatherTypeBase*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWeather.UWEWeatherSyncComponent.GetTransitionAlpha
// 0x0004 (0x0004 - 0x0000)
struct UWEWeatherSyncComponent_GetTransitionAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

