#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UWEWaterCurrents

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UWEWaterCurrents.UWEWaterCurrentAffectedObject.GetEnteredWaterCurrents
// 0x0010 (0x0010 - 0x0000)
struct UWEWaterCurrentAffectedObject_GetEnteredWaterCurrents final
{
public:
	TArray<class AUWEOverlapWaterCurrent*>        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWEOverlapWaterCurrent.GetBaseSpeed
// 0x0004 (0x0004 - 0x0000)
struct UWEOverlapWaterCurrent_GetBaseSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWEOverlapWaterCurrent.GetVelocityAtLocation
// 0x0030 (0x0030 - 0x0000)
struct UWEOverlapWaterCurrent_GetVelocityAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWEOverlapWaterCurrent.OnEnter
// 0x0008 (0x0008 - 0x0000)
struct UWEOverlapWaterCurrent_OnEnter final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWEOverlapWaterCurrent.OnExit
// 0x0008 (0x0008 - 0x0000)
struct UWEOverlapWaterCurrent_OnExit final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWEOverlapWaterCurrent.SetWaterCurrentActive
// 0x0001 (0x0001 - 0x0000)
struct UWEOverlapWaterCurrent_SetWaterCurrentActive final
{
public:
	bool                                          InIsActive;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWESplineWaterCurrent.GetBaseRadius
// 0x0004 (0x0004 - 0x0000)
struct UWESplineWaterCurrent_GetBaseRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWESplineWaterCurrent.GetMaxSpeed
// 0x0004 (0x0004 - 0x0000)
struct UWESplineWaterCurrent_GetMaxSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWESplineWaterCurrent.GetMeshSegmentsCountAlongLength
// 0x0004 (0x0004 - 0x0000)
struct UWESplineWaterCurrent_GetMeshSegmentsCountAlongLength final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWESplineWaterCurrent.GetTierSettingsBP
// 0x0008 (0x0008 - 0x0000)
struct UWESplineWaterCurrent_GetTierSettingsBP final
{
public:
	class UUWESplineWaterCurrentTierSettings*     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWESplineWaterCurrent.GetVelocityAtSplineDistance
// 0x0020 (0x0020 - 0x0000)
struct UWESplineWaterCurrent_GetVelocityAtSplineDistance final
{
public:
	float                                         SplineDistance;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWESplineWaterCurrent.GetVelocityAtSplineDurationProportion
// 0x0020 (0x0020 - 0x0000)
struct UWESplineWaterCurrent_GetVelocityAtSplineDurationProportion final
{
public:
	float                                         SplineDurationProportion;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWESplineWaterCurrent.GetVelocitySettingsBP
// 0x0008 (0x0008 - 0x0000)
struct UWESplineWaterCurrent_GetVelocitySettingsBP final
{
public:
	class UUWESplineWaterCurrentVelocitySettings* ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UWEWaterCurrents.UWESplineWaterCurrent.SetBaseRadius
// 0x0004 (0x0004 - 0x0000)
struct UWESplineWaterCurrent_SetBaseRadius final
{
public:
	float                                         BaseRadius;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

