#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PDADialouge

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_PDADialouge.WBP_PDADialouge_C.DialogueLineChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_PDADialouge_C_DialogueLineChanged final
{
public:
	class FText                                   NewLine;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_PDADialouge_C_DialogueLineChanged;

// Function WBP_PDADialouge.WBP_PDADialouge_C.ExecuteUbergraph_WBP_PDADialouge
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_PDADialouge_C_ExecuteUbergraph_WBP_PDADialouge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	bool                                          K2Node_CustomEvent_Simple_;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_NewName;                        // 0x0020(0x0010)()
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_NewIcon;                        // 0x0030(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUWEDialogueViewModel*                  K2Node_DynamicCast_AsUWEDialogue_View_Model;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x007C(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_Icon;                           // 0x0090(0x0028)(HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_NewLine;                        // 0x00B8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetLargeTextScalingEnabled_ReturnValue;   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0118(0x0010)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0130(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0140(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0198(0x0010)()
};
DUMPER7_ASSERTS_WBP_PDADialouge_C_ExecuteUbergraph_WBP_PDADialouge;

// Function WBP_PDADialouge.WBP_PDADialouge_C.HandleSpeakerIconChanged
// 0x0028 (0x0028 - 0x0000)
struct WBP_PDADialouge_C_HandleSpeakerIconChanged final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PDADialouge_C_HandleSpeakerIconChanged;

// Function WBP_PDADialouge.WBP_PDADialouge_C.ResetPreAnimState
// 0x0070 (0x0070 - 0x0000)
struct WBP_PDADialouge_C_ResetPreAnimState final
{
public:
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0000(0x0038)(NoDestructor)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform_1;               // 0x0038(0x0038)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_PDADialouge_C_ResetPreAnimState;

// Function WBP_PDADialouge.WBP_PDADialouge_C.SetUWEDialogueViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_PDADialouge_C_SetUWEDialogueViewModel final
{
public:
	class UUWEDialogueViewModel*                  ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PDADialouge_C_SetUWEDialogueViewModel;

// Function WBP_PDADialouge.WBP_PDADialouge_C.SimpleSubtitlesModeUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PDADialouge_C_SimpleSubtitlesModeUpdated final
{
public:
	bool                                          Simple_;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PDADialouge_C_SimpleSubtitlesModeUpdated;

// Function WBP_PDADialouge.WBP_PDADialouge_C.SpeakerIconChanged
// 0x0028 (0x0028 - 0x0000)
struct WBP_PDADialouge_C_SpeakerIconChanged final
{
public:
	TSoftObjectPtr<class UTexture2D>              NewIcon;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PDADialouge_C_SpeakerIconChanged;

// Function WBP_PDADialouge.WBP_PDADialouge_C.SpeakerNameChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_PDADialouge_C_SpeakerNameChanged final
{
public:
	class FText                                   NewName;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_PDADialouge_C_SpeakerNameChanged;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
