#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_SettingsComboBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_SettingsWidgetBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SettingsComboBox.WBP_SettingsComboBox_C
// 0x0000 (0x10D98800 - 0x10D98800)
class UWBP_SettingsComboBox_C final : public UWBP_SettingsWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_SettingsComboBox_C;             // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_SettingsLabel_C*                   WBP_SettingsLabel;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ComboBox_C*                        WBP_ComboBox;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_35;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TMulticastInlineDelegate<void(int32 SelectedItem)> OnSelectionChanged;                           // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FText>                           Options;                                           // 0x0410(0x0010)(Edit, BlueprintVisible)

public:
	void BndEvt__WBP_SettingsComboBox_WBP_ComboBox_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature(int32 Value_0);
	void ExecuteUbergraph_WBP_SettingsComboBox(int32 EntryPoint);
	void HideHighlight();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SetOptions(TArray<class FText>& Options_0);
	void SetSelectedOption(int32 Index_0);
	void ShowHighlight();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SettingsComboBox_C">();
	}
	static class UWBP_SettingsComboBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SettingsComboBox_C>();
	}
};

}

