#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_SettingsSlider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_SettingsWidgetBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SettingsSlider.WBP_SettingsSlider_C
// 0x00D8 (0x10D988D8 - 0x10D98800)
class alignas(0x10D988D8) UWBP_SettingsSlider_C final : public UWBP_SettingsWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_SettingsSlider_C;               // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Slider_C*                          WBP_Slider;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SettingsLabel_C*                   WBP_SettingsLabel;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Value;                                             // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Slider_C*                          WBP_Slider_0;                                      // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Min_Value;                                         // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Max_Value;                                         // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DisplayMinAndMaxValues;                            // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         Step_Size__Rounding_;                              // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Display_As_Percentage;                             // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HideLabel;                                         // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_SettingsSlider_WBP_Slider_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature(double Value_0);
	void Construct();
	void ExecuteUbergraph_WBP_SettingsSlider(int32 EntryPoint);
	void HideHighlight(bool ApplyImmediately);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void ResetWidget();
	void ShowHighlight();
	void UpdateInternalSlider();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SettingsSlider_C">();
	}
	static class UWBP_SettingsSlider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SettingsSlider_C>();
	}
};

}

