#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_PowerPlantControlRoomScreen_Lower

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.AllOperationsCompleteUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_AllOperationsCompleteUpdated final
{
public:
	bool                                          Complete;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.ExecuteUbergraph_WBP_PowerPlantControlRoomScreen_Lower
// 0x0070 (0x0070 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_ExecuteUbergraph_WBP_PowerPlantControlRoomScreen_Lower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TDelegate<void(bool Successful)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Complete_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USN2PowerPlantControlStationLowerViewModel* K2Node_CustomEvent_ViewModel;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Blocked_1;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Blocked;                        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Dropped;                        // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Successful;                     // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Complete;                       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On;                             // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldWarningFlash_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldWarningFlash_ReturnValue_1;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_Initialize final
{
public:
	class USN2PowerPlantControlStationLowerViewModel* ViewModel;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.OnConsoleActivated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_OnConsoleActivated final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.OnNeedleBlockedUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_OnNeedleBlockedUpdated final
{
public:
	bool                                          bLocked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.OnNeedleDroppedSuccessfullyUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_OnNeedleDroppedSuccessfullyUpdated final
{
public:
	bool                                          Dropped;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.OnNeedleDropStart_Event
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_OnNeedleDropStart_Event final
{
public:
	bool                                          Successful;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.OnNeedleIdleUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_OnNeedleIdleUpdated final
{
public:
	bool                                          bLocked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.OnUpperControlStationStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_OnUpperControlStationStatusChanged final
{
public:
	bool                                          Complete;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.PlayNeedleDropAnimation
// 0x0015 (0x0015 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_PlayNeedleDropAnimation final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0004(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.RestoreNeedleDropped
// 0x0014 (0x0014 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_RestoreNeedleDropped final
{
public:
	float                                         CallFunc_GetPlaybackEndSeconds_ReturnValue;        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0004(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.SetLowerStationViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_SetLowerStationViewModel final
{
public:
	class USN2PowerPlantControlStationLowerViewModel* ViewModel;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Lower.WBP_PowerPlantControlRoomScreen_Lower_C.ShouldWarningFlash
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Lower_C_ShouldWarningFlash final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

