#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_BioLabScreen_LoadoutSlot_Button

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_BioLabScreen_LoadoutSlot_Button.WBP_BioLabScreen_LoadoutSlot_Button_C.ExecuteUbergraph_WBP_BioLabScreen_LoadoutSlot_Button
// 0x0098 (0x0098 - 0x0000)
struct WBP_BioLabScreen_LoadoutSlot_Button_C_ExecuteUbergraph_WBP_BioLabScreen_LoadoutSlot_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UWBP_FabricatorTooltip_C*               CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_SoftTexture;                    // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_CustomEvent_Texture;                        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bMatchSize;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UWBP_FabricatorTooltip_C*               CallFunc_Create_ReturnValue_1;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0050(0x0010)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UWBP_FabricatorTooltip_C*               K2Node_DynamicCast_AsWBP_Fabricator_Tooltip;       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0078(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue_1;                 // 0x0088(0x0010)()
};

// Function WBP_BioLabScreen_LoadoutSlot_Button.WBP_BioLabScreen_LoadoutSlot_Button_C.HandleSetIconSoft
// 0x0028 (0x0028 - 0x0000)
struct WBP_BioLabScreen_LoadoutSlot_Button_C_HandleSetIconSoft final
{
public:
	TSoftObjectPtr<class UTexture2D>              SoftTexture;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
};

// Function WBP_BioLabScreen_LoadoutSlot_Button.WBP_BioLabScreen_LoadoutSlot_Button_C.HandleSetIconWithSize
// 0x0010 (0x0010 - 0x0000)
struct WBP_BioLabScreen_LoadoutSlot_Button_C_HandleSetIconWithSize final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bMatchSize;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

