#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_FriendDeclineModal

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_FriendDeclineModal.WBP_FriendDeclineModal_C.BndEvt__WBP_FriendInviteModal_CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_FriendDeclineModal_C_BndEvt__WBP_FriendInviteModal_CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_FriendDeclineModal.WBP_FriendDeclineModal_C.BndEvt__WBP_FriendInviteModal_DeclineButtonRed_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_FriendDeclineModal_C_BndEvt__WBP_FriendInviteModal_DeclineButtonRed_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_FriendDeclineModal.WBP_FriendDeclineModal_C.ExecuteUbergraph_WBP_FriendDeclineModal
// 0x0028 (0x0028 - 0x0000)
struct WBP_FriendDeclineModal_C_ExecuteUbergraph_WBP_FriendDeclineModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Name;                           // 0x0018(0x0010)()
};

// Function WBP_FriendDeclineModal.WBP_FriendDeclineModal_C.SetFriendName
// 0x0010 (0x0010 - 0x0000)
struct WBP_FriendDeclineModal_C_SetFriendName final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};

}

