#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BioreactorStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "Subnautica2_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_BioreactorStatus.WBP_BioreactorStatus_C
// 0x0038 (0x03A0 - 0x0368)
class UWBP_BioreactorStatus_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CurrentPowerOutput;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUWELazyImage*                          CurrentItemIcon;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConsumptionTime_Progress;                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Center_Power_Background;                // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Center_Power;                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USN2BioreactorViewModel*                SN2BioreactorViewModel;                            // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_BioreactorStatus(int32 EntryPoint);
	void InterpBarPercent(class UMaterialInstanceDynamic* Material, double TargetPercent, double InterpSpeed);
	void PowerOutputChanged(double PowerOutput);
	void PowerStateChanged(ESN2BioreactorPowerConsumptionState State);
	void SetSN2BioreactorViewModel(class USN2BioreactorViewModel* ViewModel);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateBackgroundPowerColor();

	class FText __a84c3fdd_4384_4073_038c_b2bc6e44d934_SourceToDest() const;
	ESlateVisibility __fe817352_415f_601f_2d66_89aff9326666_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_BioreactorStatus_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_BioreactorStatus_C")
	}
	static class UWBP_BioreactorStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BioreactorStatus_C>();
	}
};
DUMPER7_ASSERTS_UWBP_BioreactorStatus_C;

SDK_NAMESPACE_END
