#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_PlayerInSubmarine

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerInSubmarine.WBP_PlayerInSubmarine_C.__76dac8cf-4d02-2d08-19de-6c8881d63c04_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_PlayerInSubmarine_C___76dac8cf_4d02_2d08_19de_6c8881d63c04_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PlayerInSubmarine.WBP_PlayerInSubmarine_C.__e3f31a8b-4782-fd15-289a-5097301e1f92_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_PlayerInSubmarine_C___e3f31a8b_4782_fd15_289a_5097301e1f92_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PlayerInSubmarine.WBP_PlayerInSubmarine_C.__eab4aa16-4b4f-a55a-2620-06b2b8c2937a_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_PlayerInSubmarine_C___eab4aa16_4b4f_a55a_2620_06b2b8c2937a_SourceToDest final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Conv_BoolToSlateVisibility_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

