#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_BioreactorWorldScreen

#include "Basic.hpp"

#include "Subnautica2_structs.hpp"


namespace SDK::Params
{

// Function WBP_BioreactorWorldScreen.WBP_BioreactorWorldScreen_C.ExecuteUbergraph_WBP_BioreactorWorldScreen
// 0x0050 (0x0050 - 0x0000)
struct WBP_BioreactorWorldScreen_C_ExecuteUbergraph_WBP_BioreactorWorldScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESN2BioreactorPowerConsumptionState           Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0028(0x0010)()
	ESN2BioreactorPowerConsumptionState           K2Node_CustomEvent_State;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0010)()
};

// Function WBP_BioreactorWorldScreen.WBP_BioreactorWorldScreen_C.SetSN2BioreactorViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_BioreactorWorldScreen_C_SetSN2BioreactorViewModel final
{
public:
	class USN2BioreactorViewModel*                ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_BioreactorWorldScreen.WBP_BioreactorWorldScreen_C.SetState
// 0x0001 (0x0001 - 0x0000)
struct WBP_BioreactorWorldScreen_C_SetState final
{
public:
	ESN2BioreactorPowerConsumptionState           State_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_BioreactorWorldScreen.WBP_BioreactorWorldScreen_C.SetViewModel
// 0x0008 (0x0008 - 0x0000)
struct WBP_BioreactorWorldScreen_C_SetViewModel final
{
public:
	class USN2BioreactorViewModel*                ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

