#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_AwaitingRespawnScreen

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_AwaitingRespawnScreen.WBP_AwaitingRespawnScreen_C.Continue
// 0x0018 (0x0018 - 0x0000)
struct WBP_AwaitingRespawnScreen_C_Continue final
{
public:
	class UWindowManager*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWindowManager*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushToLayer_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_AwaitingRespawnScreen.WBP_AwaitingRespawnScreen_C.ExecuteUbergraph_WBP_AwaitingRespawnScreen
// 0x0048 (0x0048 - 0x0000)
struct WBP_AwaitingRespawnScreen_C_ExecuteUbergraph_WBP_AwaitingRespawnScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USN2WaitForLocalPlayerReady*            CallFunc_WaitForLocalPlayerReady_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWindowManager*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0034(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

}

