#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_BioLabScreen_LoadoutSlot

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_BioLabScreen_LoadoutSlot.WBP_BioLabScreen_LoadoutSlot_C.BndEvt__WBP_BioLabScreen_LoadoutSlot_Button_LoadoutSlot_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BioLabScreen_LoadoutSlot_C_BndEvt__WBP_BioLabScreen_LoadoutSlot_Button_LoadoutSlot_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_BioLabScreen_LoadoutSlot.WBP_BioLabScreen_LoadoutSlot_C.ExecuteUbergraph_WBP_BioLabScreen_LoadoutSlot
// 0x0038 (0x0038 - 0x0000)
struct WBP_BioLabScreen_LoadoutSlot_C_ExecuteUbergraph_WBP_BioLabScreen_LoadoutSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsLocked;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	class UUWEBioAbilityViewModel*                K2Node_CustomEvent_UWEBioAbilityViewModel;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UMVVMSubsystem*                         CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_K2_GetViewFromUserWidget_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_BioLabScreen_LoadoutSlot.WBP_BioLabScreen_LoadoutSlot_C.SetIsLocked
// 0x0001 (0x0001 - 0x0000)
struct WBP_BioLabScreen_LoadoutSlot_C_SetIsLocked final
{
public:
	bool                                          IsLocked_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_BioLabScreen_LoadoutSlot.WBP_BioLabScreen_LoadoutSlot_C.SetUWEBioAbilityViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_BioLabScreen_LoadoutSlot_C_SetUWEBioAbilityViewModel final
{
public:
	class UUWEBioAbilityViewModel*                ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_BioLabScreen_LoadoutSlot.WBP_BioLabScreen_LoadoutSlot_C.UpdateLoadoutSlot
// 0x0008 (0x0008 - 0x0000)
struct WBP_BioLabScreen_LoadoutSlot_C_UpdateLoadoutSlot final
{
public:
	class UUWEBioAbilityViewModel*                UWEBioAbilityViewModel_0;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

