#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_SettingsComboBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_SettingsComboBox.WBP_SettingsComboBox_C.BndEvt__WBP_SettingsComboBox_WBP_ComboBox_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_SettingsComboBox_C_BndEvt__WBP_SettingsComboBox_WBP_ComboBox_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_SettingsComboBox.WBP_SettingsComboBox_C.ExecuteUbergraph_WBP_SettingsComboBox
// 0x0150 (0x0150 - 0x0000)
struct WBP_SettingsComboBox_C_ExecuteUbergraph_WBP_SettingsComboBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0048(0x0080)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C8(0x0080)(ConstParm)
	int32                                         K2Node_ComponentBoundEvent_Value;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_SettingsComboBox.WBP_SettingsComboBox_C.OnMouseEnter
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_SettingsComboBox_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function WBP_SettingsComboBox.WBP_SettingsComboBox_C.OnMouseLeave
// 0x0080 (0x0080 - 0x0000)
struct WBP_SettingsComboBox_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function WBP_SettingsComboBox.WBP_SettingsComboBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsComboBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_SettingsComboBox.WBP_SettingsComboBox_C.SetOptions
// 0x0010 (0x0010 - 0x0000)
struct WBP_SettingsComboBox_C_SetOptions final
{
public:
	TArray<class FText>                           Options_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function WBP_SettingsComboBox.WBP_SettingsComboBox_C.SetSelectedOption
// 0x0004 (0x0004 - 0x0000)
struct WBP_SettingsComboBox_C_SetSelectedOption final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

