#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PowerTerminalReserveScreen

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_PowerTerminalReserveScreen.WBP_PowerTerminalReserveScreen_C.ExecuteUbergraph_WBP_PowerTerminalReserveScreen
// 0x0028 (0x0028 - 0x0000)
struct WBP_PowerTerminalReserveScreen_C_ExecuteUbergraph_WBP_PowerTerminalReserveScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0008(0x0010)()
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0018(0x0010)()
};
DUMPER7_ASSERTS_WBP_PowerTerminalReserveScreen_C_ExecuteUbergraph_WBP_PowerTerminalReserveScreen;

// Function WBP_PowerTerminalReserveScreen.WBP_PowerTerminalReserveScreen_C.SetEnabledText
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerTerminalReserveScreen_C_SetEnabledText final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PowerTerminalReserveScreen_C_SetEnabledText;

// Function WBP_PowerTerminalReserveScreen.WBP_PowerTerminalReserveScreen_C.SetHeaderText
// 0x0010 (0x0010 - 0x0000)
struct WBP_PowerTerminalReserveScreen_C_SetHeaderText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_PowerTerminalReserveScreen_C_SetHeaderText;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
