#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabButton

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"
#include "Subnautica2_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_TabButton.WBP_TabButton_C.SetTabLabelInfo
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_TabButton_C_SetTabLabelInfo final
{
public:
	struct FSN2TabDescriptor                      TabDescriptor;                                     // 0x0000(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_WBP_TabButton_C_SetTabLabelInfo;

// Function WBP_TabButton.WBP_TabButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabButton_C_PreConstruct;

// Function WBP_TabButton.WBP_TabButton_C.ExecuteUbergraph_WBP_TabButton
// 0x0120 (0x0120 - 0x0000)
struct WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSN2TabDescriptor                      K2Node_Event_TabDescriptor;                        // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
