#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_StartScreen_TermsOfService

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWECommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StartScreen_TermsOfService.WBP_StartScreen_TermsOfService_C
// 0x10D983AD (0x10D98865 - 0x04B8)
class alignas(0x10D98865) UWBP_StartScreen_TermsOfService_C final : public UFocusActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_GenericButtonBig_C*                ScrollToEnd;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             LegalTextScrollBox;                                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LegalText_TextBlock;                               // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GenericButtonBig_C*                Accept;                                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUWETermsOfServiceViewModel*            UWETermsOfServiceViewModel;                        // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_StartScreen_TermsOfService_Accept_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_StartScreen_TermsOfService_ScrollToEnd_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void Construct();
	void ExecuteUbergraph_WBP_StartScreen_TermsOfService(int32 EntryPoint);
	void Finished_FEE7736948EEB3E8A94AB7A3CD0581E1();
	void NeedsToShow(bool* NeedsToShow_0);
	void OnInitialized();
	void OnTermsOfServiceTextScrolled(float CurrentOffset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StartScreen_TermsOfService_C">();
	}
	static class UWBP_StartScreen_TermsOfService_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StartScreen_TermsOfService_C>();
	}
};

}

