#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_IngameFeedback_EmojiButton

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_IngameFeedback_EmojiButton.WBP_IngameFeedback_EmojiButton_C.ExecuteUbergraph_WBP_IngameFeedback_EmojiButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_IngameFeedback_EmojiButton_C_ExecuteUbergraph_WBP_IngameFeedback_EmojiButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_IngameFeedback_EmojiButton.WBP_IngameFeedback_EmojiButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_IngameFeedback_EmojiButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

