#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_PowerPlantControlRoomScreen_Upper

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PowerPlantControlRoomScreen_Upper.WBP_PowerPlantControlRoomScreen_Upper_C.AllOperationsCompleteUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Upper_C_AllOperationsCompleteUpdated final
{
public:
	bool                                          Complete;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Upper.WBP_PowerPlantControlRoomScreen_Upper_C.ExecuteUbergraph_WBP_PowerPlantControlRoomScreen_Upper
// 0x0078 (0x0078 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Upper_C_ExecuteUbergraph_WBP_PowerPlantControlRoomScreen_Upper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Successful)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Complete_1;                     // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class USN2PowerPlantControlStationUpperViewModel* K2Node_CustomEvent_ViewModel;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Activated;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Complete;                       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Powered;                        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Successful;                     // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0034(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On;                             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldWarningFlash_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldWarningFlash_ReturnValue_1;         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Upper.WBP_PowerPlantControlRoomScreen_Upper_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Upper_C_Initialize final
{
public:
	class USN2PowerPlantControlStationUpperViewModel* ViewModel;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Upper.WBP_PowerPlantControlRoomScreen_Upper_C.OnActivatedUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Upper_C_OnActivatedUpdated final
{
public:
	bool                                          Activated;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Upper.WBP_PowerPlantControlRoomScreen_Upper_C.OnActivationAttempt_Event
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Upper_C_OnActivationAttempt_Event final
{
public:
	bool                                          Successful;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Upper.WBP_PowerPlantControlRoomScreen_Upper_C.OnConsoleActivated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Upper_C_OnConsoleActivated final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Upper.WBP_PowerPlantControlRoomScreen_Upper_C.OnLowerNeedleStatusUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Upper_C_OnLowerNeedleStatusUpdated final
{
public:
	bool                                          Complete;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Upper.WBP_PowerPlantControlRoomScreen_Upper_C.OnPoweredUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Upper_C_OnPoweredUpdated final
{
public:
	bool                                          Powered;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Upper.WBP_PowerPlantControlRoomScreen_Upper_C.SetStationViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Upper_C_SetStationViewModel final
{
public:
	class USN2PowerPlantControlStationUpperViewModel* ViewModel;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_PowerPlantControlRoomScreen_Upper.WBP_PowerPlantControlRoomScreen_Upper_C.ShouldWarningFlash
// 0x0004 (0x0004 - 0x0000)
struct WBP_PowerPlantControlRoomScreen_Upper_C_ShouldWarningFlash final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

