#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_ClientLobbyHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UWECommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ClientLobbyHUD.WBP_ClientLobbyHUD_C
// 0x10D98348 (0x10D98800 - 0x04B8)
class alignas(0x10D98800) UWBP_ClientLobbyHUD_C final : public UFocusActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Watermark_C*                       WBP_Watermark;                                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ProjectVersion_C*                  WBP_ProjectVersion2;                               // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NotificationsContainer_C*          WBP_NotificationsContainer;                        // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SystemMessageContainer;                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           IpAddressContainer;                                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Payload_Text;                                      // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_ClientLobbyHUD(int32 EntryPoint);
	void GetText();
	void OnMessageReceived_4F0538864C310AAA77E906AAA69181BA(class UUWEAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel, int32 SenderId);
	void OnRequestComplete_B655088342B256090020A8B30E64F5E2(const class FString& IpAddress);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ClientLobbyHUD_C">();
	}
	static class UWBP_ClientLobbyHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ClientLobbyHUD_C>();
	}
};

}

