#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuilderTool_Hologram_Background

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_BuilderTool_Hologram_Background.WBP_BuilderTool_Hologram_Background_C
// 0x0078 (0x0520 - 0x04A8)
class UWBP_BuilderTool_Hologram_Background_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 SideDecor_1;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AnimatedBack_2;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USN2EnergyToolViewModel*                SN2EnergyToolViewModel;                            // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USN2ScannerTargetViewModel*             SN2ScannerTargetViewModel;                         // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            NormalColor;                                       // 0x04D8(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NoPowerColor;                                      // 0x04EC(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasEnergy;                                         // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         WidgetsToColorChange;                              // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        CurrentEnergy;                                     // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateDMIColor();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetColors(const struct FSlateColor& Color);
	void MapAngleTo360(double InAngle, double* OutAngle);
	void IsScanFullyComplete(bool* Result);
	void InterpolateWidgetOpacity(class UWidget* Widget, double TargetOpacity, double InterpSpeed);
	void InterpolateColors(const struct FSlateColor& TargetColor, double InterpSpeed);
	void HandleHasEnergyChanged(bool HasPower);
	void HandleEnergyPercentChanged(double CurrentPercent);
	void HandleAmmoLoaded(bool AmmoLoaded);
	void ExecuteUbergraph_WBP_BuilderTool_Hologram_Background(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_BuilderTool_Hologram_Background_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_BuilderTool_Hologram_Background_C")
	}
	static class UWBP_BuilderTool_Hologram_Background_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BuilderTool_Hologram_Background_C>();
	}
};
DUMPER7_ASSERTS_UWBP_BuilderTool_Hologram_Background_C;

SDK_NAMESPACE_END
