#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_RichTextWithLinks

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_RichTextWithLinks.WBP_RichTextWithLinks_C.BndEvt__WBP_RichTextWithLinks_RichTextBlock_K2Node_ComponentBoundEvent_0_OnLinkClicked__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_RichTextWithLinks_C_BndEvt__WBP_RichTextWithLinks_RichTextBlock_K2Node_ComponentBoundEvent_0_OnLinkClicked__DelegateSignature final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Context;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function WBP_RichTextWithLinks.WBP_RichTextWithLinks_C.ExecuteUbergraph_WBP_RichTextWithLinks
// 0x0038 (0x0038 - 0x0000)
struct WBP_RichTextWithLinks_C_ExecuteUbergraph_WBP_RichTextWithLinks final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 K2Node_ComponentBoundEvent_Command;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_Context;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0028(0x0010)()
};

// Function WBP_RichTextWithLinks.WBP_RichTextWithLinks_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WBP_RichTextWithLinks_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};

}

