#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_CustomizationPartBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CustomizationPartBase.WBP_CustomizationPartBase_C.SetViewModel
// 0x0010 (0x0010 - 0x0000)
struct WBP_CustomizationPartBase_C_SetViewModel final
{
public:
	class USN2CustomizationItemViewModel*         ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PartList_C*                        OwningList;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_CustomizationPartBase.WBP_CustomizationPartBase_C.SetSN2CustomizationItemViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_CustomizationPartBase_C_SetSN2CustomizationItemViewModel final
{
public:
	class USN2CustomizationItemViewModel*         ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

