#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_NewsfeedRichText

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_NewsfeedRichText.WBP_NewsfeedRichText_C.BndEvt__WBP_NewsfeedRichText_UWERichTextBlockWithLinks_K2Node_ComponentBoundEvent_0_OnLinkClicked__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_NewsfeedRichText_C_BndEvt__WBP_NewsfeedRichText_UWERichTextBlockWithLinks_K2Node_ComponentBoundEvent_0_OnLinkClicked__DelegateSignature final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Context;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function WBP_NewsfeedRichText.WBP_NewsfeedRichText_C.ExecuteUbergraph_WBP_NewsfeedRichText
// 0x0028 (0x0028 - 0x0000)
struct WBP_NewsfeedRichText_C_ExecuteUbergraph_WBP_NewsfeedRichText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FString                                 K2Node_ComponentBoundEvent_Command;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_Context;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};

}

