#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_TriggeredNotificationOverActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TriggeredNotificationOverActor.WBP_TriggeredNotificationOverActor_C.ExecuteUbergraph_WBP_TriggeredNotificationOverActor
// 0x0028 (0x0028 - 0x0000)
struct WBP_TriggeredNotificationOverActor_C_ExecuteUbergraph_WBP_TriggeredNotificationOverActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0008(0x0010)()
	class UInputAction*                           K2Node_CustomEvent_InputAction;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_TriggeredNotificationOverActor.WBP_TriggeredNotificationOverActor_C.SetTutorialInputAction
// 0x0008 (0x0008 - 0x0000)
struct WBP_TriggeredNotificationOverActor_C_SetTutorialInputAction final
{
public:
	class UInputAction*                           InputAction;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_TriggeredNotificationOverActor.WBP_TriggeredNotificationOverActor_C.SetTutorialText
// 0x0010 (0x0010 - 0x0000)
struct WBP_TriggeredNotificationOverActor_C_SetTutorialText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};

}

