#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_ImageTabButton

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"
#include "Subnautica2_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ImageTabButton.WBP_ImageTabButton_C.ExecuteUbergraph_WBP_ImageTabButton
// 0x0168 (0x0168 - 0x0000)
struct WBP_ImageTabButton_C_ExecuteUbergraph_WBP_ImageTabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSN2TabDescriptor                      K2Node_Event_TabDescriptor;                        // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0104(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_1;              // 0x0114(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_2;              // 0x0138(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_3;              // 0x0148(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_4;              // 0x0158(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function WBP_ImageTabButton.WBP_ImageTabButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ImageTabButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_ImageTabButton.WBP_ImageTabButton_C.SetTabLabelInfo
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_ImageTabButton_C_SetTabLabelInfo final
{
public:
	struct FSN2TabDescriptor                      TabDescriptor;                                     // 0x0000(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};

}

