#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_CTI_FirstLine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CTI_FirstLine.WBP_CTI_FirstLine_C
// 0x10D98581 (0x10D988C1 - 0x0340)
class alignas(0x10D988C1) UWBP_CTI_FirstLine_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CommonTextBlock_WelcomeLine;                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Name;                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NameText;                                          // 0x0358(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   WelcomeLineText;                                   // 0x0368(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CTI_FirstLine(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void RefreshFirstLineText(const class FText& Text);
	void RefreshNameText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CTI_FirstLine_C">();
	}
	static class UWBP_CTI_FirstLine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CTI_FirstLine_C>();
	}
};

}

