#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: WBP_CTI_FirstLine

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CTI_FirstLine.WBP_CTI_FirstLine_C.ExecuteUbergraph_WBP_CTI_FirstLine
// 0x0028 (0x0028 - 0x0000)
struct WBP_CTI_FirstLine_C_ExecuteUbergraph_WBP_CTI_FirstLine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_CustomEvent_Text_1;                         // 0x0008(0x0010)()
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0018(0x0010)()
};

// Function WBP_CTI_FirstLine.WBP_CTI_FirstLine_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CTI_FirstLine_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_CTI_FirstLine.WBP_CTI_FirstLine_C.RefreshFirstLineText
// 0x0010 (0x0010 - 0x0000)
struct WBP_CTI_FirstLine_C_RefreshFirstLineText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_CTI_FirstLine.WBP_CTI_FirstLine_C.RefreshNameText
// 0x0010 (0x0010 - 0x0000)
struct WBP_CTI_FirstLine_C_RefreshNameText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};

}

